{"Reddit ID":"Anger_1","Reddit Post":"Long story short I walk in the kitchen and see this cat I strongly dislike eating some of my food it had pulled off the stove. I grab the cat and start choking it. I got damn close to killing it before I stopped. That was the first time I had hurt a living thing. I've got the table in anger and thrown things before but never harmed anyone or anything. I'm kinda scared I could hurt somebody. Any thoughts?"}
{"Reddit ID":"Anger_2","Reddit Post":"My SO cannot have discussions or be criticized or take direction from me at all. He is volatile. The response is always escalation beyond anything called for. He starts talking in a loud snide voice, cursing and telling me all the ways I am a horrible person. I have told him that we cannot live like this. I'm getting older and my stress response worries me. I'm actually scared I am going to have a heart attack or stroke out someday because of his tirades. In most ways he is a good person. He is more than a bit lazy at home. \n\nIn the past, I have capitulated to his rants. It always seemed like the easiest way to stop, but he has also 'blackmailed' me by asking where I'm going to go or telling me everything is his. After the anger calms, he always says he didn't mean it. \n\nThis blowing up isn't good for anyone. I am so tired of stress response or just doing everything myself so I don't have to ask for help. \n\nMy recent financial situation has changed. I could leave without taking anything from our marriage and it wouldn't leave me broke. But I do love him. I value our marriage, but I don't know how much of my stress hormones flying off the charts I can take. \n\nHe reminds me of a two or three year old. How do I stop this insanity?"}
{"Reddit ID":"Anger_3","Reddit Post":"Hi, I have a real issue when it's come to failing driving tests Ive done the driving test about 3 times and after those times I've lost my anger inside the car most things don't get me to that point of anger but I've never had anger issues up until recently mainly with this and to be honest it might just be because Im not competent enough to drive but it's only 1 minor mistake that fails me and I don't how to stop feeling this angry with this kind of thing."}
{"Reddit ID":"Anger_4","Reddit Post":"Hey everyone, I'm not really sure where to post this, but I'm hoping you could give me some insight here. \n\nGrowing up my father had intense anger issues, the sound of laughter too loud would set him off, but one really strange thing was that when he was angry his iris would turn completely black.\n\nI also had an incident where I woke up one night with feeling the floor moving (We had a house with those old wooden floors), his girlfriend running into my room screaming \"your dad, your dad\", I got up and went to his room, it was destroyed, the cupboards had been ripped off, the bed was turned over and broken, as I was about to enter the room, I saw my father on his haunches in the corner, growling like an animal (if I didn't see him, I would have thought there was an actual animal in there), needless to say I turned around and walked out and the next day everything was back to normal.\n\nI don't know if this ties in somehow, but when I was little I had extreme night terrors, that carried on for 5 years, I only slept through the night for the first time when I was 6. For 4 years I was terrified of eyes, my mom would have to come into the room with her head down and put my head over her shoulder, otherwise I would scream \"Your eyes, your eyes\". Maybe this ties into how my fathers eyes changed?\n\nNow that I am an adult I'm trying to make my peace with these past events, but I am struggling to find an answer to these bizarre things. Has anyone ever been so angry that this has happened to you? or have you seen anyone that this has happened to?\n\nThank you in advance"}
{"Reddit ID":"Anger_5","Reddit Post":"Hey guys, \n\nThis is my first time posting here so please let me know if I have broken any guidelines and I will fix them.\n\nContext (I hope this is more of a description than a rant): I am a highschooler if that matters, and I've only recently this year forced myself to remember memories of emotional\/sexual abuse from my parents and it's really caused a lot of new anger.\n\nI've been going through cycles of anger then guilt. And I'm not sure exactly what's happening, but I feel like I'm scared that I'm becoming my parents who abused me, because I've had so many instances where I could completely understand their exact logic in everything they've done to me, like when I almost raise my hand to hit someone I love or I feel an extreme urge to break something or punch a wall like they usually do. I feel like I'm almost walking in their footsteps and reliving THEM, and it makes me feel like an absolute monster.\n\nHow do I deal with this anger and fear? To me, it feels like it boils up until I can't control it and I have to hit something or cause some damage."}
{"Reddit ID":"Anger_9","Reddit Post":"anger stacks up and explodes Im 13 and for the last 2 years ive been controlling my anger, but every year i get a insane burst of anger. idk why but im a sadist so i have VERY bad thoughts about everyone and everything, thats probably why i can contain my anger. since i started elementary i had anger issues. like every week. i did some fucked up shit. when i entered 6 grade, i started to lose interest in being angry and my thoughts would keep me satisfied.\n\n today i had very severe need for anger, i needed to punch some1 rlly bad. with pe i had to do a lay out the next exercise, i declined with respect, but he said i must do it. i humbly declined again, but he wouldnt take it. so i did the lay out, i was mad. i finished the lay out while being constantly corrected. I walk back to my friends half crying from the anger. my friend makes a stupid comment and i snap. i kicked him in the face and calmly walked away. i just walked back home.  \n\n\nI hate it, why does this happen to me"}
{"Reddit ID":"Anger_11","Reddit Post":"Sounds weird, I know. When I am triggered and become EXTREMELY angry, it takes me multiple days to get rid of the residual anger. Even after the event has happened, and been wrapped up, I still can't shake the anger caused by the situation for a few days. \n\nI am wondering if there are people who have similar issues, and what ways you have found to let go of the residual anger\/cope? \n\nIt seems so absurd intellectually to still hold onto things, but I still can't shake it. \n\nFor context, my biggest trigger in the world is Dog urine or feces in my house. My boyfriend absolutely loves dogs and got a Beagle about 6 mos. ago. I on the other hand could do without ever seeing a dog again, but I put up with them. My one condition was that she be potty trained. She is potty trained, however, she is scared of literally EVERYTHING and also doesn't like me, so when he is gone she gets anxious and any loud noise or sudden movement has her peeing, trembling, whining, teeth chattering, the whole nine yards. She has even peed on my pillow in my bed before. It sends me through the roof, so much so that I need to leave so that I do not become violent. The thing that sucks is that other than her noise phobia, peeing, and separation anxiety from my bf, she is a very sweet and well trained dog. Her and I just do not get along, especially when she pees out of fear. \nBUT I hold onto the anger of wanting to just beat the hell out of her for days. So much so that I can't focus on anything and I can't stand to be around her."}
{"Reddit ID":"Anger_12","Reddit Post":"For my whole life I've always been a pushover and never able to get angry. People always yell at me and I always cower away and if I yell back it's abnormal and they ask \"oh you wanna be more of a man Bc your yelling\" no no that's not at all why it because you yelled at me first. Like my sister is always yelling at me every fucking day and I just yelled back and was told that. Just how can I make it more normal?"}
{"Reddit ID":"Anger_14","Reddit Post":"i fucking hate online school but my stupid fucking anxiety disorder makes irl school even more terrifying. so i'll have to stick with online, which means primarily teaching myself stuff because my teachers don't know how to teach and i'm too stupid to understand anything. i ran out of time on the quiz and got a 58 so in a fit of rage i grabbed my laptop screen and SNAPPED IT IN HALF. and now it won't even turn on. i usually take out anger on myself but my body was too sore to take any more punches or scratches. i hate myself and i wanna die and i hate school and geometry and now i have to tell my parents and i'll get grounded and i'll have to buy a replacement with money i don't have fuck fuck sorry for messy writing i'm on mobile because i snapped my fucking computer in half"}
{"Reddit ID":"Anger_15","Reddit Post":"I feel as though I have no control over the heat that surges through me 90% of the time. It's small things that really shouldn't upset anyone as much as it does me. My girlfriend not washing a dish, puppy playing with my other dog and making noise, and most small inconveniences seem to fire me up immensely. I do my best to not take it out on anyone or the dogs because I know it's not right but I am slipping. I know she can tell I am having a hard time and I know it is hard on her as well. I'd really like to start seeing a therapist but I do not know how to even go about doing that. I know part of my problem is a lack of release. I've spent the better part of my life gaming, but I just don't enjoy it anymore and it seems to just make me more angry. I've been trying different things like being more active with my dogs and building legos (which does help a lot actually but the sets are expensive so it's a momentary release).  I feel so stressed all the time like I just want to rip my hair out. I have no idea what to do anymore. I can't take living like this, feeling like a walking volcano on a constant verge of eruption."}
{"Reddit ID":"Anger_19","Reddit Post":"I always smesh my head in the wall or with my fist so bad till i feel dizzy and the first thing i think about when i open my eyes is cutting or scratching my throat off!!!\n\ni hate feeling this way but sometimes i love it what should i doI'm tired of ppl telling me i lost weight and that i have became skinny I was a huge bodybuilder in the passt and now all of a sudden i became very skinny due to 1 year or more without training but the only problem is that people keep telling me this remark and it's getting on my nervs really and the sad thing is that only the non athlete who are saying thos comments it's crazyyy , why dont people only speak positivity? no because they are idiotswe are fucked. Bro im sorry but we are fucked since day 1 we were born , there is no hope all of thos fairy tails stories are just pulshit , if you were brought to this life from a normal familly that aren't rich then you probably going to suffer in life and you may end up with a mental illnessI became addicted to trolling why? Hello ppl\n\nSo im addicted to trolling online i have bullied so many ppl i do it cause i feel better afterwards i dont know what's my problem but i feel an urge to troll i dont know really but i think the cause behind it is that i dont feel well inside , i feel like my heart start beating so fast and i feel pressure which lead me to troll"}
{"Reddit ID":"Anger_20","Reddit Post":"Even when people are clearly joking I still get insecure and a little hurt. I do my best not to show it but i think to the more perceptive folks it's probably obvious. \n\nZooming out from that it always feels stupid that I feel that way because I know it was just a joke but in the moment it still hurts. I really just can't not give a fuck..\n\nI get that heavy chest feeling and it stays with me for days when someone insults me. It's so stupid. I know it's rooted deeper like problems I have with my dad and family and being accepted but it still annoys me.\n\nIs there any fix to this?"}
{"Reddit ID":"Anger_24","Reddit Post":"I've always been the \"Debbie downer\" if you will. The glass is always half empty if you asked me. In my mind, it's a coping mechanism. If I never get my hopes up for a single thing and always expect the worst than I will never be disappointed, right? In theory, yes. But I've realized being so negative about absolutely everything has lead to my angry, miserable existence. Everything irritates me, everyone is annoying or stupid in my mind. And honestly it makes me so angry, ALL. THE. TIME. I'm sick of living like this. I know what my issue is but I have no clue how to even begin to fix it. I wish I was a positive person who woke up in the morning and looked forward to living but I'm just not and I'm afraid if I don't find some way to bring at least a little positivity into my thought process, I will be miserable forever. Any advice? I'm really at a loss and don't know where to go from this point in my life.\n\nEDITED to add: THANK YOU ALL SO MUCH!! I'm so happy I posted and have been thinking of all of your comments throughout my days!"}
{"Reddit ID":"Anger_26","Reddit Post":"I'm actually angry at my own weaknesses and shortcomings but as of late I've been taking them out on my(40f) SO and she suggested anger management.\n\nI dont have the patience to go through my church for it, for various reasons, so I'm coming here. Probably not a solid substitute but I'm getting the ball rolling.\n\nReading the bible, meditation, and classical music have been a good starting point for me."}
{"Reddit ID":"Anger_27","Reddit Post":"When I was younger I had a habit of striking things around me so I could feel the sting and calm myself down I guess. One day I broke a dresser drawer and kind of grew out of it there, but recently I've gotten back into the habit of it. When I get too flustered rather than damaging objects I find myself targetting my own body. Whether that be my face, or chest, or thighs, or anywhere really. I don't even realize I've done it until it's already over. I get bruises and can't explain them if anyone asks (luckily no one has). Although I do feel it helps to calm me down, I want to stop before I do any real damage. Does anyone have advice\/strategies on how to get out of the habit? Preferably nothing that involves therapy or medication, as I am 18 and live in the US."}
{"Reddit ID":"Anger_28","Reddit Post":"My anger issues became so hard to the point that nearly everything and everyone enrage mz. I'm 20 i have no problem okay I got no job but that is not the problem. For reasons I cannot explain I cannot seek for any medical help. I tried to start skating and join communities around it, but everytime some of them speak they are either toxic, or simply talking about other subjects which they have not a single clue about, enraging me more. \n\nI break things nearly everyday, if it isn't something material it's myself and I punch stuff to the point of bleeding. I had no traumas no ptsd no depression no mental or physical illness. I have a good life. Pleasd, help me, I am fearing for my own security because I cannot hurt others but even as I am writing this my knuckles are pissing blood. Help me. I beg you."}
{"Reddit ID":"Anger_29","Reddit Post":"I'm too old for meltdowns, and they happen every few months. I have road rage. I hate the drivers in my town. They are so fucking slow. I hate them. And I can't NOT drive, because I have a job, and Uber is too fucking expensive. Im always so angry behind th wheel. Im afraid that I will hurt someone"}
{"Reddit ID":"Anger_30","Reddit Post":"So as the title says really I decided this morning to try and download some apps to help manage my anger, I regularly feel like I'm on the verge of exploding and Tearing\/smashing everything to pieces, I'm talking every day. I didn't used to be like this years ago but nowadays I'm angry every day. I haven't got a clue where to start on managing it. The apps were all breathing technique and self sffirmation bollocks, now that sort of suit just gets me riled up even more. I'm not listening to myself saying bollocks like that I don't believe a fucking word of it, i just end up even angrier than when I started. What the hell am I supposed to do Anybody else in the same boat and not believe a word if this self help crap"}
{"Reddit ID":"Anger_31","Reddit Post":"I'm 38 year old dude but since a child these sounds drive me nuts, it's like the sound wave hits my brain and I go from 0 (feeling happy and peace) to 100 (upset\/anger) Oh man. In the words of Goofy \"Something Wrong Here\" :\/  \n\nAnyone like that or what you do to \"not\" get that way?"}
{"Reddit ID":"Anger_32","Reddit Post":"I am so angry, all the time. I wasn't always like this and I feel like I am really good at handling (for years I have felt fine while working a high stress sales job and even starting a business) but in the last few weeks I feel broken and tonight I hurt my wife's feelings over the dumbest thing and I just can't live like this. How can I cope with this shit, how can I feel like everything is ok when it clearly fucking isn't. How do you reset when you can't muster the energy or just don't care until after you lit into someone? how do I get more energy to love and have empathy when I'm just so sick of everything? If this isn't the right place I am very sorry but I haven't found anything but cliche bullshit when I google it and this was the first subreddit I found to ask."}
{"Reddit ID":"Anger_33","Reddit Post":"I'm am angry guy. I don't always let it show, but it's there. I feel it boiling over. I've been on simmer for a long while and I'm trying not to go crazy, but the little things are starting to get to me. Funny how that works right? Smiling at the big things but God forbid I stub my toe or anything in between. What are some outlets that you have taken to prevent you from snapping and losing your cool?"}
{"Reddit ID":"Anger_34","Reddit Post":"It goes hand in hand with the resentment. So much of my life already has been consumed by it. But it's just something that surfaces whenever it wants which is why I keep finding things to do trying to stay head of it.. Otherwise it's all gonna catch up to me.\n\nTo give you all context and long story short; i was an orphan from birth and bounced around from orphanages. \n\nDon't know who my biological parents are or where I came from.\n\nDon't have any siblings or know if I ever have any out there.\n\nDon't have anybody I consider adopted parents either since I never met anyone who deserves those titles. \n\nConversley I never met anybody who loved me like they would their own child.\n\nActually ended up being abused by foster \"parents\/abusers\" for a bit. I was lucky enough to survive and escape.\n\nSo now im doing just fine and I'm making a decent living."}
{"Reddit ID":"Anger_35","Reddit Post":"So I (19f) am at a family reunion like every week and it pisses me off real bad. This one little cousin keeps screaming abnormally loud, dogs got my clothes dirty and my grandma along with my aunts and mom keep telling me my jeans are awful and how i should and shouldn't look. Sounds stupid but I am just constantly angry, AT ALL TIMES, but this meetings have been getting more and more difficult to get through without reacting. I personally bite myself or get in the bathroom until I cool down, but I can't help being mean. My mom notices because she has anger issues too, and gets mad at me for not talking or responding vaguely. What can I do to stop saying mean things to my family? Is there a solution for this kind of irritability??"}
{"Reddit ID":"Anger_36","Reddit Post":"Any advice? I'm a college freshman and i decided to room with my 2 friends this semester. One of them is really easygoing, quiet, and clean, and I don't think I'll have any problems with her. My other friend is, as of now, my college best friend. We would always hangout together &amp; got along really well during the first semester. I have anxiety and sometimes when I'm overwhelmed I get irritable and annoyed at everything. I'm afraid I'll get annoyed at her while she's not doing anything wrong. I'm very organized and detail oriented and get irritated if anything is out of order. I also am a person who hyper-focuses (not sure if this is a word) on schoolwork, and any distraction from others gets on my nerves easily. This happened with my roommate last semester. I was so overwhelmed with work &amp; uncomfortable around her that everything she did made my blood boil and I'd cry when she'd leave. I don't want this to happen with my best friend and ruin our friendship, and possibly other friendships (since we are in the same friend group). Since I've moved my things into our room I avoid our group chat and things that remind me of her because I get sudden overwhelming feelings &amp; feelings of annoyance. \n\nI'm assuming that I'm feeling annoyed with her right now because I'm anxious about going back to school, a new room assignment, living with others, and starting a new routine. I go back on campus in a week and want to be able to stop overwhelming myself whenever I think of this upcoming semester and living with my friends. \n\nHow do I manage my annoyance &amp; anxiety over being annoyed?"}
{"Reddit ID":"Anger_37","Reddit Post":"I'm not sure what actually fuels my anger, I think it's mostly anxiety, especially with COVID-19 happening. Im a pretty chill guy I feel like, I smoke weed and mind my own business. After I calm down a bit I always feel like a fucktard and regret my anger. I don't lash out at people much, I might flip someone off here and there or just say \"fuck\" out loud a few times. I live on an island with a year round population of around 15,000 people but in the summer it sky rockets to around 100,000 people. I get very angry when I'm out in public, whether it's driving or just biking to the beach. My anger is usually affected by huge crowds of people, either taking up the whole bike path or just insane traffic. Everything will go back to normal once Labor Day rolls around but I really wish I could just be more calm and not get all irritated in the summer."}
{"Reddit ID":"Anger_38","Reddit Post":"I get uncontrollable rage randomly when I'm petting my dog. Before you yell at me, I know I'm a pos but please at least read the post \n\n\nI'm gonna get straight to the point, randomly when I'm petting my dog, Finn I get an uncontrollable anger and just beat Finn for 1 to 2 minutes (usually I'm crying my fucking eyes out and I'm screaming too) and I get extremely tired after this, usually I don't get up for 30 minutes to an hour. I also immediately apologize and tell Finn to get away from me (I don't want to look at him after) now, while I'm beating Finn I just get so angry, not at him just mad. I don't know why I do this I just do, now don't worry it's not daily, more monthly but I feel so bad and I wanna know if there's someway I can stop myself"}
{"Reddit ID":"Anger_39","Reddit Post":"My husband gets angry and upset about a lot of things very quickly. He mostly resorts to verbal aggression but sometimes, especially if he got hurt or was close to getting hurt, he also gets to physical aggression (throwing stuff around for instance). He also \"throws tantrums\" often, completely refusing something related to whatever made him angry. He would for instance refuse to eat dinner or something like that. He only rarely actually pulls through with that.\nThe issue is that he remembers each and every of these moments of anger and makes people around him responsible for it. \nI feel like with some kind of control he could relax about things around himself and brighten himself up in general. \nAny advice is welcome :)"}
{"Reddit ID":"Anger_41","Reddit Post":"My dad gets nervous and yells I don't know if this is the right place for this but maybe someone has some advice. Ever since I was younger my dad has always screamed at me whenever we disagree over something. He always says he's not screaming, but that he just talks loud. I talked to him recently about it and he says that he gets super nervous and looses all rational thoughts, overthinks things, and has a one track mind. I understand him now, but it still upsets me when he starts yelling and won't listen to anything I say, only insisting on his point of view. \n\nExample: When I tried speaking about him to go away for college, he kept talking loud\/screaming that I was dumb and didn't know anything. Later on, when I told him my decision he was upset that I didn't talk it over with him. \n\nIs there anything you would suggest to help him or that I can do?"}
{"Reddit ID":"Anger_43","Reddit Post":"Has your anger caused issues in your relationships with family and friends? How have you overcome it and whats your approach to handling the changes in these relationships?\n\nI like to think Ive improved how I approach my anger in my relationships (Ive learned to keep things to myself by being more quiet and not engaging in gatherings \/ discussions as much). The issue is that this has caused me to become more distant and I keep to myself a lot more. I don't spend time with my family out of fear that they'll make me angry and Ill develop a deeper hatred for them which I don't want.\n\nIt feels like theres no winning because if I was as social and spent more time with them, it creates more opportunity for arguments and my anger to come out. My only approach has been to distance myself and develop a more surface-level small-talk type relationship. Ive been in a better place emotionally with this approach but I hate the fact that I may become too distant.\n\nThe main cause of the arguments and fights is that my family often tries to control my every-decision and criticize my choices that affect them in no way at all."}
{"Reddit ID":"Anger_44","Reddit Post":"I had a talk with my partner how i was always either angry \/frustrated\/ annoyed or sad and how it feels awful. \n\nI said i noticed that when he was talking too quickly, in a frantic tone or dramatic tone for too long (past 10mins) that my adrenaline would kick in and my heart would start thumping like I was in fight mode. \n\nI have issues with my childhood where I was verbally abused and made to endure it for hours. Now my choices to manage my anxiety and adrenaline are usually to slow down my speech and hope they would chill out too.. drop sarcasm.. or start criticising.. or walk away from unpleasant encounters. That is, if was at a manageable level. I have told him he can distract me with a change of topic or music..\n\nI haven't found a way to manage the anger I feel especially when being lied to by stupid little things frequently by family. I almost always go nuclear on the person and point out their awfulness and personality deficits.\n\nSo while talking to him, he said something that made me curious. I found it interesting my anger dropped to a mid background level when I was curious. I am not sure which part of the brain is activated when curious- but it does seem I chanced upon a way to rewire my brain from the anger switch.. \n\njust sharing.."}
{"Reddit ID":"Anger_45","Reddit Post":"So, today I had a breakdown at the bank and almost got kicked out. The sad thing was mentally I knew they were right.\n\nThe story is, I had to put in the monthly installment for my father's credit card. So far so good, so I went to the bank, decided to use the ATM where you can \"load\" your card (sorry English is not my native language and can't remember the proper term) to avoid dealing with cashiers. So the stupid thing just started to shut down and swallowed my father's card. So normally they refused to give it to me, but something inside of me snapped. I am usually good at maintaining my cool and rarely start to shout but I started seeing red and went in a shouting match and almost got kicked out...\n\nAnd my father can only come tomorrow, I am the one who usually deals with cards and bank accounts as he is prone to losing them due to his stroke.\n\nI felt so angry, helpless and ashamed..."}
{"Reddit ID":"Anger_47","Reddit Post":"For the past 3 nights in a row I have had to leave the house to buy Afrin nasal decongestant. Every night it goes the exact same way. I get home from work at 12, I cant find my Afrin but try to go to sleep without it, spend 2 hours tossing and turning and then finally shoot straight up out of bed, grab the keys, drive 5 miles to the 24 hour Walgreens, buy the afrin, spray it in my nose once, bring it home, fall asleep, leave the afrin on the counter and by the next night I CANT FIND IT. 10 bucks I cant afford down the drain. I swear to fucking God I think Im going crazy because I just bought 2 bottles last night and put them RIGHT HERE and here I am at 4:40 AM about to drive to walgreens again. I swear I think my gf is hiding them while Im at work. I cant think of any other explanation. It is making me so fucking irrationally mad, I seriously think I might hurt somebody."}
{"Reddit ID":"Anger_48","Reddit Post":"Hi guys, \n\n24M and I recently discovered that I have some anger issues. \n\nIt usually happens in two cases: \n\n1) either when someone belittles me, like for example when they say stuff like \"ah he doesn't know shit\" or \"your opinion aint worth shit\".  However, I don't get triggered when I am called words at all. \n\n2) or whenever someone starts mocking me. For example, whenever I hear \"yeah whatever\", \"blablabla\", \"yea sure just stfu\" while I am trying to explain my point of view.  \n\nBoth of them are childish as fuck, but something gets short circuited in my brain and I just explode. \n\nI'm done being mad and angry. \n\nIs there anything you guys could suggest me to do?"}
{"Reddit ID":"Anger_49","Reddit Post":"I get anger almost on a daily basis but I'm pretty good at holding it in. The problem is holding it in\/calming down\/acting normal feels horrible. I feel almost light headed and like my heart beats so much harder, and I get so much angrier.\n\nMeaning instead of wanting to yell at someone, I want to just hit them. I'm also right on the edge, anything can come and burst my anger and it all comes out. \n\ndoes anyone else experience this and do you have any tips?"}
{"Reddit ID":"Anger_50","Reddit Post":"I've always been very angry, all the time. Up until about age 18 I couldn't control my anger, until I hit my boyfriend at the time and realised I had to make changes and control myself. I'm 21 now, and while I never have outbursts and can always diffuse a situation, that anger is always sitting under my skin. No matter how small the inconvenience I always imagine hurting someone, and I feel itchy and like I'm about to do it. \n\nI know this anger comes from my father's side of the family, they all had horrible anger issues and never got them under control, I'm already the best at it in the family. I'm worried something will happen and I'll snap and hurt someone. Is there a way around this? Healthy anger outbursts or something?"}
{"Reddit ID":"Anger_51","Reddit Post":"I've been in this relationship for over a year now and off late it's been quite alot of abuses and negativity. We.re serious about each other and things are quite advanced already but this abusive nature is really getting to me...\nI've been trying to control it but I can just feel that it's about to explode...\nI've had small bursts of punching the wall n breaking things, but never caused injury to any person...\nBut I'm scared with this built up frustration...I feel scared of my own anger that's been built up...\nTo make matters worse I don't have a job and am not getting support from the person in looking forward to either."}
{"Reddit ID":"Anger_52","Reddit Post":"I've hit a new low. I am 20 years old and after arguing and getting frustrated with my mom I bit her on the knuckle out of anger. I am an adult, I should be past those embarrassing child-like behaviours. Besides, at my age i'm pretty sure this classifies as domestic violence.\nThroughout my life I had those minor outbursts of violence, where i bit people, kicked them etc. then in effort of stopping it, i turned to myself and whenever anger got too overwhelming i would hit myself on the head but that just made me look like i'm unhinged and crazy, so not ideal either. I stopped both of those behaviours 2-3 years ago and I just pinpointed it to teenage hormones\/rebellion. i was so sure i got a hold of my violent outbursts, put them past me. i was doing so well, those outbursts were no longer a thing, whenever i was about to throw a rage fit i managed to cool down. but today it came back all over again.\nnow i am seriously afraid I might hurt someone in the future out of anger. or even k*ll them. i'm legit afraid of myself. cause in the moment when i am angry, sometimes i experience such blinding rage that i seemingly can't stop myself.  i am so afraid that in the future i will hurt my potential boyfriend, friends, family. if this never stops, maybe someday i'll go to jail for abuse. i don't want that. i don't wanna be a bad person. i want to get better. \n\ni also feel very sorry and i wanna apologize to my mom. the deal is... she'll forgive me, of course she will, but i don't want to issue an empty apology without showing improvement first. words without improvement are worth nothing.\n\nany good techniques that will help me calm nerves in a heated moment fairly easily? i wanna be a good daughter so bad :("}
{"Reddit ID":"Anger_53","Reddit Post":"I have never in my life gotten physical regardless of how mad I am, but lately I have been really, REALLY fucking mad. I'm moving house right now and my finances are shit, as well as relationship stresses, etc. but I'm tired of being so mad.\n\nThe other day my girlfriend and I got into an argument, an actually pretty small one in contrast to our big fights, and I'm not joking when I say I had a strong urge to hit her. I never would and I didn't, but I did throw my phone at the wall. I wasn't even thinking, it just took over like an instinct reaction.\n\nMy girlfriend is shook up because she's never seen me do anything like that, and I'm not gonna lie I'm getting intrusive thoughts that I'm abusive because of it. I feel like such an asshole for scaring her so much. I love her and the fight was nothing compared to others - i think it was just everything else on top.\n\nWhat can I do to prevent this wave of rage in future??"}
{"Reddit ID":"Anger_54","Reddit Post":"Normally I'm a docile person but with my girlfriend I want to be angry about things. I find that anger so bitter sweet, but destructive. I don't know why I'm like this and want to know how to fix it. I know my dad was like this. He would purposefully set traps for us growing up to fall into so he could lash out. For example, when coming back from the trip he'd come a day early so he could find the house messy and take it out on us. I can see how destructive that was for our household and honestly do not want to raise children in that type of household so I wanna stop this before I get to that point in my life. Controlling anger through will is a good way, but is there way to stop enjoying this anger so I don't continually seek it out? That would pretty much stop it at its roots."}
{"Reddit ID":"Anger_55","Reddit Post":"Last minute customer can go to hell. Entitled customers kill yourself. What gives you the fucking right to come into any store and start giving attitude especially when you don't have the necessary information to assist you properly. Like I really wanna cut these customers throat. If you return petty shit fuck you too. In reality we hate you inconsiderate bastards. Especially you cheap fucks! Go shop at a goodwill you cheap fucking whores!!!"}
{"Reddit ID":"Anger_56","Reddit Post":"Beginning to hate everyone in my life I'm building deep resentment against all of my coworkers, family, friends, my partner and their friends and family too.\n\nI know that the common denominator is my and it's driven by my anger problem, not by anything they're doing necessarily. \n\nBut I just find myself in spirals of extreme anger that rushes through me surging to a manic high and leading me to feel repulsed by everyone I know and imagining fantasy confrontations with each of them.\n\nIn real life I've been snapping at them more and going down long unnecessary arguments where I resort to cruel personal attacks. \n\nIDK... not sure if I'm asking for advice or just venting here but felt like I should say it somewhere bc I can't complain to anybody I know. It sounds like such a selfish problem. I know I might be hurting them but I just can't control it nor do I care that much to try."}
{"Reddit ID":"Anger_57","Reddit Post":"I'm 6' tall, I'm 300 pounds, my voice is deep, and I'm high functioning autistic so I have poor control over my facial expressions so I'm CONSTANTLY misunderstood. It's actually hilarious because I don't feel like I always have an anger problem when it comes to normal stuff but I have a lot of self-hate from this problem and my sadness sometimes comes out as anger because of the self-hate part. Here's the thing...\n\nLast night my mom, dad, brother, and I went to see a melodrama and it was the best time. We all laughed and smiled the whole time. It was such an enjoyable experience. But... after the show ended and we started driving home, we were listening to music and my brother was like \"I'm gonna put this song on\" and I said \"eh I don't think mom and dad would like it. They're millennials.\"\n\nI said it in a joking way. Like 100% I was kidding and I meant it as a playful jab at millennials in general. Not just my parents. But my mom got offended and talked to me about it, and I thought about how this shit ALWAYS FUCKING HAPPENS AND I CANT FUCKING STAND IT I WANT TO FUCKING DIE IF IT MEANS THERES A CHANCE I CAN BE SOMEONE ELSE I FUCKING HATE BEING ME!!! Well she fucking took it up the ass like I said and then I got upset and started manically explaining how I didn't mean it like that and how I wasn't the one who ruined the night. (Maybe I was just trying to convince myself).\n\nIt just happened again right now and I'm crying as I'm typing. This shit happens all the time. My family would be better off without me and that's an actual fact and no one can convince me otherwise."}
{"Reddit ID":"Anger_58","Reddit Post":"Is it possible to get sick from anger or is that just something from the movies? I had been really angry for some days when Tuesday evening while working myself up on reddit my chest and head suddenly started to hurt for a couple hours and breathing hurt as well. I don't think I've ever felt anything like this. It isn't corona I assume. Was this just coincidence or is this something that can really happen?"}
{"Reddit ID":"Anger_60","Reddit Post":"I get mad at my partner for little things including when I want him to comfort me (he isn't obligated). Sometimes I get mad at them for playing video games and progressing without me. Sometimes I'll get mad when they drink even though they are a grown adult and I can't tell them no. How do I stop this cycle and just appreciate what they have done for me? This is definitely a me problem and I take all the blame as to why they find me irrational."}
{"Reddit ID":"Anger_62","Reddit Post":"The past few days have been tense in my house with my family (results of 6+ months inside the house with them). As a result, I've basically managed to take my anger out on projects (scale models) I've done for school and completely annihilate them by throwing and stomping them. I've also been walking my dog and smiling and waving at other dog walkers, who in return don't wave back. This causes an immediate rise in anger level and I basically give myself the impression that i'm giving them a death stare, and i start to realize that after it's too late. The latter incidents have me worried i'll eventually do something stupid if I don't catch myself. I'm mad at myself as what i've written seems to paints me as a petulant child, but it's reality. I've never been this quick to anger as in the past few 3-4 days."}
{"Reddit ID":"Anger_63","Reddit Post":"Hi there.  \n\nI am hoping to get some advice for helping my father and\/or helping me cope with him. He lives alone in California. I live in Australia. I try to call him weekly and we'll talk for a couple of hours. Nearly all of the conversations involve him ranting incessantly about something. Often it's something small that he's reframed to be much worse than it is. \n\nThis has been going on for years. I've tried just to listen. I've tried to help him reframe things. I've tried to get him to understand the impact these conversations have on me.  Nothing has worked. While he clearly feels bad that it's hurting me, he will immediately justify why he's angry. \n\nI feel like I'm walking into a minefield once a week.  Sometimes aren't as bad but when they are bad it ruins my day. It seeps over into how I interact with my family. I'm often exhausted and have to put off things until I'm feeling more resilient again. I don't want to stop calling him but I can't keep doing this.\n\nAny thoughts on what I can do? \n\nThank you."}
{"Reddit ID":"Anger_64","Reddit Post":"I'm not sure if this is the appropriate place to ask for help but I've been really irritable lately. If someone gives me a bit of attitude I snap. It can be friends or family over things that are small. And if I'm told to \"chill\" I only feel more angry. I wasn't irritable like this until a few months ago. I feel like eventually I'll just lose the people I value bc I snap at them"}
{"Reddit ID":"Anger_65","Reddit Post":"Hi All, UK here.\n\nLike a lot of people with Aspergers, I have anger management problems. I'm 29 and it still causes me problems.\n\nI know I have problems - I've always known I had problems. I'm pretty open and honest about it. At school the only advice I got was being told to hold my breath and count up to 10, well that and being told if I didn't grow up then I was going to go to prison.\n\nI have tried a lot of times - and with a lot of money - to manage my anger issues, but to be honest the feedback I've got from a few different counsellors and psychotherapists has been along the lines of \"well - everybody gets really angry sometimes\", \"you have Aspergers so it's quite normal\", \"you find yourself in a lot of situations at work and in your personal life that anybody would find stressful\".\n\nI've tried to DIY it with meditation and mindfulness, I know I need a 15 minute window to cool down after getting mad, I have tried antidepressants. Sometimes it seems like despite all of that, I just end up seeing red and ruining things.\n\nI think I am pretty clear *why* I get mad - in retrospect can rationalise it and go through what about a situation really frustrates me.\n\nI have an 18 month son and I can't stand to see him watch me get mad - I don't want to let anybody - especially him down with my temper. Who do I go to in order to find the *right* support?"}
{"Reddit ID":"Anger_66","Reddit Post":"My friend was talking about my breakup and told me how weak of a boyfriend I was due to the anxiety, i just exploded. I need to get rid of this fucking shit, im getting worse.Grumpy and angry all the time I've been angry and pessimistic for a long time and its only getting worse. My hatred for certain people and  topics affect my relationships and perspective about the world. Im only getting more toxic over time and its making me feel like shit. Does anyone have any tips for getting better?"}
{"Reddit ID":"Anger_67","Reddit Post":"Hi guys I'm 38 am a dad and engaged to wonderful woman. I used to abuse cocaine and alcohol but have gone sober even from bud. I'm happy and content and have a comfortable life but maybe once or twice a week my fiance and I will have an argument that results in me just going into a rage and embarrassing myself and behaving in a really pathetic and childish manner. I did therapy for a while and plan on going back. I want to say I'm depressed or having trouble accessing my emotions and maybe repress my anger. It's really messing up my life and making me feel like I can't get over this or be better. My mother behaved like this too and I hated when she acted so erratically. Any ideas on how to approach getting a handle on this and and improving my reaction and behavior?"}
{"Reddit ID":"Anger_68","Reddit Post":"I grew up being bullied by a big brother and then used that rage to my advantage - mostly in sports - but also in other aspects of life that gave me the energy and motivation to prove people wrong and achieve success. But as I've grown older (nearly 50) I see the unhealthy aspects of rage. It's never gotten me into trouble but I feel like I don't really feel alive unless I'm pissed off at something or someone. Anyone else struggling with these thoughts?"}
{"Reddit ID":"Anger_69","Reddit Post":"i just bite myself and bang my head. I'm too much of a little bitch to cut myself, and i hurt myself because i don't want to hurt the people around me. i also bite my phone and sometimes scratch my arms so hard my skin gets visible, puffy, red abrasions. i just wanted to vent, don't give me fucking advice"}
{"Reddit ID":"Anger_70","Reddit Post":"Lately I have been getting disproportionately angry at people who interrupt and talk over me. Its usually other, younger, parents who want to tell me how parenting works. They are my friends and I like them but I have been tempted to say things that might strain or ruin our friendship. Any tips on how to deal with this?"}
{"Reddit ID":"Anger_71","Reddit Post":"Going through a stressful time in my life and it's manifesting as anger. I've always been quick to anger, but it's never been this bad. The littlest things have started to set me off. Printer isn't working? I turn blood red and start radiating heat. Someone even remotely looks my way in public and I'm set off. I'm an extreme introvert and prefer not to even be around people most of the time. My anger is a problem because it's having an effect on my dogs. I'd never harm them, but they always walk from the room and hide when they see I'm getting mad, and that's what usually calms me down. I don't want to hurt the things I hold dear."}
{"Reddit ID":"Anger_72","Reddit Post":"I'm trying to remain positive but I'm really getting frustrated. I'm a 23 year old man trying to get back on the dating scene. I know there are things I have to do for myself and I'm working on it but I really am struggling horribly with the dating scene. I believed it was because I'm ugly but I don't want to think that so I'm trying to erase that. People have told me in attractive but I remain skeptical at times. I haven't had a date in about 8 months and have barely gotten any likes or matches on eharmony, tinder, and bumble. I'm on 3 dating apps and I can't even get a girls number you read that right. I just don't know why I'm so disconnected from the dating scene. I cant blame it on girls losing interest because that's not the case at all. I never even get any interest to even get a response that's not a rejection. I don't know what it is. I'm not a total turn off, I'm funny, I'm fairly intelligent, I make good money, I'm fun to be around, I'm a vet and I have good taste in clothing. I don't want to think it's because I'm ugly but I just don't know what else I have to do at this point. I'm not expecting to find the love of my life that easily but like it'd be nice to be able to date"}
{"Reddit ID":"Anger_73","Reddit Post":"I have borderline personality disorder so my reactions to things can be pretty intense. I'm still really pissed right now typing this and have no idea how to feel better.\n\nMy apartment manager let us know that packages can no longer be delivered to the office- just our front doors. When I read the message I immediately knew that they would not leave packages at our door because they literally never did and the entire team just seems fucking lazy. So lo and behold, i check my mailbox and see a \"sorry we missed you\" notice. I was home ALL DAY and the package was an amazon package which does not require a signature and they refused to deliver it to my door.\n\nI had to go to the post office to pick it up. When I get there I tell the lady and ask why I'm here essentially why can't they just deliver to my fucking door. She says that it'd take the workers too long to do that because our complex gets so many packages. I'm soo annoyed. I feel inconvenienced because of the drive there and how absolutely unnecessary this is. It's like the residents are being punished because we order packages. Ridiculous. This always happens when I'm inconvenienced and know that others are in the wrong. I get even more pissed because I try to do the right thing when it comes to others and feel the lack of communication between my apartment managers and the USPS shows complete disregard for the residents. When I'm like this I stay mad for way too long. I don't react violently but I definitely take out my anger on those around me. I find it hard to get off the subject or talk about something else. \n\nAnyone else deal with this or have any advice for me?"}
{"Reddit ID":"Anger_74","Reddit Post":"I feel like a 10 year old, but i find myself infuriated when playing a game I love. It's 4v1, I play as the 1.\n\nI LOVE this game and don't want to quit... I've been playing for years and years.\n\nBut I get so. Fucking. Angry. When the other side is smart-assy. \n\nI struggle with losing anyway, but try to tell myself I can learn from this. I can't learn anything when people are intentionally making fun of me, baiting and taunting me with in-game mechanics. \n\nWhen I win, its all good. When I do okay, it's all good. \n\nWhen I lose and they make fun of me, I fucking hate myself and feel a deep hatred for the people on the other side, too, for not being graceful winners. I will even make up excuses of why I lost, refusing to take responsibility for my plays - because perhaps subconsciously, I believe losing = stupid. I want to never play this game again when I take a big L.\n\nHow the fuck do I get over this childish mentality and not be so angry? I have always been irritable but never had anger issues like this until I started playing games. I think the black-and-whiteness of winning and losing really gets to me."}
{"Reddit ID":"Anger_76","Reddit Post":"Well i just had 2 big fights with my girlfriend... I really love her. But sometimes she seeks out the bad things i say to freak out about it... Anyway i was trying to talk and kept making it harder. And i got angryer and so on. Until a point. I felt like being sick. I turned around and passed out. Fell to the ground. Like i never lost conscience but i just couldnt walk and fell over. Tryed getting up while my gf approached me. But i couldnt i was just flopping around have hard time breathing. I was saying stuff like : leave me alone, let me go, i wanna go,... \n\nAfter that i got a panic attack(had those when my mom died)\nCould anyone please tell me what i passed out from? Not passed out. More like what happend when i couldnt use my legs' i just stopped for a sec and fell over crawling but i couldnt get up... pls help. I dont wanna lose her. But i also dont wanna die. It felt like my brain stopped my legs because of my blood pressure or smth"}
{"Reddit ID":"Anger_77","Reddit Post":"Help!! Okay so Idk what happened to me i was the such a super chill person before but since like last year, I become angry at anything. I am literally pissed and angry all the time?? I don't know what to do, I feel like its affecting my life &amp; relations a lot &amp; there aren't good psychologists or anything here even if there are, I am not really able to share it with my fam cause they probably don't believe in psychologists (living in middle east is like that). I literally have such a bad attitude most of the time and everyone around me is complaining about it from a couple of months. What should I do? :) any exercises books or anything I can do to deal with it?"}
{"Reddit ID":"Anger_78","Reddit Post":"Hi guys, I have a real issue with anger. It's only ever in private, no one else ever sees it, but like the smallest inconvenience will piss me off. Video games, my phone playing up or a mispell, waiting on an email etc. But my anger is really particular...I bite things. Like really fucking clamp down on them. The other anger is driving, if a traffic light is taking too long or a driver in front of me is just a pure bollocks I start gritting my teeth. It frustrates me how it just comes out of nowhere and I have to bite something. I wish i didn't feel it. One thing happening one day has no effect but the same thing the next and it might  And I know it makes me sound like a fucking maniac. These outbursts are dead quick aswell, sometimes they sustain and I just walk away from whatevers irritating me till I calm down but like most of the time it comes and goes inside 10 seconds. \nIts bizarre aswell cause if you met me in person I'm a calm guy, and I really despise it happening. Anyone got any advice or am I just a loon?"}
{"Reddit ID":"Anger_80","Reddit Post":"i blew up over smallest thing. My mom was complaining at me because I forgot to tell her about door hangers i broke, so she is swearing and angry at me, i go and do chores (wash \ndishes) and she says \"leave them' in an angry tone. \n\nSo i say \"why are you always angry at me. i am sorry i forgot to tell you about the hangers\"\n\nThen she says \"why did you not just leave them why did you therow them out\" (they were broken so if i left them there i would have got yelled at too).\n\nThen says I am not angry at you (but she is clearly angry at me \/ swearing and hitting the door) \n\nI go to my room and she yells  \"why are you acting like this you always act like this\" (it isnt true i have blown up 2 times this year dont always act like this)\n\nSo i come out my room and blow up yelling \n\"why do i always get yelled at for everything while my sister doesnt. All she does is talk shit about evrything and everyone but if i try and talk or do anything i get yelled at\". \n\nThen we get into a real physical fight, she slaps me &amp; i slap her back. Then my mom and sister leave and drive off. \n\nSo what do i do now? She isnt goint to accept an apology. This always happens when my sister comes over."}
{"Reddit ID":"Anger_81","Reddit Post":"As a young adult, 17 yr old, I would lash out and yell at my parents and let out my anger. It made me feel incredibly bad at the time because the anger was toxic and my parents never got mad at me for it.\n\nNow, as 21 yr old, I hated how I used to let my anger slip out when I was younger so I have successfully repressed it. I never show that I am angry even if I am, I have not yelled or talked out of order to anyone without reason. \nMy parents tell me I have emotionally matured but the thing is that I still feel angry, I just never show it. I only get angry when I am not the aggressor.\n\nI think i pushed my dog when he tried to pull my hand at night, in an aggressive manner. He sleeps with me on my bed. I felt horrible and now when I'm awake I feel a little broken bc my brother said that I pushed my dog when it just wanted to sleep next to me.\nI am usually very calm but I have a lot of agitation and anger inside me.\n\nWhat am I doing wrong?"}
{"Reddit ID":"Anger_83","Reddit Post":"I'm 20 and I currently suffer from depression and anxiety. Almost everything bothers me and makes me angry or upset. I don't know why and it makes me feel awful because I feel like it's ruining my relationships with others. I've always been an angry person and kind of a downer when it comes to most things but now it's getting out of control, I'm having hateful thoughts and lashing out in ways that aren't healthy. I've talked to therapists before about my issues, but they seem to just glaze over it and focus on my other issues at the time, anyone have any advice on what I can do? I have a feeling that my anger and depression will end up ending my current relationship and harming my relationships with friends and family as well. Thank you."}
{"Reddit ID":"Anger_84","Reddit Post":"30 years old, and the anger I though I settled as a kid have come back ten fold. I was an angry person the time I can remember until I was around 20. They sent me to anger management and all other programs under the sun, and then one day, I just calmed down, able to control my violent outbursts. Now, I'm 30, I remember my anger rising early this year, just dumb things annoy me, work stuff stuck a nerve.\n\nNow, I sorta fell in a hole, without realizing it, and i am mad, at everything. Violent mad. I am filled with hate for everything, and every little thing I have to hold myself back at wanting to rage at everything, and everyone. I can't even stand being talked to, or asked questions, because just the sound of people's voice is enough to drive me absolute livid.\n\nRight now, I am sitting g here typing this wanting g to rage over the fact that everything pisses me off. \n\nWtf do I do, except destroy everything?"}
{"Reddit ID":"Anger_86","Reddit Post":"My Mom and Dad get angry at me when I mess up. Mom gets angry over the littlest things and is sometimes even my is nicer to my cat than me. Even my boss screams at me and others and, while I feel the others don't deserve that, I feel that I do. The yelling makes me feel weak."}
{"Reddit ID":"Anger_87","Reddit Post":"I've had this issue for many years now. I get extremely angry and violent when my mom does things that I've asked her not to do, sometimes it involves other people but mostly my mom since I'm around her the most. I get that it might be a teenager thing but I desperately want to find a way to stop letting it take control over me because it's getting a bit debilitating. Even though I don't let her see my anger and I don't yell at her (since she can out-yell me and would probably send me to my dad's forever), I feel terrible for feeling this way toward the person that took care of me my entire life.\n\nThis morning, she was drying her clothes after I had just done laundry, so she took my clothes out of the dryer and put them into a hamper thing. I've asked her multiple times to let me know if she needs the machine when my clothes are still in there (since we tend to do our laundry at the same time for some reason) because I get irrationally mad when she touches my clothes. It doesn't happen too often since I usually take my clothes out and fold them before she even notices I did laundry, but I forget every once in a while and every time it makes my day a bit worse. I told her today that I don't care if it's 4am and I'm asleep, I want her to at least warn me that she's going to touch my clothes if I don't get up right away. \n\nI went back to my room after taking my clothes and I wanted to scream but I always manage to stop myself by just pretending to yell and by punching my mattress and pillows. This time I missed though and I punched my metal bed frame and now my knuckles and some fingers are bruised and aching pretty bad. Made me realize that I need advice before it gets worse and people start noticing."}
{"Reddit ID":"Anger_88","Reddit Post":"Gaming rage (m, 21, has ADHD\/tourettes and aspergers) I get angry\/blow up, sometimes throw things (not expensive things like controllers or anything) or bang my desk when I play games and I lose consistently or do worse after better runs. After said actions, I feel greatly embarrassed and like an utter child even though I try to be a decent person day to day. How do I stop feeling this way about myself?   \n\n\nI don't have that many hobbies outside of drawing that I do, and I don't feel particularly skilled in anything (unless you consider being someone's \"come talk to me and I'll listen\/'teddy bear' as my gf calls it\" a talent). When I lose here, i feel like I'm just some unskilled loser even though I'm doing well in my studies in university. any advice or me? I would greatly appreciate the help."}
{"Reddit ID":"Anger_89","Reddit Post":"I'm on the autistic spectrum and one of my particular symptoms include not being able to feel anger.\nSo I can't relate in the slightest when my sister goes into a flying rage because I didn't make extra food for her for breakfast or something, culminating in slamming doors and yelling and calling me an asshole or a jerk or annoying or a bitch.\nI find this kind of ironic because all I was doing was sitting and eating breakfast and reading a book while she was the one being disrupting. Personally I would never even consider expecting someone else to cook my breakfast but I guess she was?\n\nUsually what I do when something like this happens is leave the room and\/or listen to white noise and continue what I was doing to try and drown out her yelling, which is one of the sounds that I'm sensitive to from being autistic. I'm usually just mildly confused and overwhelmed when she has outbursts.\nLike I offered to cook her some food if she wanted but she got even more angry.\nSo I have no idea what to do? If anyone has any advice of what to do when she gets angry please do tell :\/"}
{"Reddit ID":"Anger_90","Reddit Post":"Why did this happen to me? I don't like being self centered but holy fuck it actually makes me hate life. I no longer enjoy anything. I look forward to nothing because I've lost all enjoyment in things. Sure I still do \"fun\" things but it is always temporary. I can't fucking enjoy day to day life unless I'm doing something super special. I don't feel like I belong where I live.\nEveryone here is so fucking boring and lame and I know this sounds rude as shit but I'm fed up. It's not like I don't have friends but it's just like life is so fucking dull I just can't anymore. The amount of anger and rage I feel is almost incomprehensible. Fuck"}
{"Reddit ID":"Anger_91","Reddit Post":"This is not who I am... Ever since I left the military I've been a completely different person. This was 15 years ago. My parents told me I changed, my attitude seemed great when I was in, these days not so much. I definitely struggle to control my temper day to day. And I cannot even explain why. Has anyone else seemingly experienced the same thing after being separated from the military? I don't completely blame the military , but maybe."}
{"Reddit ID":"Anger_92","Reddit Post":"so me and my friends are supposed to go to this thrift store in our downtown today and we'll just call them friend #1 and friend #2. So we were supposed to meet 30 minutes ago and friend #2 calls me and she says #1 can't come until another 20-30 minutes and that friend #1 said friend #2 should come to my house. I never said she could come to my house but friend #1 said she could anyways. Then friend #2 never came to my house because i said it was ok that she came and then i call them saying i'm gonna start walking and friend #2 says she picked up friend #1 and they were already downtown. and i'm mad because first of all why didn't friend #2 pick me up too? i live close to downtown but it's still gonna take me 20 minutes to walk. and why didn't they tell me they were leaving and that friend 2 wasn't coming to my house anymore. and now i'm late and they are hanging out without me and i haven't even left the house yet because i'm mad and anxious. and this isn't the first time they've done something like these but i just wanna know if this is genuinely a valid thing to be this mad about or if i need to calm down about this."}
{"Reddit ID":"Anger_93","Reddit Post":"I drive tractor trailers for a living and wanted to share my experience dealing with road rage issues and some of the things I've been able to overcome.\n\nAlso be intrested in how people handle their road rage and are able to not do stupid things in retaliation.\n\n I'm in my early thirties and been driving tractor trailer for nearly a decade and have had many instances where I've run vehicles off the road for doing things like passing me in a no passing lane or not letting me change lanes whether they were ignorant of my blinker or whatever reason they weren't letting me over. I have been blessed to only be in one accident which was the car's fault for turning in a non turn lane but I've definitely had a few close calls and angry drivers that were road raging back against me. Most of those instances were in my early years of driving and I have since been able to tone out stupid drivers by simply falling behind in traffic and getting away from them or flat out ignoring people trying to tailgate the truck l, then continuing on my route. I use a out of sight out of mind technic hoping to not let them frustrate me.\n\n I've had a lot more issues doing that in my car when I have my wife with me. When vehicles do things like cut me off in traffic or drive recklessly through stop lights or stop signs when you're not going fast enough. I have had many instances where my wife is upset with me for being as stupid as they were."}
{"Reddit ID":"Anger_94","Reddit Post":"Why do I feel like my best friend is angry on me for some unexpressed reason?.\n\nI once thought she was angry with me and I refused to talk to her (My time with her reduced). But later when we spoke she said she didn't find any change in me and that she was unaware of the whole issue. She even said she was never angry with me in the first place......I was stuck with so much queries and insecurity for 2 days until I confronted her later. Is my brain playing games with me or is she lying.\n\nPS: I have a dad who always gets angry for petty issues and yells at my mother often daily...."}
{"Reddit ID":"Anger_95","Reddit Post":"I can't even verbalize my anger properly right now, but I've been burning up inside for days. I'm living in CHAZ (the new anarchist sport in Seattle) and these people have no concern or empathy for the people who live here, just trampling all over our space and creating an endless party. And if I complain about it my friends say I'm not being a good ally. I feel like I'm in crazytown right now, and fucking hate everyone. i want to take a bat and just smash my apartment to pieces. I'm just so angry and there's nothing I can do except rant about it on the internet. Ugh."}
{"Reddit ID":"Anger_97","Reddit Post":"I'm a 24(f) and have had issues with my anger management for years. I went to AM for awhile but that was years ago. I have been doing well for a really long time like walking away, counting down, breathing (I hate this one), and editing before I speak. But as of the last few months I feel myself going back to being more and more angry and easily triggered. I really hate being this way and it's not good for my other health conditions. I attended an online AM meeting but it didn't help. Any tips ?"}
{"Reddit ID":"Anger_98","Reddit Post":"I feel like everyone is an asshole no matter what and it makes me wanna hurt random people \n\nthis feeling started when my so called friend started to laught at me for the dumbest things like my haircut or my weight , the same guy that had me driving around to help him with his chores \nhe and my mom where the only ones I trusted with my problems and recently i noticed he reveals other people's secrets and it makes me think he did the same to meI almost get angry and make a scene in public I was on the line of the grocery store this morning and the sign on the door said \"2 people max\" so I wait then I see 4 people inside I start to feel agitated , and the worst thing is , and they didnt know what to get and they were taking their time and I felt that I almost exploded with anger in my jead I said \"COME ON! YOU DONT KNOW WHAT TO FUCKING BUY?! MAKE A FUCKING LIST YOU IDIOTS!\" I couldnt breathesick of my mom asking the same questions every day \"when are u getting a gf?\" , \"you will have sons of your own right?\" and we always end up arguing if I was a fuck up my sons will too \none of her worst fears was me turning into my dad a hotheaded idiot but looks like im following his path no matter what I do \nim tired , angry and sad all at once"}
{"Reddit ID":"Anger_99","Reddit Post":"I'm a 20 yo guy with a good amount of mental health issues (severe anxiety and depression, ADD, suspected BPD by psychiatrist)\n\nSometimes when I'm alone and trying to use an object but it doesn't want to work, I get these spikes of anger that come so fast out of nowhere. I never get angry and frustrated at people or situations or anything else but not properly function items.\n\nTonight I was trying to lower the blinds in my bathroom but nothing was working and I was getting angrier and angrier. Then I just blew up and pulled violently on them, breaking 1\/3 of them. Then I punched the wall, screamed, sat on the toilet and started crying like crazy. My hands were shaking, I was grinding my teeth, my fists were hard. And out of pure anger I took a big bite in the toilet paper and spat it out, to resume crying. \n\nThis happens relatively often but I never get this angry, should I go to the mental hospital?"}
{"Reddit ID":"Anger_100","Reddit Post":"Been struggling with this all my life. I'm currently typing this out on a busted up phone, because I can't seem to stop throwing it when I'm upset.\n\nI hate feeling this way all the time, and constantly looking like a child. My family is used to it, so they don't care anymore - I mean, how could they? This is almost a daily thing.\n\nBut for me, it always feels like the world is actually falling apart *this* time. It never does. It's always just me spinning out in my imaginary world of torment.\n\nI just want to be done."}
{"Reddit ID":"Anger_101","Reddit Post":"Hi, I'm an 18 year old and on rare occasions I get apocalypticly angry. I have broken doors, I broke my laptop and had to get it fixed, and today I managed to break my mum's vacuum cleaner. She is devastated. We've talk about this, and I had a method in my head for whenever I got angry again, and it didn't work. Now I have let my mum down and I'm scared one day this anger will result in me hurting someone or worse. Any form of advice or anything is appreciated."}
{"Reddit ID":"Anger_102","Reddit Post":"Welp im lookin for some advice. I try to be calm in which in most cases I can stay relatively calm. But when im in an argument where im getting bashed left and right I lose it as well as when things get repeated to me more than 2 times (the second one is kinda petty). the most recent case is where I had smashed my phone on the floor and immediately regretted it as well as lashing out at siblings. I hate getting angry and it wears me out. I feel like such an idiot when I get angry. I know im not a kid anymore and shouldnt be doing that and I dont think before i react when angry. I just need some advice on anger management."}
{"Reddit ID":"Anger_103","Reddit Post":"Grandpa was angry. Dad and Mom are angry. I am angry. How do you even start to break the cycle? I'm going to keep this short because frankly all the other sob stories on this subreddit are making me angry....\n\nI wake up annoyed.  I loop through interactions I've had with people with delusions of getting in their face and saying \"what I should have said.\" Driving with me is \"an experience.\"\n\nIt's a big feedback loop that turns into me being short with people and occasionally losing control. \n\nDeep breaths seem to help a bit. \n\nWalks seem to help a bit. \n\nBeing stoned fixes it, but is not sustainable. \n\nHow do you stop the cycle?  I literally have no idea where to start."}
{"Reddit ID":"Anger_105","Reddit Post":"Brother has Hemiplegia and has anger problems, is there anything that can help him? My parents said they have tried to get him help but have been told that the development in the frontal lobe should help. But the cause is damage to the brain. And basically they will have to do their best to manage it themselves. Is that really it? No medication or therapy or anything that would help him? He's 15 now and like 6 foot 1, he's getting to big and strong and pushes my mum around, fights with my dad and myself. As in he gets physical with us and we try to defend ourselves or restrain him. I'm in the UK. Thanks for any help."}
{"Reddit ID":"Anger_106","Reddit Post":"Hi all, young male here, 22 years of age and diagnosed with ASD and Bipolar Unspecified. I have a bit of a problem and I'm not sure if this is correlated with a narcissistic perception due to ASD, but everyone who I encounter in my life that wrongs me or humiliates me, I write down their names and I keep these names stored with me for a very long time. I've been thinking about applying for a university course for computer programming and solely the reason why I am contemplating to take this course is because I have a grandiose fantasy where I'd track down the location of these individuals to allegedly kidnap them and take them to my garage where I'd tie them up to a chair, show in front of them on a projected screen their wrongdoing to me and deliberately starving them to death while playing Three Little Birds by Bob Marley on a radio next to them. This process would apply to anyone in my life that had carried out any perceived injustices against me, making me a notorious serial killer.\n\nI came to this subreddit just hours after posting on r\/ontario a self-explanatory question I was humiliated for (which I deleted the post shortly thereafter) and had wrote down the usernames of all individuals involved that I perceived as hostile, it's been racing through my head all afternoon and I have been institutionalized twice for indulging in serial killer fantasies, but do not have a recorded history of violence and I grew up in a well family household without parental abuse. I consulted with my psychiatrist last month and he says it is typical to engage in homicidal fantasies when under the influence of medications and taking into account my cognitive diagnosis.\n\nWould anyone else be able to explain these homicidal ideations?"}
{"Reddit ID":"Anger_107","Reddit Post":"What do you do when you feel your anger is unjustfied? Usually, if someone shows any sign of disrespect towards me a fire burns on my chest. It could be an unknown person in the street, a friend, a girlfriend, or a colleague making a question in a seminar. If I perceive it as disrespect, I lose my shit. But only on the inside. Acting like an irrational angry person is not with me. I am sure my facial expression tells it all, but everything else is controlled.\n\nThe problem is: this feeling clouds my judgment many times. When the fire is out, I always question myself: Should I have really to be angry about that? Should I let it go? Am I letting someone walk over me?\n\nI am sure this is common here. I want to know what you guys do to discern the real world from your feelings."}
{"Reddit ID":"Anger_108","Reddit Post":"Theres this homeless guy who harassed me today for my food\/money and it just pissed me off. Try and shake you down for your stuff the stupid loitering pricks should be arrested. I want to punch the next guy who comes up to me to harrass me for my money in the face. Seriously wtf is with some people?My sibling still hasn't payed me the money she owes me It sucks I asked for it like a month ago it she says \"Oh I'll do it tonight for the past month\" god wtf. Shes just sitting on it for christ sake. And I want to use that money and sometimes I need to buy food with it. Shes so whiny whenever I confront about it as well."}
{"Reddit ID":"Anger_110","Reddit Post":"I hate my anger issues. I know it's a problem I've seemed help still didn't help. It's like I can't control myself when I get angry and start breaking stuff, throwing stuff, doing outrageous things. The fact my parents let me still in there house is something I don't deserve"}
{"Reddit ID":"Anger_112","Reddit Post":"I (27F) rarely get super angry with my mom or other family, but the past few days have been one of those rare times. I am justified in my anger, but I feel so immensely guilty for being angry. I tried ignoring my parents and brother and I even ignored one text from my mom. I cried and cried, not because I was angry, but because I felt so guilty and it was tearing me apart. I went to work upset, and tried to play off my watery eyes on my allergies. It really messed me up and as soon as I clocked out and got in my car to head home, I started crying again. It's like I want to be angry and I know I have reason to be, but I keep thinking about how \"what if something happens to them and the last thing they knew was that you didn't want to speak to them.\" I just keep thinking how I don't want to lose my mom or my brother. I want to be on good terms with them because I don't want something bad to happen. This is really affecting my ability to dispel my anger and deal with it in a normal way. I have always noticed that I feel guilt when I get angry at my family, but this time it has been full force. I've even been getting migraines because of how stressed out I have been over this. My family is great and they aren't narcissistic or anything like that. I just really don't understand why I feel the way that I feel. It's like I think about all the bad things that could happen and I feel like a horrible person for feeling a normal emotion. Is this normal? Does anyone else experience this or should I be seeing a therapist?"}
{"Reddit ID":"Anger_114","Reddit Post":"Was engaged a few years back, felt whole\/complete in life (if you know, you know).\n\nShe left. Ran away. Literally no excuse. She said she didn't want to marry anyone in life ever despite being the one who instigated the engagement and telling me all the things we would achive together in the future. \n\nWhen she ran it left an anger in me I've never really been able to shake off. Like a mad fire that never goes out.\n\nTook me a while to re-centre myself. I went to therapy, worked my ass off in my career for the better, altered my mindset, exercised more. The usual stuff. While I could never forget what happened it got placed in the back of my mind palace to collect dust.\n\nNow I've randomly just found out shes engaged to someone else and the rage has just flooded back is and trying to spill over. I'm shaking, squeezing my phone so hard it's likely to snap.\n\nI really feel the need to break something right now"}
{"Reddit ID":"Anger_115","Reddit Post":"my anger is taking over me almost everyday for the past months my anger is been out of control, idk why but most of the stuff my girlfriend says or does makes me extremely angry and i dont know why most of the times is really stupid stuff , but its like its build up it start as me just feeling mad and then my body starts feeling weird i start getting really angry and i feel a pressure ok my chest and this happens almost everyday , i never been like this and i really dont know what to do"}
{"Reddit ID":"Anger_116","Reddit Post":"I have a lot of anger issues and the thing that triggers it the most is work. I've looked up ways to release anger physically but the only thing I've seen is bullshit like exercising, throwing a ball, playing sports, etc. I can't just fucking play sports at work. I don't know how the fuck I'm supposed to manage it. But I don't want to be destructive to the workplace and I don't wanna yell at my coworkers. What do I do???"}
{"Reddit ID":"Anger_117","Reddit Post":"How do I help myself? I hate myself for my anger issues, I feel like I got them from my father, I'm pretty sure he has bipolar and I feel I've inherited that from him, I watched him and my older brother always be angry and learned from them, and it always got worse as I got older, and now my anger issues are so bad. I don't know what to do or how to help them, I try to stay calm and talk with people but they get so exhausting honestly, and it's why I'd rather be alone. I hate myself truly, I'm becoming my father. He only gets mad and yells at us when we're at home, but when he's in front of people in public he can control it somehow. I'm becoming the same way I think. I try to stay calm with people in public and not freak out on them, but with my family I just snap sometimes. I always feel awful afterwards and I try to convince myself to calm down and talk it out and think before acting, and I feel sincere and I just wanna apologize every time I yell at someone or have a pissy tone with them. I mean I guess I'm different from my father there, my father never admits he's wrong or sincere or sorry for anything he does, where as I do, I'm sorry for everything I do wrong. I spend hours bashing myself for every little thing I do wrong, when it comes to yelling or anything. I just don't know what to do about my anger issues. Any suggestions? Any will help, I guess at this point. Thank you."}
{"Reddit ID":"Anger_118","Reddit Post":"How am I supposed to react when my husband loses his shit? The number of family outings, activities, days that were supposed to have been fun memories, that have been ruined because of my husbands horrible temper, I can't even count. Today he lost his shit on me, yelling and screaming in front of our kids, because when he went to pull a bag of chips down a box of candy fell and spilled on the floor. He says I need to put it \"where it belongs\" not leaning up against a bag of chips. He didn't let up on this even after minutes of yelling, and I left him alone and just disengaged. It's been hours now and we haven't talked. I don't know how I am supposed to handle this. In the past I have tried to reason with him, but nothing ever calms him down. Everything pisses him off. Does anyone have any advice? I am at a complete loss of how to react now. I feel like I am always walking on eggshells."}
{"Reddit ID":"Anger_122","Reddit Post":"I just want my mom to go away. I am in my 40s and my mom has always been a controlling vindictive bitch. She has guilt tripped her way through life and Between my grandparents and her 5 husbands has never actually done anything for herself and now expects me to do absolutely everything for her. \n\nMy step dad died 2 years ago and now she has to work full time and her hours vary every week. My wife and I paid her $400 car payment for 6 months. We have given her money for groceries and I currently pay her $100 a month cell phone bill. \n\nOver the last year I was able to put away $4k in her savings account to do what I can to build it up\n\nThis past Monday she gave 3600$ to a relative who hasn't paid her utilities in  over 6 months. \n\nToday she calls in tears becuase her weekly check was only $400 and she can't afford her bills. She says \"don't yell at me\" and I just about fucking lose it. She didn't ask for money, but she never outright asks for anything. She uses guilt to get what she wants. \n\nI just want her to go away. She makes me miserable and causes so much stress in my life."}
{"Reddit ID":"Anger_123","Reddit Post":"I stay pissed off all the fucking time. I stay pissed off.\n\nIt's probably evident in some of my posts in r\/depression.  I'm tired of life and every goddamn thing in and about it.  It's just one big fucking screw after another.  I can't get one single goddamn break before the next one rolls up.  And, I've become so hyper-sensitized from a lifetime of getting fucked over by everyone and everything, the slightest little thing sets me off because it reminds me of something before.  BOHICA or situational-PTSD I don't know.  And good fucking luck having anyone to talk to either, ergo the final \"fuck them all\".  They can come around when they have problems and expect understanding, but when the roles are reversed, not only do they disappear, they label me as \"undesirable\" and a problem.\n\nSo, fuck them, fuck me, fuck IT."}
{"Reddit ID":"Anger_124","Reddit Post":"Hello everyone. First post here, I am hoping I don't break any rules.\n\nI have been having anger issues for a long time now. I had anger issues in kindergarten and in elementary school and have been to a psychologist in second grade because my situation was that bad. Nowadays, the issues are much worse, I have lots of stress on me currently with online school and all kinds of things related to it, I am very tired because I am also not getting enough sleep.\n\nWhenever I get angry, I usually just have to smash whatever it is in my hand (controller, pen, notebook etc) against the surface that is closest to me, let it be my desk or bed. This has not only caused me and my family hundreds of dollars of damages, but I also usually get hurt in the process. Sure, wounds can heal, but having them in the first place because of a mental breakdown because my pen has dried out is a pretty fucked up thing in my book. \n\nI tried putting said things down before starting to hit something, but I just have zero self control and can't consistently do so. I also tried calming myself down by just staying still and doing nothing, but that usually gets me even more angry and I cause more harm to myself. I tried hitting other things like my pillows, but that causes almost the same effect as staying still. And after I break something I get sober and realize what I just did and get a bad feeling of doom or whatever that is.\n\nIs there any way I can at the very least minimize these breakouts? It's starting to get very expensive and I have a feeling if this worsens, many other things are on the way that could completely ruin me, as if I am not that bad already."}
{"Reddit ID":"Anger_126","Reddit Post":"Hey, guys, I am new here in Reddit, I heard this is a good subreddit I think, here is the only place where I can throw out my emotions... A thing that I hate is when people especially my parents don't believe me... When I was telling my mother of a truth that I uncovered that has to do with my brother, she didn't believe me, since I am good at lying, but people are able to see through emotions if someone is really telling the truth, right? What should I do?"}
{"Reddit ID":"Anger_127","Reddit Post":"how to deal with a disagreement and not get angry? How do you deal with people disagreeing\/criticizing\/patronizing\/belittling you, usually in a condescending way, without getting super mad? Someone could disagree with me over the slightest thing if they even give the implication that how they said it was in a condescending manner, I will be ready to right. This is highly irrational I know but I don't know what to do, especially when I end up feeling even the slightest of belittled. I know this sounds immature, \"sensitive\", and childish but man, is there any cognitive-behavioral therapy-type things I could do to possibly shift my mindset into the \"They disagree and said it in an asshole tone so they can fuck off!!\" to \"they disagree and said it in a stern manner but both of our views are valued, and who knows, maybe I could take something from their viewpoint.\" It is more of an emotional reaction rather than a mental one."}
{"Reddit ID":"Anger_128","Reddit Post":"Why does anger feel so awful, lately? I used to not mind my anger as much, it felt like a way to settle any bottled up emotions. Though I get it wasn't really the right thing to feel, anger used to feel... satisfying in a way. Like I'd feel better afterward.   \n\n\nBut recently that's changed. I get so disproportionally angry at most things that are even just mildly frustrating, and it's always so much.. I want to explode every day, but it doesn't feel the same. The worst part though is how hollow inside I feel after it subsides, way different to the satisfaction of letting my emotions out that I used to feel. It's like I'm taken over by a depressive haze that makes me want to cry almost, before even that fades leaving me feel numb, in a really really bad way. I just don't understand what's changed.  \n\n\nDoes anyone know what's going on or why it's happening? Please help if you can."}
{"Reddit ID":"Anger_129","Reddit Post":"Hi everyone I usually quite a calm and relaxed person and it is rare I lose my temper with other people, however when it comes to technology I get very angry VERY quickly, if something doesn't load fast enough or theirs a poor connection I completely lose my shit and end up smashing stuff, even worse is if I playing a game and something goes wrong, I can still win but if it isn't perfect I end up smashing my controller. This clearly isn't healthy however I never get like this when theirs other people around, if I play a game with friends (in person) I completely chill and the least competitive person their is, can anyone please help me figure this out? There's not even a slow build up it's usually just 0 to 100 the second something goes wrong. Sorry if this poorly worded"}
{"Reddit ID":"Anger_133","Reddit Post":"Feel like I'm losing control of my mind. I get angry over the simplest things. It's never directed at my wife, but I know her being in the vicinity of me having an outburst is not good for our relationship. This morning was great...right up until I cracked an egg for the breakfast pizza and the yolk broke. That seems like it lit the fuse. I then was cracking the second to last egg and the whites started running over the edge of the crust. I lost it. I screamed and cussed at it. My wife told me getting angry isn't going to fix things. That seemed to make it worse. She stormed out of the room when I continued to fuss and cuss and grumble and attempt to save this breakfast. Meanwhile, I was fighting with my inner monologue that was telling me what a f***-up I am and why do I even try if I know I'm going to fail. Can anyone help this man who feels like he's holding on to a tiny string attaching him to sanity? I'm terrified I'm going to end up admitted to a psyche ward if I said all of this to a therapist."}
