{"Reddit ID":"Anxiety_1","Reddit Post":"I asked my friend a question and it became a much bigger deal that it was suppose to be. Not feeling okay at all and very anxious. I have pretty bad social anxiety and even being around my friends makes me anxious. Well, my bestfriend and her boyfriend are moving next week so they came over to my apartment last night to sleep over and have some drinks. It was me, my fiance, my bestfriend, her boyfriend, and our friend Josh. \n\nWe were on the topic of our ethnicities and discussing our ethnicities. Everyone was okay until I asked Josh if he was jewish. I asked this because my bestfriend told me he was jewish literally two weeks. I don't see or talk to Josh much so I believed my bestfriend when she said he was jewish. I simply just wanted to extend the conversation and get to know Josh better and it fit in with the conversation we were having. But, when I asked that, my bestfriends boyfriend seriously grilled my ass for it and was treating it like I asked Josh that because I was racial profiling him. I had to defend myself for 30 minutes saying that I only asked that because my bestfriend, his girlfriend, told me that Josh was jewish. My bestfriend was quiet during this entire talk. It was getting kind of late and I was pretty upset that I was treated that way for simply asking a question so I told them im gonna head off to bed. But then that became a big issue and everyone got freaked out that I went to bed early. I mean my bestfriend has messed up my fiances ethnicities all the time and calls him things that he is NOT but we just go, \"oh hes not that,\" and move on. But her boyfriend interrogated me for 30+ minutes over it. Now its the morning and the anxiety I feel is so bad I am actually shaking. They still slept over and I just want to crawl in a hole then to see them."}
{"Reddit ID":"Anxiety_2","Reddit Post":"I consider myself relatively high functioning. I can talk to people just fine, but I need a lot of alone time to recharge. I went on a trip to Mexico to visit relatives. Some of my aunts and uncles from the US also came. I speak and understand Spanish really well, but combined with my anxiety and the language barrier, I won't talk very much\n\nOne time, we went to someone's house for New Years Eve. We had been there for five hours already, and I got kind of bored of listening to people talk. It's not that they're boring, but for me, listening to people talk in a language that's not my native language is difficult after several hours. I guess I was turning my head a lot, trying to find an interesting conversation, when my aunt asked me \"does it embarrass you to look at people?\" With a smile on her face\n\nA couple of days later, we went to a party with mariachi. When we got there, my aunt said \"smile, look confident. Didn't your mother ever teach you that?\" With a smile on her face. An hour later, some people we knew arrived. After greeting them, we walked back to our table. I was ahead of my aunt, and I looked down for a split second. She said \"(my name), don't look down\". \n\nAnother time, we went to someone's house for dinner. The hostess asked me if I liked the town. I said yes. I wanted to elaborate, but I had food in my mouth. The subject had already changed when my aunt started looking at me in my peripheral vision. She then whispered \"come on\"."}
{"Reddit ID":"Anxiety_4","Reddit Post":"anxiety while driving: do you guys have it? i get so anxious and overthink when i drive in crowded streets i feel like im gonna crash the car every second, i managed to get my drivers license by taking lots of pills so i was chill enough for the driving test."}
{"Reddit ID":"Anxiety_6","Reddit Post":"Hi I'm new to reddit but I've been having some really bad fears of being schizophrenic. I've been just haven't been right since. I've been to a psychiatrist and she says I show no signs of it and I have no family history of it. But I've been getting panick attacks about it. I've had some bizzare thoughts in my head.  Like I was in Wendy parking lot getting my food I was fumbling with my drink I was anxiety ridden at the time and then I looked at my drink and thought what if that straw turned into a snake. That freaked me out then I thought I was going to start seeing that. Then that kinda passed and then my mind was wondering then I was like what if my fingers turned into snakes. I'm like what is going on in my mind now I'm worried looking at my hands thinking I'm gonna hallucinate it. I'm on new meds for anxiety and depression that I'm still on my old meds so I can ween off them. I'm taking Celexa and Cymbalta. I'm just utterly scared that this is happening to me"}
{"Reddit ID":"Anxiety_7","Reddit Post":"Is this anxiety. Who else feels weak in chest? Pls read guys, today i feel weak in chest, been having tightness for months but today is different... I hate feel of short breath. Also i feel weird like fatigue in chest, if u know. And when i get up i feel tired and i breathe hard. Also when i talk get tired and must pause because feel like tight in sternum, out if breathe, get tired, feel Panicky feeling. Do u have it? Like its draining whole energy"}
{"Reddit ID":"Anxiety_8","Reddit Post":"I have been taking 25mg of zoloft for one week. The first few days I actually felt so good. Now around day 8 I am having severe panic. I know this is probably common while getting adjusted. Has anyone taken it for panic disorder and survived the first few weeks? Did it get better eventually? I have had panic disorder my whole life and after I had my baby recently it's been out of control. I need some help. I can't keep having panic attacks."}
{"Reddit ID":"Anxiety_9","Reddit Post":"Hey everyone. I recently signed up for freshmen varsity American football. I had my first practice per se today and got to meet my coach and fellow teammates. I liked them and my coach. My first real practice is this coming Monday, and my first game is Friday. You might be thinking, \"he's anxious about getting hurt\" but no. I am anxious of letting the team down. These guys are really down to earth guys, respecting each teammate as a brother. They even showed me some substantial love today. But the team we go up against is best in state. I am worried I will perform poorly and let the team down. I don't want to be the player that saves the game, and is the talk of the school, I just want to show these guys I love football as much as them."}
{"Reddit ID":"Anxiety_10","Reddit Post":"Is it weird to talk to a girl after 2 years of not talking to her? Hi I have social anxiety and I was wondering, there's this girl that occasionally walks past me in the hallway and we were classmates for one year in a class and I have tried to initiate contact with her. She actually said she liked me 2 years prior (we have 1.5 years of online school), but I ghosted her which was very dumb and entirely my fault. I have miserably failed because of my social anxiety around her. My heart races and my mind goes blank with hesitation every time I'm around her. I haven't really talked to her for 2 years, so I am thinking that I would come off as a creep if I were to talk to her. And she typically walks at a 4mph rate, with arms crossed, looking down, so I don't really know if randomly saying hello would come off as weird or not, or if she doesn't even see me. She is sorta anti-social, yet dresses very nicely with makeup and jewelry. I was just wondering if randomly saying hi to her after 2 years would be creepy? And, I would also really appreciate some tips."}
{"Reddit ID":"Anxiety_11","Reddit Post":"Panic attack or allergies? I woke up in the middle of the night and I couldn't breathe. I start to hyperventilate and then my heart started beating fast and I started sweating. Could this Have been allergies or a panic attack? My oxygen levels were at 99% and no, I do not have sleep apnea."}
{"Reddit ID":"Anxiety_12","Reddit Post":"Whatever happens, happens. One of the things that are helping me with anxiety is learning to accept whatever outcome i get from a situation. Instead of worrying about things going wrong and trying to plan every little detail to avoid mistakes i just try to convince myself that things will be fine no matter what happens and it's no big deal if shit goes bad."}
{"Reddit ID":"Anxiety_13","Reddit Post":"Does anyone find their anxiety worse when they lack sleep? How to get past it?  I have an optional job that's gonna start at 4am until 8am for one day. I don't think I will be able to sleep at all until the job is finished. It's at a datacenter so it makes me feel trapped because of the high security and the cold. Which is just going to contribute to the anxiety. I want to go because it sounds interesting but at the same time, I'm afraid it's gonna be too much for me to handle. And I'm given the option to not go, if I just lie and say I have something else to do on that day"}
{"Reddit ID":"Anxiety_14","Reddit Post":"Tension in shoulders and neck and feeling intense panic. Can anyone tell me what this is and what to do? It's like a wave of tension and my neck and shoulders feel really uncomfortable and stiff and I start to panic, my hands feel tingly and I want to shake them or wring them to stop the feeling. It's like an intensely uncomfortable feeling like I don't want to be in my body.  Very hard to describe"}
{"Reddit ID":"Anxiety_15","Reddit Post":"I've suffered from anxiety basically my whole life. Ever since I was in kindergarten I'd have this fear that someone was always out to get me. That someone was following me, trying to kidnap me, kill me, etc. I'd even have nightmares of it. When I was younger I didn't really draw any attention to it and would just brush it off because I didn't know what it meant and when I would feel anxious I would just go to sleep and eventually my anxiety would go away. Now that I'm older I still feel like this sometimes and I feel like it's preventing me from doing certain things or preventing me from properly growing up. I just feel like sometimes my anxiety gets out of control. Does this happen to anyone else?"}
{"Reddit ID":"Anxiety_16","Reddit Post":"I have taken my road test to get my driver's license twice and I have had an anxiety attack both times (shaking, feeling dizzy\/nauseous). I felt so disassociated and forgot  everything I needed to do. On the most recent one, the examiner was so nice and had me pull over to the side of the road because she thought I looked too nervous, but I still messed up most of the test. I agreed with my therapist that I'm going to take some time to work through my driving anxiety before I take another test, but I'm so embarrassed to tell my family\/friends that I failed again. Whenever I try to be honest with someone about why I failed, they always respond with \"what are you going to do later in life?\" or \"you're going to have to overcome that\". It gets tiring. Can anyone relate?"}
{"Reddit ID":"Anxiety_17","Reddit Post":"BetterHelp? Online Therapy? Has anyone ever used these types of therapy or mental health care? I don't have insurance but my anxiety and derealization \/ depersonalization episodes are making me become depressed. I don't have any libido in my body whatsoever. I want to travel, but simply driving and going into Walmart can send me into a derealization episode. I have panic attacks where everything looks like I'm playing a VR game and I begin vomiting and hearing people talk is scary. My anxiety then makes me have an insane amount of guilt for those around me. I need help! But I have a part time job, making 16.50 an hour so I can't really afford expensive health insurance. I also haven't had a general check up in 8-10 years."}
{"Reddit ID":"Anxiety_18","Reddit Post":"lot of new changes making me nervous. recently I got some really great news, I got a new job that pays decent and it gives me weekends off, which will also give me more time to focus on my music. (I'm being considered to be part of a band, don't know if they'll choose me though) AND I'll be able to afford my own place. I don't have to live with my shitty roommates anymore. \n\nso yeah obviously this is all wonderful news and I'm super happy because I've been manifesting this for a while, but because I have anxiety I'm like, \"so when is it all messing up?\" Because that's what happens with me. When I get good things I become immediately skeptical. \n\nI'm hoping and praying this doesn't all blow up in my face, I feel ungrateful even thinking of it. I should be happy, but I'm so nervous"}
{"Reddit ID":"Anxiety_19","Reddit Post":"I am tired of having all these fears that no one else has. Ever since I was little, I have been afraid of robots.  Unless they are in the movies and are like R2D2 or C3PO,  I have a real existential dread of robots and AI.  Being told to get the hell over it and adapt just makes me get angry that I wasn't born in the 50s or 60s.  I honestly hate technology and I feel inferior over it, I feel like it just makes everyone lazier and less likely to think; and I don't want to see robots taking jobs.   I know automation and machines have always replaced workers, but there was always new stuff to do.  I have this great fear of the world just turning out like Wall-e, where everyone just sits around, while robots do all the work.  This is an actual fear of mine, and my brain is constantly trying to find ways to show that yes, people are getting lazier, yes people are getting dumber.  Or you actually like going to school in person, using paper money, shopping in physical stores, hobbies where you work with your hands?  No one wants that anymore, in the future everything will be all computers and technology.   I just feel like tech is just so damn impersonal, and I feel like I am the only one feeling this way that is my age.  Sometimes I honestly wonder if I am a bad person or a narcissist for thinking that we shouldn't want to be too reliant on technology, and it is good to want to contribute to society and use our brains and muscles.   I honestly don't know what is wrong with me."}
{"Reddit ID":"Anxiety_20","Reddit Post":"I let my anxiety won. But at this point I don't even care about the bigger picture Very long story cut short I planned a trip to see my family for a couple of weeks and I knew that my sleep schedule would be an issue because my anxiety prevents me from sleeping for days at times \n\nI've tried sleeping pills but I don't know what it truly is. Sometimes pills don't work. \n\nAnyways I wasted about $700 on plane tickets and other things for travel. Such a waste and time and only spent two days here. \n\nI let my anxiety win but it's just not worth losing my sanity. \n\nI have to go back home so I can actually sleep and not feel insane"}
{"Reddit ID":"Anxiety_21","Reddit Post":"do i quit my job because it makes me anxious even though i just started? hello everyone, i recently started working at starbucks and i finished my second shift today and i already want to quit. The job itself isn't bad, i find myself liking talking to customers and my co workers are really nice, but i feel really underprepared in terms of training, obviously since it's my second day, but they already had me on the bar and in the drive through and i feel as though if this is how quickly they expect me to be able to work efficiently with the rest of the team then i am fked . I haven't really been able to eat since i started and i barely sleep anymore because i am so anxious and constantly dreading the next shift, and the rest of the week because i only have two days off. This has honestly put me in a very bad place where I just want to find a way to escape it all but I feel as though quitting would make me really disappointed in myself for giving up. But, I dont think i'm able to take care of myself properly while i'm so anxious. I am crying at night when i get home and in the morning before shifts and i'm not even able to do anything else but stress out until I go in. I know this isn't a starbucks issue it's more personal, but i've worked as a barista before in a small local coffee shop and i was completely comfortable after only a few shifts. I don't know what steps to take to help myself right now and I was wondering if the job is really worth all the stress and anxiety. i try many coping techniques like breathing and the 333, and journaling and talking it out or just crying to expel whatever i need to, but it's like a never ending cycle help."}
{"Reddit ID":"Anxiety_22","Reddit Post":"Social anxiety &amp; I feel like I annoy everyone I'm to the point that doing anything that involves interacting with another person makes me feel ill. Like if I have a nail appointment beforehand I feel shaky and sick to my stomach and like I need to use the bathroom and my stomach hurts so bad. This happens no matter what the situation... tattoo appointment, nail appointment, going to collage classes, grocery shopping, visiting in laws...I wouldn't mind just the nerved but it's physically painful. My other problem is the overwhelming feeling that I'm a nuisance and annoyance to everyone I come in contact with. Today I had to reschedule an appointment with my lash tech and the guilt is consuming me. I offered to pay for the missed appointment but I still feel like utter crap. I feel like everyone is put out and annoyed by me and I have to do something to make up for it. I hate talking because I'm terrified of saying something to hurt someone's feelings or embarrassing myself. Am I overthinking?"}
{"Reddit ID":"Anxiety_23","Reddit Post":"I want what Ambien does with my anxiety but 24\/7, not only when I'm about to sleep. What other medication does that? I've done Klonopin and Xanan in the past and because it was incredibly addictive and I knew that the long-term damage in the brain would be irreversible I decided to quit.\\*\\*\n\nKlonopin gives me a mellow and sweet feeling, but in the next day I feel super depressed. And Xanax never did anything to me besides brutally kill my appetite.\n\nAmbien on the other hand... ignoring the part where we get crazy and do stuff that we will regret later, like texting an old crush and asking him on a date (yeah, I had the date... today, btw! oh well, it was fast)... so, what I was saying is that the good part of Ambien is that you feel some kind of freedom and a really peaceful state of mind.\n\nLSD gave me the closest to what I should feel to be the happiest... but only during the trip. But then there's a problem: you can never know what your next trip will be like. And from paradise I went to pure nightmare (ER and shit). So I don't feel like trying it again even microdosing - same goes for shrooms. And weed... yeah, it's pleasurable and shit, but I don't know how it would be if I use it in long term.\n\nI'm thinking more of a controlled substance for now, aimed for anxiety and is similar to what Ambien does. What do we have? I want to have my mind exactly like it is right now while I'm on Ambien: I feel that I can focus, study and the same time being super original e capable of relax whenever I can. The price is high and I'm not willing to pay: my memory and cognition means a lot to me."}
{"Reddit ID":"Anxiety_29","Reddit Post":"Okay, so....I'm too brain dead to figure out a simple situation. Help! I've just had my worst anxiety attack in years! I texted my girlfriend telling telling her what was going on and she got worried and called. When she called, I was short and probably sounded like a jerk. I was like this for 3) reasons:\n\n1.) When I get really anxious or depressed, I have trouble speaking. Like the words just won't come out.\n2) When she called I was about to feed my dog, and it was taking all of my willpower and focus to get a grip long enough to do that to the point I couldn't have my attention elsewhere.\n3) I was barely holding my shit together, and didn't want to break down over the phone?\n\nSo that being said, I'm worried I've upset her. And honestly I just feel embarrassed, stupid, and burdensome.\n\nNow the question is....what do I do? \nApologize?"}
{"Reddit ID":"Anxiety_30","Reddit Post":"Did your anxiety get worse from therapy? I've been in therapy for almost two years. Regular twice per week visits. I thought that it would help me figure out why I struggle. \n\nTo sum it up, I've had more of a chaotic childhood than I've ever realized. The more I'd realize this during therapy, the worse my anxiety would get. \n\nDoes anyone relate? Maybe I'm doing this therapy thing all wrong???"}
{"Reddit ID":"Anxiety_31","Reddit Post":"pls help am i an asshole because i cant handle long work hours? I recently switched locations, im still doing the same type of part time job just at a different location. This new location is giving me 8\/9 hour days and I hate this location it has only been 2 weeks. I just cant work full time i physically cannot do it i am not happy doing that im 21 i know im young but i have no desire to move out of my parents anytime soon. I seen my new schedule and idk if I can do this its giving me anxiety but at least i get 2 days off that I requested but I still cannot work 8\/9 hours each day I know it sounds very childish and entitled and i do feel like a p***y because i feel this way. I know 8\/9 hours is normal for a lot of people but theres also other little things about this location that i dont like"}
{"Reddit ID":"Anxiety_32","Reddit Post":"Anyone else have trouble hooking up with girls with no strings attached. Anytime I have a connection I'm always looking for something deeper and want it to be more than just a hookup.  I can't stop thinking about her, and I bet she probably forgot about me already.  It's not even been 24 hours yet what the fuck is wrong with me. Mabye I should stop drinking."}
{"Reddit ID":"Anxiety_33","Reddit Post":"I am not living Anxiety has taken over my life. I try but I can't seem to beat it. I am so tired of all the sleepless nights. I am anxious for no reason, my thoughts obsessive. I alternate between anxiousness and irrational anger. The most pathetic thing about me is, I don't even understand the root cause of it all. But I do remember the first time it happened. I was alone then and am alone now.\n\nAnxiousness is something that I have learnt to live with but lately it comes with a layer of anger. The anger scares me. It blinds me. I feel the rage at my fingertips, I wish I can rip it again. Tear my fingers off. Pain isn't just a feeling anymore, it is a coping mechanism.\n\nI think the same things over and over again. Again and again. I am not living, I am dying. I want to die so I can live."}
{"Reddit ID":"Anxiety_34","Reddit Post":"I have GAD and I have always had this weird need to park in a specific spot I have GAD and I have need to park in a specific spot. When I go to the grocery store it isn't as bad but at like the gas station or sonic I only have certain numbers I will go to. It was the same way at work. It makes me feel crazy does anyone have this issue?"}
{"Reddit ID":"Anxiety_35","Reddit Post":"Girl I like has had it rough. How can I tell her I feel bad for her...? I wrote out a draft remembering all the bad shit she told me about and I said I felt bad for her and I'm usually positive but was feeling anxious.... and then felt bad about her...?\n\nI dunno. This is sincere and not weird right?"}
{"Reddit ID":"Anxiety_38","Reddit Post":"After therapy today, there was this outdoor cat that the lady across the street owned (with a ton of other cats btw) It's really cute so while I was waiting to get picked up, I wanted to see if it would become friendly with me (she's a little scared of humans). It ended up working and she became really friendly! Ended up brushing up against me everywhere, licked my hand (no open wound), and other things like that. At some point, i think she was trying to lick me again but i felt her tooth on my leg. No bite mark, but what I think might be a pimple on my leg, idfk lmao, and thus no blood (however i keep noticing stories of people who get rabies from seemingly invisible bite marks, but those are from bats, not cats). \n\nAt first, I was fine... and then I looked up \"rabies\" on Google, and here I am 8 hours later still researching it. I remember looking up symptoms of rabies while the cat was just chilling there lol. Anyway, I read a bunch of shit. The cat looked friendly, like any normal outdoor cat. It was a little shy around new people but got accustomed to you if you gave it the chance to. \n\nI honestly don't think I have it, but I have this compulsion to read and read until the feeling is numb and i get fatigued. It's just tough. Can someone reassure me or something\/also tell me if I have rabies or not? This feeling sucks man."}
{"Reddit ID":"Anxiety_39","Reddit Post":"before covid, i remember sitting in desks at school when they weren't spaced out. we would be practically shoulder to shoulder, yet i had no problem with it.\n\nhowever, after the year online, we went back in person and the desks are spread apart. the thing is, in two of my classes, the desks aren't spread apart. it's not a covid concern when i sit close to people, something about sitting so close to others just makes me feel...claustrophobic? i don't know if that's the word, since i never had this issue before. i was diagnosed with severe anxiety a couple years ago, but sitting close to people was never a big trigger. \n\ni get super tense and i feel so overstimulated when i sit still in these classes. my hands sweat, i feel tense yet like jelly, my throat tightens up like there's a lump inside, and my stomach starts making weird noises (which is AWFUL because i'm literally sitting shoulder to shoulder between two people). by the end of class, i have to take extremely deep breaths because it feels like i'm choking. \n\ni don't know what to do, because i have these two classes everyday, and everyday i experience this awful feeling."}
{"Reddit ID":"Anxiety_41","Reddit Post":"Okay so basically i can get emotions but I can't feel them like before. This is something that is very impossible to describe. Even my doctors can't get it. I remember when I would cry, be happy or motivated. It felt super nice In my brain. It's like an strong powerful energy if you know what I mean. Now i just don't feel. Like yes I still get emotions like crying and all. But I just don't feel them very much. It's like no reaction in the BRAIN. Same with hunger and pooping. It just doesn't feel anymore like in my brain. Can someone relate and understand"}
{"Reddit ID":"Anxiety_42","Reddit Post":"New level of anxiety unlocked: I can't sleep beside someone. Have been sleeping by myself since I was a young teen. But soon in college I felt alone and restless.\n\nThis time I slept beside someone I love butthe irony is, I was too conscious about breathing heavily, moving around, thinking if they are awake. And now it's a bummer cuz I don't want to sleep beside anyone ever. I thought sleeping beside someone you are close to reduces stress and improves sleep.\n\nEnded up sleeping on the couch. Instant relaxation."}
{"Reddit ID":"Anxiety_43","Reddit Post":"Picked up a prescription for Sertraline (zoloft) 25 MG today, and terrified to start taking it because of side effects:( . This is my first time posting on here. I will be 19 in two days, I have been struggling with anxiety, and depression for about three years now, at least that's when it got really bad. I panic through out all day almost every day about every little thing and I am in bed all day every day, too scared to stay standing up for longer than going to get food or to the bathroom before I run back to my bed. This has gotten so bad I'm unable to work, socialize with friends and family, or do something as simple as take my dog for a walk. I am barely holding on and I can't handle much more of this. I was prescribed Cipralex a few months ago and I only took that for a few days because medication is one of the many things that give me anxiety, and than I search every little thing and scare myself into even feeling sick. Today I was prescribed sertraline, and I even went to pick it up and it's in my medicine cabinet now. I read up on this medication for so long and I'm so scared to start it not knowing what to expect, so I guess I'm just looking for advice and to hear other peoples stories and hopefully gain some motivation and courage to start this medication that could potentially change my life. Thanks in advance."}
{"Reddit ID":"Anxiety_44","Reddit Post":"I am going to the dentist today. I've always been afraid of going but it's just become worse the older I get. I'm so afraid of having a panic attack or getting anxiety while there. It would be so embarrassing. My grandma is driving me there and will be in the waiting room but she haven't experienced when i get anxious before. That just stresses me out even more. Does anyone have any helpful tips?"}
{"Reddit ID":"Anxiety_45","Reddit Post":"Does anyone else itch all over when they're feeling particularly anxious? I just itch all over. I started to take Zyrtec daily and it would help but I ran out and am considering trying to not be on it anymore?? Just wondering if anyone else experienced this. I don't have eczema or particularly dry skin and there's nothing visible where I scratch, I just itch everywhere, my legs, arms, scalp, the tops of my feet, my abdomen...\n\nDoes anyone else have this problem? If so, anything that helps? I am on medication for my anxiety, and do need to start meditating more..."}
{"Reddit ID":"Anxiety_46","Reddit Post":"Does anyone else have good days\/moments and question themselves? I finally talked to my doctor today about going on medication and am starting meds today. And ironically (I think maybe because on some level it feels good to actually be taking active steps to help myself) I am feeling EXTREMELY calm right now. More so than I've felt in weeks. \n\nAnd so now I'm questioning myself like \"gosh maybe I'm just being silly I don't need meds look how fine I feel\". Even though just earlier today I was anxious as heck. Even though it's starting to affect my job. Even though my brain almost never shuts off and I haven't been able to escape the cycle of thinking 500 steps ahead for literally even the smallest thing and thus feeling too overwhelmed to focus on ANYTHING for almost a year now. \n\nDoes anyone else do this when you're feeling okay or is it just me?"}
{"Reddit ID":"Anxiety_47","Reddit Post":"I feel so traumatized. I found some disturbing images and I'm just not feeling well mentally. I wish I could easily erase them from my mind. It is killing me. Help me. I'm scared that I'll never get them out of my head. I wish I could forget them like I never heard of it. It's stressing me out! I was on the right track with my mental health until I saw them."}
{"Reddit ID":"Anxiety_48","Reddit Post":"So I've been suffering with terrible health anxiety for the past year. It's completely taking over my life. I've always avoided medicine as I'm terrified to rely on something for possibly the rest of my life. Aside from the health anxiety I've had anxiety since I was 13 and haven't used medicine so it's tough. I'm looking for peoples stories and their experiences with medicine when it came to their health anxiety and if it's changed your life. I feel like I'm stuck and I'm really considering medicine I'm just scared."}
{"Reddit ID":"Anxiety_49","Reddit Post":"Can you abuse buspar? So I got prescribed this not too long ago, and the first night I took it, I got extreme relief. Like crazy felt like I took a Xanax relief. It was very weird, and it made me question that this may be non-addictive, and I read about the possibility of abuse in the drug. I do have a history of abusing Xanax, not ever in crazy amounts, but I never had anxiety relief so I would buy them for myself for my own anxiety since my doctor was worried about prescribing it. I took Xanax for 2 years Unprescribed, about 1mg twice daily before I got sober about 3 months ago."}
{"Reddit ID":"Anxiety_51","Reddit Post":"How 2 months of chronic stress has effected me physically I'm currently completing my A levels (a series of exam you do in the UK at the age of 17\/18, that determine whether you get into university)... as you can imagine, I have been stressed. I'm under a tremendous amount of pressure to get very high grades (straight A's). I've completed 2 exams, and have 5 left to go, 3 of which I'll be sitting tomorrow, the next day, and the day after that...\n\nI'm shocked at how this stress has effected me physically. I've always been fairly neurotic, but the anxiety I tend to feel is transient, and is rarely severe enough to manifest in anything physically significant, beyond a raised pulse and slight breathlessness.\n\nI knew I was getting myself *way* too worked up when I started to pull out hair in the shower. I have very thick hair, so a lot of it was coming out. I've had severe brain fog, which hasn't been the least bit helpful during a time when I have to be the most alert and *with it*'. I've had no appetite, and now my trousers are all loose, with one  pair literally falling down when I walk. The most bizarre symptom I've had is this weird jaw tension - my jaw is very clicky, and it feels incredibly tense and stiff. As a hypochondriac, I was convinced this was a heart attack, but I was reassured that it's probably just anxiety. I've had weird gastrointestinal symptoms, where I feel nauseous, and have this pit in my stomach all of the time, which could be caused by the lack of eating, but it persists even when I have eaten. \n\nAnd then of course feelings of impending doom, etc etc. \n\nI just can't wait for this to be over."}
{"Reddit ID":"Anxiety_52","Reddit Post":"Why is being alive and surviving so difficult? I have had anxiety since I was a little kid. I've had extreme anxiety and panic attacks since I was in kindergarten. Nothing was ever \"easy\" for me and still is not. Sometimes I feel like in order to do anything I have to use all of my energy, whereas other people can do it and use almost no energy.\n\nI have tried many things to help my anxiety, but still it persists. I have been to counseling, which helped slightly, I am on anxiety medicine too since counseling did not help enough. Even with anxiety medicine, I still struggle with anxiety and because of it, depression. My anxiety medicine seems to have bad side effects, like no sex drive, super irregular periods, tiredness, night sweats. I would say it slightly helps but I also wonder sometimes if it is just a placebo affect in my mind.\n\n I struggle to work, be social or anything \"normal\" people do. The longest I have had a job was 7 months straight before I quit and changed jobs. I am a hard worker when my anxiety doesn't get the best of me and I have excelled in any job I have done. I've even excelled in school and just got my Associates degree. Now I am incredibly anxious because I need to get a job again now that I completed school but all I can think of is how anxious it makes me. I don't like to make mistakes or get in trouble, and I do everything in my power to do things right, however I know it is IMPOSSIBLE to be perfect. Life would just be much simpler if this feeling of anxiousness wasn't there for every little thing I try to do in my life."}
{"Reddit ID":"Anxiety_53","Reddit Post":"How do you wind down for sleep? I always find it difficult to wind down and get my body\/brain into Sleep Mode, even if I'm really tired. What have you found to be helpful? What's helpful for one person my not be helpful to others I realize, but I'm still curious and looking to get some ideas. Espeically now as I'm wound up, but tired at the same time, and really just want to sleep.\n\nReading is a classic. Although if you are reading a thrilling\/exciting book, it could have the opposite effect, possibly.\n\nI can't really listen to music or podcasts as I'll never fall asleep while they are still playing, or with my headphones on\/earbuds in.\n\nMeditation is not my thing, but I know that can be a great way to wind down.\n\nI have night mode\/blue light filters on all my devices so I'm not staring at bright white screens right before bed, that's always a good idea.\n\nCutting out or cutting back on caffeine may help, especially if drink a lot of caffeine.\n\nBut anyways, I'm curious to hear what your \"prepare for sleep\" regimen is."}
{"Reddit ID":"Anxiety_55","Reddit Post":"Hey guys. First time posting in here but I hope it will help me. I've had anxiety ever since the 3rd grade as I can remember. I have always been the type to not be able to eat when I was anxious. Everyone thought it was weird which only made it worse because I now I'm caring what people think about me. Fast forward and I'm now with my wife of 5 years. I'll have random episodes when I choke up and feel like gagging when I eat but I have NOTHING to be anxious about. I honestly only feel this way when we are going out to eat with her family. Or with some of my family that I don't see often. But I love her family. We have lived together and always been around each other since we started dating . So why I'm the hell do I still get anxiety when they call us and ask us to dinner or to come over? Sometimes I can do it with no problems. But other times I feel like I'm going to throw up. Even when I know I'm hungry. It sucks so bad. I know that sometimes I can do it with no problems but the fact that I still have to think about and not just do it really irks me. I just want to be normal. Go out to dinners\/party's and just eat a bunch of food and have fun with everyone. I should note that when we are home by ourselves I eat like a pig. But a soon as we go out ... it all goes away and everyone just thinks I never eat. Does anyone else have this?"}
{"Reddit ID":"Anxiety_56","Reddit Post":"Dealing with other people's bad moods\/raging For people who are very sensitive to other people's moods, do you have any tips or tricks on how to deal with it?\n\nThis in specific for me is my SO's raging during his gaming. It's a daily occurrence of cursing and raging at his game and it stresses me out beyond belief. More than it should for what it is, I think. \n\nInstinctively I feel a strong urge to flee, to get away from the house, or his vicinity or even ending the relationship altogether because I feel I've reached my tolerance limit. \n\nI'd think that's how I usually get around people who are generally very emotional in a negative way - I want to flee from them and get them out of my life completely. Even when they're generally nice and good to me, this instance of being negative affects me to the point where I cannot see anything but it and not feel anything for them but... aversion? \n\nMaybe it's possible to go through life and avoid such people altogether, but I'm sure there are situations where you somehow just have to deal with it, being in a relationship at times or maybe in a workplace environment or with family members. \n\nI've asked him to stop many times, it's gotten better, a bit, but I don't think he'll ever stop, and I cannot control him or other people, so I'd like to find a way to control it within myself. To not take it as personal and devastatingly as I do. The anxiousness it gives me overpowers anything and everything. My thoughts, my emotions, my actions in ways. \n\nSo, does anyone have tips for me to try?"}
{"Reddit ID":"Anxiety_57","Reddit Post":"my neighbor heard me having \"fun\". my partner and I have sex a LOT and nobody has ever said anything. we've been doin our thing for months. my partner and I were getting super into it last night and I was pretty audible. like.. loud loud. but the apartment buildings have literal cement walls, and of course the door and windows were all shut. out of nowhere, someone comes banging on the door, not knocking, banging, mad af and starts yelling at us really aggressively. I didn't want to look weak, so I laughed out loud and yelled back \"you mad!\" then he snapped back with \"nobody needs to know y'all are having sex!\" and then kept goin on and on with his aggressive shouting. finally I go \"alright, alright\" and he walks away talking under his breath.\n\nalso, I'd like to make it a point I think it's super interesting he says \"nobody needs to know\" instead of \"nobody needs to hear.\" like maybe he's projecting something?\n\nanyways, my partner was ready to go out there and say something but I stopped him bc my anxiety was peaking like crazy! I care immensely what people think about me (I'm working on that) and people yelling at me and banging on surfaces are huuuuge triggers to my anxiety. I wish I would've let my partner say something.\n\nwhat should I make of this?? should I feel embarrassed? should I not care? I felt so violated by his reaction I don't even wanna have sex there anymore. I need help on how to cope with this. please and thank you!"}
{"Reddit ID":"Anxiety_58","Reddit Post":"i think im a kleptomaniac. i know it's bad and i know i can get into legal trouble but i just can't stop stealing stuff, especially from stores. i got into my dream university and will get big opportunities going forward, but im scared i ruined it all by shoplifting from these big corporations over the years. I haven't gotten arrested or a letter in the mail yet but im checking everyday to confirm my worries. i feel like throwing up just thinking about all the hard work, the sheer amount of hours i put into school just for it to be all thrown away if i get a felony out of this. i want to go into therapy but i cant until i move out. I just wish i could redo everything. This whole night has just been spent on what couldve been if i wasn't so dumb in the moment. im usually laid back but certain stuff like this can really trigger my anxiety and it's usually right. i just know a case is being made against me and there's nothing i can do about it. i just want to cry and give up at this point"}
{"Reddit ID":"Anxiety_59","Reddit Post":"Need a hand! Help me ascertain what kind of disorder does these symptoms belong to I'm in my mid-teen years now, ever since i was small, i always had these compulsive thoughts that distort my thinking from time to time that I felt obligated to think about which are time consuming and at the same time tiring; I didn't think much from back then because it wasn't much of a hassle. But as time passed and as of now, these thoughts became much more excessive and severe that it intrudes my everyday life through excessive repetition of actions and thoughts and compulsive behaviors that I'm driven to perform to negate the distress but only temporarily lasts and causes great distress and anxiety to my mind and physical body to the point that it interferes with my daily life. Aside from such, I continue to endure these unwanted thoughts and distress everyday and presently causes me physical pain due to the effects of stress towards parts of my body; it also degraded my normal thinking process due to the infliction of stress. It now became unbearable for me, can anyone tell me what disorder does these symptoms are? and what kind of doctor should I go to; thanks for hearing me out!"}
{"Reddit ID":"Anxiety_61","Reddit Post":"Social media is toxic. I already knew this but stumbled upon a tiktok compilation on YouTube trying to find a particular song. Seeing all the females made something inside my head snap and I felt it. I struggle with body image badly and after seeing the videos it made me feel even more ugly and worthless. I'm having a hard time thinking I'll ever be beautiful again, I say again because there was a time I did feel pretty. \n\nI dont know. My thoughts are getting overpowering again and my head feels all foggy.\n\nEveryone, spread kindness, that is the only thing I can focus on and lift those around me. When I go to work later I want to be in a positive mood and support everyone. \n\nThe darkness won't be here forever, tread lightly the rest of your day friend"}
{"Reddit ID":"Anxiety_62","Reddit Post":"Almost done with my masters degree and I want to quit because my school is doing nothing about sexual harassment from a professor. It's not even directed at me but the corruption makes me sick.  5 women have left the program or changed advisors over the past year and a half because of one professor, and several undergrads have been preyed on.  I only have one more semester but I am so disillusioned I just want to quit.  I no longer want a career in academia because everyone is just covering up the corruption."}
{"Reddit ID":"Anxiety_63","Reddit Post":"Hey everyone, so I woke up in the middle of the night feeling extremely anxious and having tremors. This really caught me off guard because this has never happened to me and I went to bed feeling perfectly fine. I did have a strange dream that didn't actually have me in it but it also didn't seem like a very terrifying dream that would cause me anxiety. This ever happened to anyone and any tips on dealing with it?"}
{"Reddit ID":"Anxiety_64","Reddit Post":"Looking to see if there are people who experience anxiety in the same way I do. Hello!\n\nI'm not really able to seek therapy for the moment, but I'm doing everything I can to help myself. I unfortunately ended up abusing substances for a period of time but I'm sober now and dealing with things a little better. I'm just looking to see if anyone can relate to my experience with anxiety.\n\nFor me, there is no particular thing I get anxious about, no particular situation. I'm fine with phone calls, public speaking, all the classics. \n\nI get anxious when I have to do tasks that may reflect on my ability, intelligence, or self-worth. I also get anxious when I have to do things to achieve something that I care about. The sad thing is that I'm a huge procrastinator due to that. Avoidance and procrastination are how I cope. The issue is that it branched out so much it affects almost every activity. Most of the time though there is no other thing I should be doing. It's just me trying to do something, becoming more and more anxious and dropping it.\n\nIf I think I wanna work out, I'm anxious because I think I should be doing work. If I wanna work, I'm anxious because I think I should work on personal projects. If I wanna work on personal projects, I'm anxious because I think I should work out. It never ends. \n\nI don't get panic attacks or a faster heart rate or anything, I just get a deep sense of dread and tunnel vision if that makes sense, it's just an \"oh shit\" feeling that I can't shake.\n\nAnyone relate to this? How did you deal with it and start not dreading doing things because your brain can't stop telling you you're doing the wrong thing?"}
{"Reddit ID":"Anxiety_66","Reddit Post":"Having trouble with starting new things due to anxiety towards not being good enough or fear of failure? Getting over the mental resistance stage. Hi, I'm pretty new to this subreddit. So please forgive me, I'm not the most elborate. I always been generally nervous person. But, one thing which always plagued my mind is that, I have a really weird fear of trying new things in fear of failure or not being good enough? I have this very weird mental resistance which really holds me back from really pushing myself to my full potential. \n\nI'm generally a very hard working person. But it really takes me a lot to get over my really bad anxiety when taking up the task of trying a new skills and setting standards for myself? I really want to do a certain thing, then I sort of just end up procransating and when I do try I get really put off my that new skill due to perfectionist nature and I tend to overthink of how to do the very thing I want.\n\nI'm wondering if anyone on this subreddit really knows how to get over the mental resistance and fear of failure when trying a new skill? It's been a bit of a bother for a long time. The saying 'just do it' really makes me more anxious, don't know why? So it would be very much appericated if anyone with my experience has any advice."}
{"Reddit ID":"Anxiety_67","Reddit Post":"Okay..i don't know how to fix it now..i get drained in the afternoon by 5pm..not sure if it's a blood sugar thing or anxiety. I ate something but it doesn't seem to help. Then this triggers somewhat panic\/anxiety the back of my head start to feel numb, and my lower back hurts as I feel my kidneys are working to pump stuff. \n\ni wonder if this is a thing that the hydroxyzine i was taking for sleep last night leaving my body so i experience more anxiety.. it's helping me sleep but i felt heart palpitations after taking it and upon waking up, and i'm only taking 12.5mg.\n\ni tried walking yesterday at this time but it did not help..my head was dizzy and my legs below my knees were numbing..so today i did go for the walk, but at home i'm still feeling drained.. is this really something is wrong with my brain chemistry? would the meds help with these symptoms?\n\n\ni really don't know what to do, but my health is sinking and it's so scary.. and i start to develop bumps on my forearms that don't hurt but feels like from the blood vessels..\n\nI took some blood tests 3 weeks ago due to fatigue, and they were fine. but i didn't do lipid or fasting glucose."}
{"Reddit ID":"Anxiety_68","Reddit Post":"Can't eat because of anxiety. I just had to basically shove my breakfast down my throat today.. it's been going on for a few days now due to extreme anxiety about both work and personal situations.. Do you have any strategies on how to increase your appetite? I am going extremely hungry, but then can't stomach food, like I am almost disgusted while I feel week from hunger.. It has never happened to me for so long, I am scared - what's happening to me.."}
{"Reddit ID":"Anxiety_69","Reddit Post":"Anxiety about always feeling embarrassed by myself. My anxiety has me overthinking moments earlier in the day &amp; just finding every bit of reason to be embarrassed about who i am. I drive myself insane. Sometimes i am disappointed in something i said, sometimes it's just my overall attitude i worry about absolutely everything.  It makes me want to crawl out of my skin and just escape forever."}
{"Reddit ID":"Anxiety_70","Reddit Post":"Alright, this is frustrating now. This post is going to be my first one on this subreddit. Keep in my mind that I haven't slept for a long time and I am very sleepy so I can not make sense at times. I apologize in advance when that happens.\n\n\nI tried sleeping from the past 3 hours(was awake for like 15 hours prior to this) and haven't reached any luck so far. I am staying away from any sleep medications because I have IBS too and they irritate it. So, yes. That is pretty much it. I had a really bad anxiety attack because I was afraid of getting nightmares(I get them a lot) and now I can't get sleep at all. Also, I lost one of my earrings a few days ago and found it on the bed(must have fallen off while sleeping) so now I am irritated at myself for how irresponsible I am and how I didn't search properly. To top it off, I have an important exam in less than 6 days and I really want to score high. However, I am really afraid that I won't be able to wakeup at the time that I want to because I am not getting sleep. And of course, I can't start studying now because I am really sleep deprived. So yes, I am frustrated that I can't perform a basic function like sleeping on time."}
{"Reddit ID":"Anxiety_72","Reddit Post":"So for the past couple months I've been getting a lot of anxiety right before I go to sleep. I will have everything I need done for the day and I'll be perfectly fine until I finally lay my head down on my pillow and close my eyes. Suddenly I am just hit with this intense anxiety and I can't sleep. It's the type of anxiety you can feel in your stomach to and it's not just to heart racing and stuff. I don't know why this happens or what to do. Does anyone have similar issues, if so, how did you cope\/fix it?"}
{"Reddit ID":"Anxiety_73","Reddit Post":"I made a mistake and apologized and I still feel bad and feel anxious about it. I really need to stop and start living my life... I've been hanging out with friends more, doing yoga, got on medication. Im trying everything but still, everyday I'm just thinking about what I did. Im so tired of being myself. I wish I could start over from birth lmao or start over in a different country. But I heard that the sadness follows you everywhere you go"}
{"Reddit ID":"Anxiety_74","Reddit Post":"I have no idea what triggered it, but I've been having low levels of anxiety\/nervous energy since waking up this morning. I can't sit still, and house-cleaning is impossible beyond one small task at a time. Just can't shake the feeling that something is really wrong and I should be aware of it. \n\nBased on past experiences I know I'll be riding this wave for the rest of the day, but it really sucks. I took some Klonopin before lunch and it barely made a dent in things. Now my daughter is home and I feel like I need to put on a mask so she doesn't see that I'm upset. Sorry, I just felt like I needed to vent to people who probably can empathize. Fucking UGH"}
{"Reddit ID":"Anxiety_75","Reddit Post":"I don't really have anxiety too bad but sometimes I have really physically aggressive panic attacks usually when I'm really exhausted and something anxiety inducing happens. But sometimes it's for no reason. Sometimes it just happened because I get up fast out of bed and the cold shocks me. It starts off with me feeling extremely cold like I'm freezing. I then seize up and start shaking uncontrollably and very aggressively. My teeth clench and I can barely talk. I would say it almost looks like I'm having a seizure but I'm completely conscious and aware the whole time. It's more body than mind but it's really intense and it usually last about 5-20 minutes depending on how fast I can get all the covers on me and eventually warm up. \n\nDoes anyone else experience this? Is this just a panic attack or should I see a doctor?"}
{"Reddit ID":"Anxiety_76","Reddit Post":"how to be social? how do people talk to others without focusing on what your hands are doing or like practicing in your head about what you want to say over and over again\n\ni really want to be able to socialise without being awkward and anxious that i wont have anything to talk about and create an awkward atmosphere :("}
{"Reddit ID":"Anxiety_78","Reddit Post":"I work up extremely anxious today due to the fact I have to idea what to do with my current situation. I started my current position in august but have called out\/left early several times due to the fact that my anxiety makes me physically ill. (Heart rate above 150 and uncontrollable throwing up) making it impossible for me to be in a public environment. This past Thursday I received a very unexpected call that my grandmother who I was very close to was on life support and it was critical that we needed to go see her that day. Friday I asked to stay off with her again due to the fact she was going to be removed from life support and was not expected to make it. Thinking about going in tomorrow is making me sick. Her funeral will not be until Thursday and I know I cannot be in the environment for the next three days while I am grieving. But I feel as if I have already taken too much time and I need my job to pay my bills. Not to mention I am getting married in May and require two weeks off for travel. I guess I just need some advice. Not really sure what is best to do here. Or if I just need to suck it up and go in."}
{"Reddit ID":"Anxiety_79","Reddit Post":"Hi! New poster so I apologize for any mistakes! \n\nI've been dealing with anxiety and panic attacks since I was in middle school, and I know that they are caused by abandonment issues, as well as some insecurities. I know exactly what my triggers are, why they happen and what specific fear is causing them....so for the most part I have been able to manage it without medication or therapy. Unfortunately, things began to peak two years ago during the beginning of covid and my stress and anxiety ended up actually causing shingles. After this, and getting covid, a few other random symptoms began to occur during major anxiety episodes. These still happen to this day, when it gets bad enough, but doctors have assured me these symptoms are my \"post covid norm now\". A lot happened in that time to cause it, so it wasn't one specific trigger like it used to be. Ever since, I have had a much more difficult time controlling the spiraling that occurs once the thoughts creep in. It is now affecting my personal relationships as well. \n\nMy question is, how are you able to manage the physical and emotional symptoms of anxiety when a major episode does occur? Is medication and therapy really the best and only solution?"}
{"Reddit ID":"Anxiety_80","Reddit Post":"How do I support my girlfriend as best as possible? My girlfriend has pretty bad anxiety. Her family isn't very helpful and she often turns to me for support. I really care about her and I want to do everything I can to support her. Any tips\/guidance\/places to research are helpful. Thank you so much!"}
{"Reddit ID":"Anxiety_83","Reddit Post":"I need help. M18. Health anxiety. I am already on Sertraline and I'm with a psychotherapeutic. \nI think about my legs and a possible blood clot there every single second for about 2 months now. It feels like I am waiting for a pulmonary embolism. I neither have a single risk factor, nor any specific symptom. My legs just feel 'weird'. Sometimes I can feel some tension whether in the backside of my knee or around the ankle aswell as right and left of my foot. So basically all in my legs some sensations would I call them. I don't have pain when I use my legs, just the named tension\/sensations. I can't get rid of my thoughts and anxiety. I already made a list of 10 things that speak against a DVT\/blood clot but I am just so fixated. What can I do? I have already been to a vein specialist but he only checked my left leg, now the focus is in my right leg. I don't want to go to my doctor again, I go there like every 2 weeks."}
{"Reddit ID":"Anxiety_84","Reddit Post":"Basically, I found out my ex self harms after the drama we had between me and him, him and my best friend dated, I threw a fit, my friends attacked them, I tried to stop and support my ex and my best friend, but they kept going until they were forced to leave. Months later, it's all chill, but my ex self harms and I fully blame myself for it even if he says I didn't. So, since I made him do that, I'm debating on killing myself, I wrote the suicide note, I don't have a plan yet, but, you know, I might not, I really want to live, but I don't deserve to."}
{"Reddit ID":"Anxiety_87","Reddit Post":"answer quick help, im freaking out. cleaned my floor with clorox bleach wipes, put my cat in the kitchen when i let him out i thought it was dry he was sniffing right there and i checked his paws they were wet with bleach, i wiped his paw with a dry towel and water, he was licking his paws though i tried to stop him, i threw him in the bath i didnt have soap i just rinsed his whole body and paws and got him out but he keeps licking. is he gonna be okay? i dont have vet money. do they know if they need to stop licking? you think theres still any on him if hes licking it ? im scared."}
{"Reddit ID":"Anxiety_88","Reddit Post":"So I've been on Prozac (20mg) for almost two months now for my anxiety. The side effects have been unbearable, so I finally scheduled an appointment with my doctor and he prescribed Lexapro (10mg). I took my last dose of Prozac last night and he said to start the Lexapro tonight. Can't this cause serotonin syndrome? I'm really nervous about switching."}
{"Reddit ID":"Anxiety_89","Reddit Post":"Anxiety is ruining my ability to work. I'm new to this job (coming up on three months) and I've had two major panic attacks at work. I couldn't calm myself down and started hyperventilating, crying etc. I had to go off the floor to cool down. \n\nI can't keep doing this. I feel like I'm going to get fired if I can't do my job and since I'm still under my probation.. and it's been super super embarrassing for me, as several supervisors and coworkers witnessed my panic attacks. \n\nNo idea what to do, but I'm just exhausted and overwhelmed."}
{"Reddit ID":"Anxiety_92","Reddit Post":"These past few days my anxiety has been through the roof because I'm meeting my long distance boyfriend for the first time and I'm over thinking every little thing and its causing me to not sleep to feel sick all the time and it makes me sit in the bathroom which is my safe space and I obviously know why my anxiety is playing up but its never been this bad im sweating with mind racing thoughts and I was wondering if anyone had any advice or has been through this?"}
{"Reddit ID":"Anxiety_93","Reddit Post":"My (18m)family isn't taking my anxiety seriously. I feel so stupid for even telling them. I've  been dealing with anxiety for most my life, in 5th grade I used to feel nauseous whenever I had to go to school. 2 days ago I had a panic attack while giving a presentation in class, I couldn't even finish and everyone laughed at me,I told my mother what happened and that I need help. I don't think she understands what anxiety is because after explaining to her how I felt and what anxiety is she said i was overreacting and it's probably just stress because it's my final year of high school but I've dealing with this for years.She also tried giving me a sleeping pill so that I could calm down.\n\nhow can make her understand how serious it is and that's not just something that started two days ago? really need help because I have 3 more presentations coming up this month and I don't wanna experience what happened last time again."}
{"Reddit ID":"Anxiety_94","Reddit Post":"Does anyone else get super anxious when you know you have to wake up early the next day?\nIt makes me so nervous that I usually can't sleep the night before the day I have to wake up early.\nSo many thoughts go through my mind when I try to sleep and I end up not getting enough sleep if not any. \nIt's just like the thought of needing to go to bed makes me more and more anxious as the night goes by and I enter a vicious cycle of telling myself to sleep which leads to me being more anxious about not being able to sleep and not getting enough hours of sleep and worrying about how I'm gonna perform the next day."}
{"Reddit ID":"Anxiety_95","Reddit Post":"I don't know if this is the right subreddit to vent but I'm extremely nervous because tommorow is my first day as a blackjack dealer. I've had a month long training to be a blackjack dealer. Basically they train me for a month and by the end of the training I audition.\n\nTo pass the audition you don't have to be great at dealing, it just means you know how the game works, the proper procedures, payouts, and being able to count chips and cards fast enough. A great dealer becomes great over time actually dealing on the gaming floor.\n\nToday I passed the audition. I got 88 out of 100, I just needed 80 to pass. She said even if I made a couple minor mistakes that I did things smoothly. This means tomorrow I deal to real people with real money.\n\nI've worked in the casino for several years now doing stressful jobs and dealing with stressful patrons, but this is the first time I feel fear. I'm still going to be monitored by a supervisor the first couple of weeks and it's unavoidable that I will screw up many times because every new dealer will but I'm still scared. \n\nDuring the last hour where I just kept practicing dealing I kept screwing up collecting ante right, fortunately no issues counting cards and managing payouts but that still spoiled things for me."}
{"Reddit ID":"Anxiety_96","Reddit Post":"So let me start off by saying I'm in senior level management so I've been able to push through my anxiety most of the time. In my most recent position, I was essentially put on a performance plan and forced out my position which absolutely crushed my confidence. I was also suffering, and still am, health issues. \n\nAfter some time off to collect myself, I was able to secure another senior level position in a remote setting. I thought remote would definitely lend itself to less stress, but my anxiety is completely out of control. I learned today I have to lead meetings with all the c-level executives weekly. It's a huge company. Rather than look at this as a great opportunity, I am literally paralyzed in fear. Most of all, I hate introducing myself, and sharing my background. It's like this weird complex where I'm insecure and hate talking about myself. I'm already plotting how I will need to drink wine or take a Xanax to even get through it. \n\nHelp!"}
{"Reddit ID":"Anxiety_97","Reddit Post":"I'm pretty good about managing my anxiety, but sometimes whenever it comes down to winding down at the end of the day my body seems to think it's time to start stressing out over stuff. Lately I've been dealing with a lot of anxiety related to my breath when sleeping, and it gets to the point to where my throat feels tight and becomes very uncomfortable. Does anyone deal with this? And if so, what is your go-to method of managing it? I just want to be able to go to sleep at a decent hour without so much struggling. I've tried breathing exercises, and I've even gone as far to take a couple of Benadryl to force myself to sleep with varying success. Most of the time I just have to wear myself out until I can finally rest."}
{"Reddit ID":"Anxiety_98","Reddit Post":"Hey everyone I'm quite new here, I just wanted to ask if anybody else felt hot, feverish, slight increase in temperature, bones aching and just generally feeling weak and shaky when they do any sort of physical effort or if it's even a bit hot outside when they're anxious. Doctors couldn't find anything so I was wondering if anybody else felt this way.\nThanks!!"}
{"Reddit ID":"Anxiety_102","Reddit Post":"Help..I'm miserable. I have been on 5mg of Buspar once a day for the past 6 days and each day has gotten worse. Today I woke up feeling extremely nauseous and it has lasted all day. I have a debilitating migraine and have had to lay down and cover my eyes making me unable to work. Ive also been sobbing crying for at least 10 minutes every day. Also experiencing brain fog, upset stomach and lack of appetite. \n\nI'm no stranger to adjusting to new meds but I have never felt this horrible in my life. I really wanted this to work for me because I havnt had weight gain or sexual side effects, but I dont know how much longer I can feel like this. \n\nIs this worth pushing through or should I consider something different? I also bought a pill cutter, so maybe I can start with 2.5 mg a day and slowly increase? I wouldn't change anything without my doctor's approval first but any advice is much appreciated :) \n\nAlso: I am on 350MG of Wellbutrin. Maybe I should lower this dose to reduce anxiety. \n\nHave tried: Remeron, Lexapro and Effexor. So far, Lexapro has the side effects and I can live with most."}
{"Reddit ID":"Anxiety_103","Reddit Post":"Does anyone else struggle to put your thoughts into words, especially at work\/school? I feel at a loss at how to communicate better in professional, high stakes scenarios. I feel like it is and will significantly set back my career. My writing skills are my only saving grace...\n\nAny advice on how to improve communication skills as someone with severe anxiety and medicated is appreciated."}
{"Reddit ID":"Anxiety_105","Reddit Post":"Best stage fright strategies? So I'm doing a performance tonight at my old high school. In high school I was on an Improv team and I graduated in 2015.\n\n So tonight is the Improv teams 100th Show and they're bringing back as many past members as possible and I said yes. So for the first time in 7 years I'll be on stage doing Improv and I'm excited but also nervous I'll bomb since my anxiety has gone up since I graduated. Since Improv can be pretty difficult, but I also didn't wanna let my anxiety keep me from doing something fun.\n\nWhat are the best tips for making myself less nervous and keep the stage fright to a minimum? Any advice would help."}
{"Reddit ID":"Anxiety_106","Reddit Post":"Suddenly frightened of museums? I'm already scared of basically everything...\nTaking the bus, strangers, loud noises and changes of my daily plan are just some of them.\n\nYesterday we went to a museum about nature and animals, I've been there as a kid quite a few times.\nAll of a sudden I became scared of the animal statues, there was no trigger.\nI was so terribly frightend that they would move, not the fact that they come to life or something just the thought that they could be animatronics.\n\nWhich is also stupid because\n1. I've been there and know they're not\n2. I'm usually not scared of animatronics\n\n\nHas someone else experienced something like that?"}
{"Reddit ID":"Anxiety_108","Reddit Post":"I recently started learning to drive and have been enjoying it as it gives me a sense of freedom and find it fun, today i was having a lesson and it was going really well until all of a sudden i was driving in a long line of traffic that was going at around 50kph and saw a squirrel in the road, now i love animals and the most horrific thing happened... it crossed infront of me and i could not stop because i knew i would hit the people behind me and could not swerve around it as there was traffic on the other side of the road. for about 2 seconds i saw this poor squirrel run infront of my car and i hit it.... i feel so sad and keep having constant intrusive thoughts of the event happening again and again and again, i tried my hardest to slow the car down to a reasonable level just enough so the car behind didnt hit into me but there was nothing i could do yet i feel so guilty"}
{"Reddit ID":"Anxiety_109","Reddit Post":"i hate my sales associate job tw \/\/ mentions of suicide right at the end\n\nthey want me to sign people up for credit cards because we are partnered with a credit card company or some shit.\n\nto get anyone to sign up you have to annoy them into saying yes because obviously nobody wants a new bulkshit credit card, and obviously this is very hard for me because i hate when people are frustrated or angry with me. \n\ni don't know what to do. my bosses have been absolutely on my ass because i haven't signed someone up in weeks and everyone else gets one a day AT LEAST. i feel like a failure and i want to quit, but the only thing more anxiety inducing than the job itself is the idea of quitting and \n\na) having no references for my resume (besides my boss from delivering flyers when i was 14)\n\nb) going through the resignation process\n\nc) having no money.\n\ni am 18 and need to start getting serious about my life, but i don't know if forcing myself to stay at a job i'm miserable at is the right thing to do. is this what life is like? i seriously don't want to live like this and suicide sometimes feels like the only real way out."}
{"Reddit ID":"Anxiety_110","Reddit Post":"New here, first time speaking M (29) Earlier this year my father passed away, tbh we didnt have good relationship.\n\nAfter his death, there was lot of things to do.\n\nAfter 3-4 months of doing his business i finally managed to complete everything.\n\nThen everything started (foggy dizzines, neck pain, thinking i will faint, whenever i need to go somewhere i exit my car then dizziness starts, but when i am getting ready and driving nothing happens, just when i get to the destination and exit car). \n\nSo, i visited all kinds of doctors to exclude physical things. Except some stronger tension in neck and upper spine, everything looks well.\n\nSo i assume, the issue i have is anxiety.\n\nMy anxiety attacks last sometimes 5-7 minutes, sometimes around 15 minutes. \n\nThey are not so strong i can fight them off without medications, probably because of the line of work iam in (talking to people, moving around town, i just cant avoid people and public at work).\n\nMy problem started when i did every administrative thing i had for my late father, and i never experienced any problems like this, so i am thinking it is connected somehow. \n\nCan you please help me, share tips, how long this will last?"}
{"Reddit ID":"Anxiety_111","Reddit Post":"Just wanted to share with someone that I filed my tax return all on my own!\n\nFor those outside England a quick simplified brief on our tax system.  If you work for an employer they normally work out how much tax etc you owe and it's deducted at source so what you get in your pay check is yours. But if you're self employed you have to fill in a tax return each year. You can fill in the return from the 6th April and it has to be done by 31st January the following year. So the tax return I've just submitted is for tax year 2020-2021.\n\nI hate doing my tax return. My accounts are really simple, profits easy to calculate and very few expenses. But I'm so paranoid I'll do something wrong. There's so many different fields to fill in and I have no clue what half of them mean. I've always asked my sister to sit with me in the past when I do my returns but this year I did it all on my own.\n\nTo further complicate matters my accounts last year are screwed up because of coronavirus. My income was down ~75% but I was eligible for a government support scheme called the Self Employment Income Support Scheme. However I then had to declare all these figures on my tax returns which was even more boxes to tick.\n\nI also had to claim my fifth grant which means working out my turnover for the last two years etc. and freaking out that I'll somehow claim the wrong amount or screw something up.\n\nIt took me two weeks of staring at the folder to build up the courage and then about half an hour ago I finally hit that sweet spot of the anxiety of not doing it outweighing the anxiety of doing it (the grant deadline is September). So here I am just after midnight waiting for the anxiety adrenaline rush to die down so I can actually get some sleep.\n\nBut I did it! I just needed to share with someone as I'm really proud of myself."}
{"Reddit ID":"Anxiety_112","Reddit Post":"i want to go out on weekends and party but i have no friends. i'm a freshman in college, focused a lot on school and work for most of the semester, and i suddenly turn my head up and realize i haven't made any friends, and i spend all of my weekends and my free time alone, and sometimes i don't even talk to anyone for days--i don't even have pset groups or anything even though i go to office hours and all that. since i have some friends from high school here i've been to like three mit frat parties, and i always have fun on those nights, but those friends have kinda moved on from me to new groups and don't invite me to things. my roommates don't really go out and i'm not close to them anyway, and it really feels like everyone around me has good friends and goes out all the time. at this point i'd love to even have fake friends i can just party with because i'm really just so lonely. i've joined some clubs, but they're mostly work-based and i don't interact with anyone outside of meetings. and i have a lot of trouble reaching out to people or figuring out what to do if i were to reach out. i know it's really dumb, but i feel like a massive loser. any advice or reassurance or anything to make friends or even fake friends i can just party with or whatever would be appreciated bc i'm very lonely and sad thank u :)"}
{"Reddit ID":"Anxiety_113","Reddit Post":"I suffer from anxiety and depression and have been for many years. Because of this, I have a hard time making friends and staying connected with those I have. \nI can't go to parties, I have a hard time gathering the energy to speak to people, and it's hard hanging out with friends cause of the anxiety always being there in some way.\nThe problem is at the same time I don't want to be alone. Honestly idk what to do anymore..."}
{"Reddit ID":"Anxiety_114","Reddit Post":"Lately I notice I hate the outside more, my anxiety is on another level if I leave my house. I get pretty much anything delivered to the house food, groceries, meds, etc. to avoid going out. I work from home so I literally never have to leave home. When I finally talk myself into going somewhere all I think about is the millions of things that can happen\/harm me and I turn right back around. I haven't left my house in weeks. I feel like it's getting worse and I can't control it nor the anxiety\/depression that comes with it. Can anyone else relate?"}
{"Reddit ID":"Anxiety_115","Reddit Post":"Hi there, im M 19Yrs old, not diagnosed with anything, but i didnt know where else i could ask\n\nAnd i've wanted to ask how to deal with this thing i've been dealing with. Basically whenever i talk to people my mind is thinking whats right and whats not right to say and about like all of the outcomes what they might react and think im a weirdo or something, this happens during conversations with my friends and close people. Like i can type a message or something and half-way i think to myself, this is weird lemme write it again\n\nAny tips to deal with this?"}
{"Reddit ID":"Anxiety_116","Reddit Post":"Giving the dreaded Best Man speech in two days, I've been dreading it basically since the day I was asked to be the Best Man.  Now all sorts of thoughts are creeping in (how close do I hold the microphone to my mouth, how can I prevent my voice from shaking, how much to look at my sheet of paper vs looking at the audience).  I know that nobody at the wedding will remember my best man speech, and I know nobody is there for me.  But it doesn't matter to my brain, because several times per day I feel my stomach drop when I'm reminded of it by something on TV or elsewhere.  Anything anyone can say to try to ease my mind?  I'm sure 2 drinks or so beforehand will help a bit, but that's the only thing I'm optimistic about at the moment.  Wish I didn't obsess over something nobody cares about because I'm not going to enjoy anything until my speech is done with."}
{"Reddit ID":"Anxiety_117","Reddit Post":"About a month ago my pulse skyrocketed and my BP was high, went to the hospital and they found I had a kidney infection and that my vitals were high bc of the infection and anxiety (which I was previously diagnosed GAD, no medications). I am on meds to help my BP and pulse and I was doing well for 3+ weeks.\n\nNow any ache pain or discomfort I feel like I'm on high alert and it's driving me nuts bc all my tests came back fine. In addition to all these recent events my husband is switching jobs and we won't have insurance for 3 weeks in the transition which is making me more anxious considering all my recent medical and having to push my follow-up appointments another month.\n\nAdditional info: I tried Lexapro for my anxiety but had a terrible reaction. I was told magnesium helps but it's hard on the kidneys and considering my recent infection I want to wait a bit longer.\n\nDoes anyone have any suggestions or recommendations? TIA!!"}
{"Reddit ID":"Anxiety_118","Reddit Post":"My mom flies back home today and planes scare me so much. I've never been on a plane myself because of this, but everyone in my family has flown numerous times and every time they get on a plane I'm a nervous wreck until they land I can't even sleep"}
{"Reddit ID":"Anxiety_119","Reddit Post":"So I get anxiety often (almost everyday at this point) whether severe or mild but what I've noticed is that I'm beginning to experience physical symptoms.\n\nFor example I get heart palpitations which is one of the most common physical symptoms but my main worry is the occasional breathing difficulty episode.\n\nI'm unsure whether I have something wrong with my lungs like asthma or something else but most people I've talked to about it say it's my anxiety and I'm fine.\n\nHowever sometimes it's so bad I'm literally on the verge of dropping to the floor or fainting which also happened today where I felt as though I couldn't breathe properly and it also didn't feel like an anxiety attack because I wasn't really anxious apart from the fact I felt like I was about to faint.\n\nDoes anyone else get physical symptoms like that without feeling anxious?"}
{"Reddit ID":"Anxiety_120","Reddit Post":"For four days, my heart rate is rising far quicker and easier than it ever used to. \n\nI'll walk home and it'll be up at 140 bpm instead of my usual of 120. I can be sitting doing nothing or just stand up and it'll spike up to 120-140 rapidly and then come back down quickly a few minutes later.\n\nI have a history of heart problems in my family so I'm really worried (read terrified) that I'm going to die any day now and I'm only 25. My chest has been aching and it's hard to breathe but that could just be my anxiety. \n\nThe more I panic, the worse I make it but I can't stop panicking that somethings wrong and that I'm going to die. How am I supposed to know what's anxiety and what's a real issue? I don't know what I'm posting, I don't expect much, I just needed to tell someone."}
{"Reddit ID":"Anxiety_121","Reddit Post":"Why can't I ever relax and enjoy myself? I try have a couple drinks with friends and I get a feeling of guilt like I shouldn't be doing this and get anxiety like you should be sleeping it's past your bed time I just want to enjoy it I'm trying but my mind keeps going to you should go to bed"}
{"Reddit ID":"Anxiety_122","Reddit Post":"I've noticed recently that I have started smiling when i'm in anxious, scary, or uncomfortable situations and it's ironically making me more anxious. I used to not do this and now I suddenly am and it's making me feel like I'm going crazy. Any thoughts or advice?"}
{"Reddit ID":"Anxiety_123","Reddit Post":"I get super nervous whenever i go to my lessons ever since i had a panic attack in one, any tips for dealing with this? Ever since i had a panic attack in my lesson a few weeks ago i get super nervous going in, when i enter the building i just get so hot and sweaty, my heart beats real fast, my mind starts racing with horrible thoughts and start to feel kind of wobbly. \n\nIve been worrying about my heart alot since that panic attack and i try to ground myself with the fact i went to the doctors yesterday and he said my heart &amp; blood pressure were fine.\n\nAny tips for dealing with this anxiety around lessons?"}
{"Reddit ID":"Anxiety_124","Reddit Post":"Has anyone had these lexapro withdrawal symptoms? Hello, please if anyone can answer it will be very helpful. My dr prescribed me lexapro, i took it for a month, before I ran out of the 30 day supply for some reason the costs for the meds went up, and I was having bad side effects anyways so I stopped taking it and yes my dr knows. He said I would be okay. I have PTSD and have taken other antidepressants but never experienced this. \n\nI stopped taking them last week on Tuesday. 4 days ago (monday), i started to get very tired and dizzy in the evening. Tuesday\/Wednesday i could feel my heart beat heavily throughout my body, and I cried a lot. Yesterday (thursday) those heartbeat sensations were so strong it was almost like a shock. If I talked, moved, walked around it would hit me so hard. Ive been so dizzy, hot flashes, then I get super cold. Tonight my blood pressure was 169\/90, I do not have high blood pressure. I am not feeling well at all, has anyone else experienced this?\n\nI am sorry if I seem all over the place, I am trying my best to explain, i do not feel well. \n\nThank you in advance"}
{"Reddit ID":"Anxiety_128","Reddit Post":"Need some support after being bullied. Just to give everyone a clear picture I am an adult I am not a teenager who is getting bullied. Which is pretty embarrassing but it is the facts. A very bitter jealous person I'm pretty sure it's spreading lies and has even resorted to going to a place that I frequently go to in writing negative online reviews specifically about me. Google refuses to take them down.\n\nI had originally set out to write about it on here but then I realized That being vague about it was really hard to do And if anyone involved in the situation saw this it would just make more trouble for me.\n\nSo I don't often request this anymore, But is anyone willing to listen to my story on direct message?"}
{"Reddit ID":"Anxiety_130","Reddit Post":"I don't know if this is normal, sometimes I start insulting myself in unconsciously. It's like it wasn't even me it's so annoying. For awhile now I've been kind of out of it, like my thoughts start racing out of nowhere and I get stressed out. I have ADHD so I've always had trouble focusing. Also my dreams have been weird and vivid, sometimes I'll hear voices in my head before I fall asleep, tbh I don't really know what they say they're just like video game characters and stuff lol. I also used to have really bad sleep paralysis where I saw and heard a lot of weird stuff. But I think hallucinations while your not fully awake are somewhat normal? I was eating smth and I heard \"schizo\" idk why I thought that when I don't even use that word. Maybe because I'm subconsciously worried about having it or smth more serious even though IK I don't. and Ik this sounds stupid but I don't know who to tell. Btw when I say \"I heard\" I just mean I thought it without realizing ig. Like I'm aware it's just in my head it's not an auditory hallucination or smth. Thanks for reading all this. How do I clear my mind when this happens? \n\nTDLR: I've been stressed out lately, what do you do to clear your mind when you can't calm down?"}
{"Reddit ID":"Anxiety_131","Reddit Post":"How do I deal with this? I'm a person with extreme anxiety and I'm planning on dropping out of school to self study instead since I enjoy the comfort of my own home more rather than the school setting and my school is currently making the whole situation even worse and much more stressful trying to force and convince me to stay in school when I've already made up my decision. I was thinking of maybe listening to my school to go back and finish my studies but then my friend told me that my teacher blurred out my personal business to my entire class and told them to try and \"stop\" me from leaving school as it won't benefit me in the future to drop out and I'm literally on the verge of tears by how embarrassed I am right now and I definitely cannot go back to school now as I'd most definitely have an anxiety attack. How do I calm down? I feel so anxious right now like my head is racing with terrible thoughts...I feel scared to even step foot outside"}
