{"Reddit ID":"o6lpwn","Reddit Post":"I dont even know how to speak of this grief. I have read of many stories of people losing their loved ones, but it didnt happen to my family until today. I lost my uncle who is my best friend, we lived abroad all our lives but because of the pandemic I returned home, and barely managed to see him those 2 years. He was the kindest and purest human being. I met him briefly yesterday as we took him to the hospital. Today he passed away from COVID, he was deathly afraid from needles and the vaccination. I feel so so powerless. So guilty I didnt reply to his phone call 3 days earlier as my family was also sick of Covid and I was caring for them. The death feels like it could have been avoided, he took the remaining precautions but it didnt work. At least he died happy alongside his family in his hometown where I live. I dont know what or how to live life without him in my mind, without meeting him ever again, with seeing the same places without him. Im tired, I want to cry. We both hated living at home now I am stuck living on earth without him, I feel this home is the right place for me - was waiting eagerly for him to return. But he barely lasted a week before his death. But mentally I am exhausted of living here, of the pandemic, of having my friends all abroad and getting out of contact, of being alone to face his death. To face this life. Life feels so tasteless."}
{"Reddit ID":"o77vmk","Reddit Post":"I'm being vague as to not give away my employer but I'm frustrated and wondering how you're coping with being one of the only fields in CA that will be stuck in the past with no end date in sight. I have a lot of various traumas from this, as I'm sure many do, and being left out as the rest of my (all vaccinated, myself included) family gets to finally unmask at work is definitely not helping my mental state."}
{"Reddit ID":"o78h66","Reddit Post":"My mental health was never great before the pandemic but I felt more grounded. Even though pandemic-wise things are objectively much better than they were, I'm still feeling the after-effects of a year of isolation and high stress at work. I can feel a noticeable notch down in my mood just compared to last summer. I feel dead inside and doing anything requires a huge amount of energy. I feel sad all the time, I cry more. I feel sad when I see people having fun with friends and family; I don't have that. My family isn't great and I have no contact with them. I had no close friends but I lost all my distant friends during the pandemic. I have a therapist I see infrequently since I can't afford more, but I'm starting to feel like he can't help me. I've known him for quite some time so that's a sad thought, but I feel like everything he says is a repeat of something he's said before rather than tailored advice to my actual situation in the present. We all repeat ourselves to some extent. I probably need a fresh perspective, I don't know. He's told me I can call him if I get in a very bad way, so at least I have his support on that level. I don't expect any advice or solution to this. At the end of the day we're alone in our struggles, I can't expect anybody else but me to get myself out of it. But I feel like sharing it to somebody."}
{"Reddit ID":"o7buf0","Reddit Post":"I am visiting family this week. All of my family members who are eligible for the vaccine, including myself. have gotten vaccinated. The only people who arent are my niece and nephew, because they are only 4 and 1 years old. I wanted to see an old friend from high school, but I found out that this friend did not get vaccinated. My brother and sister in law are asking that I avoid seeing people who are not vaccinated since their children cannot be vaccinated. Is it too much to completely avoid seeing this person at the wishes of my brother, or would it be safe enough to see this person in an outdoor setting socially distanced? I know this is a stupid question, but Im curious what you all would do."}
{"Reddit ID":"o7fa6u","Reddit Post":"I have hashimotos disease, diagnosed when I was 17, now 24. Every health professional that Ive seen regarding it hasnt seemed to think its that much of a big deal as Im medicated and blood work looks fine, but I will be on meds for it for the rest of my life. I dont trust what these health professionals are telling me because they all seem to have different opinions and some have willingly admitted that they dont know enough about autoimmune diseases. Ive been told that Im not at any greater risk of getting covid because of my disease, but have read differently. Im concerned about getting the vaccine because Ive heard from another doctor that its linked to autoimmune responses, but I cant find much online about the matter and Im afraid that if I dont get the vaccine, Ill be putting myself at greater risk. However, Im also afraid that the vaccine will cause further autoimmune problems, as the disease I already have is already a lot to deal with especially when I cant find a health professional that knows enough about it to help me. Im hoping someone here might be able to drop some knowledge?"}
{"Reddit ID":"o7hz16","Reddit Post":"My country is in a third wave. Its never ending. Im sure this post will get removed because Im too depressed\/depressing for Reddit. Im broke because of the pandemic. Im struggling to work because my anxiety gives me physical symptoms. My friends dont talk to me anymore, or when I do talk to them they just tell me to see a therapist even though I already do (and can barely afford it). Im thinking about stopping eating so I can afford therapy. Theres no point to any of this. Every death that is about to happen here could have been prevented, and no one cares and they call me crazy. Im tired of the endless hurt."}
{"Reddit ID":"o7lkru","Reddit Post":"Recently, the Israeli government reinstituted its indoor mask mandate after about 300 Israelis were diagnosed with COVID-19. As a result, many people are fearing that COVID-19 restrictions will be constantly looming over us for the rest of human history, persistently drifting in and out of our lives. I'd like to explain why these fears simply are not rational. Despite what some say, Israel has not achieved herd immunity. They are very close, of course, but they are not at that milestone *yet.* About 5,160,000 Israelis are fully vaccinated, equivalent to roughly 56% of the Israeli population is fully vaccinated. Add that to all the Israelis who have attained natural immunity from the virus, and the percentage rate of immunity within Israel arrives at roughly 66%. For a group to have herd immunity to COVID-19, 70% must be immune. Because Israel has yet to achieve herd immunity, it is still possible for an outbreak to take place. Even with this in mind, the outbreak Israel has been facing is minuscule compared to the size of outbreaks at any point in 2020. Additionally, many of the people infected are kids, of whom the Israeli medical establishment has only vaccinated a small amount."}
{"Reddit ID":"o7mhi6","Reddit Post":"I've recently heard of stories that people who are getting mildly sick after being vaccinated are still coming down with long covid. People on the covid long hauler subreddit are saying that we're going to have a huge problem on our hands because no vaccine protects against long covid....This isn't going to end, isn't it? Right as I think I've tasted freedom, I find out information that makes me want to stay inside forever like a hermit..."}
{"Reddit ID":"o7o9ll","Reddit Post":"israel imposed their mask mandate, despite being one of the most vaccinated countries. i feel like this will never end and I don't need stupid replies like \"hang in there\" or \"it will be okay.\" and don't remove this post because it \"causes anxiety.\" I'm not. I'm simply worried that we'll never get back to normal."}
{"Reddit ID":"o7riyw","Reddit Post":"Hello, I am about 19 and it's been about 2 days since I got my 1st dose of Pfizer vaccine. As of now, I'm only having muscle pains and aches, mostly in my arms and legs. In the news, I'm seeing all these articles and videos about how the Pfizer and Moderna are causing heart problems in males under 30. My gut feeling is telling me to avoid getting the 2nd shot, but I have a feeling I should still get it. I just don't wanna end up in the hospital. Healthcare in the US is quite pricey. Any advice? Thanks.."}
{"Reddit ID":"o7saf3","Reddit Post":"There hasnt been a spike of cases the last few weeks in my area (yet at least) since the masks were lifted and things are starting to open up. Restaurants in my area have been open since summer 2020 anyway with restrictions, but the movie theatre just opened and that used to be my favorite activity pre pandemic. Should I wait to see how this delta variant plays out the next coming weeks? Im fully vaxed and have been itching to go out again but Im still wary."}
{"Reddit ID":"o7wv0a","Reddit Post":"This makes me really just not want to go out and about again.... I've been on this sub for a while and posted a lot. More or less this pandemic has crushed my mental health and with having some health issues makes me really hesitant to do anything. I was finally getting my life back a little and this Delta variant makes me want to go back to old habits and just stay home and see no one... I really am at a loss of what to do and am feeling super overwhelmed."}
{"Reddit ID":"o7y52c","Reddit Post":"The following has been my experience: Started showing Covid symptoms at the beginning of May 2021. They lasted about two and a half weeks. After the third and a half week or so, I felt well enough to put in a full workout. I did so, and 48 hours later, my Covid symptoms had returned in pretty much full force. I've read about different forms \"long Covid\" takes - it's not always persistent - some report reinfection or reactivation of Covid after periods of dormancy. Two weeks after my initial reactivation, my symptoms begin to subside. I decide to get the first Covid vaccine (I read that in some \"vaccine vanguard\" countries like Israel, they were recommending one covid shot for those who had already had the virus). I get the first shot, and feel a little not great for about 48 hours or so (mild discomfort in lymph nodes, some fatigue, weakness), but afterwards I begin to feel great, better than I had at any point since before I got Covid in early May. A week ago I put in a full exercise. About 24 hours later, I don't feel like I felt when I had Covid, but I definitely feel the exact same as I did *after* I had gotten my first shot - mild discomfort in lymph nodes, some weakness. I am under the impression working out a second time \"reactivated\" dormant Covid, but the vaccine kicked back in and enlisted my immune system in fighting this second activation. Finding information about the virus at this time has been so frustrating - official counsel has lagged internet anecdotes and similar by a considerable amount of time. Does what I describe track with anyone's experience? I wonder for how long I'll be unable to exercise without precipitating unwanted flare-ups of Covid symptoms or Covid vaccine side effects."}
{"Reddit ID":"o7ynd1","Reddit Post":"I have been fully vaccinated for 2 months now and i wanna go visit my family who got their second dose last saturday. Will i be okay if i go now or should i wait for the 2 weeks so they are fully vaccinated. Will it be significantly less safe if i go now?"}
{"Reddit ID":"o81ejk","Reddit Post":"The WHO has just stated that masks will have to be reinstated. That really annoyed me. It's enough to make me believe that these restrictions are going to have to be forever and that we should say goodbye to EVER getting our lives back. I would hate for that to be the case, but honestly, this is VERY discouraging, especially considering how much work we've done. And all because of the Delta Variant."}
{"Reddit ID":"o81gva","Reddit Post":"While some states have been doing great about getting vaccinated, there are some stubborn anti-vaxxers who are choosing to say no, and unfortunately it's because of those people that the pandemic is still in effect here in America. I had hoped that they would wise up by now and realize it's mandatory to take the vaccine, but their stubbornness frustrates me. It's enough to make me believe the pandemic will last forever. Of course, rationally speaking it isn't true, but it IS hard to keep being hopeful."}
{"Reddit ID":"o81v0l","Reddit Post":"Lately, I keep trying to distract myself and have been trying to go out, but honestly I just find myself worrying that things are going to be like this forever. I hate everything from taking classes online to working from home. I sometimes feel like I am just not handling anything well at all, and keep wondering what even is the point to anything anymore."}
{"Reddit ID":"o82alq","Reddit Post":"I have a question about the delta variant. Ive been hearing people that Pfizer and astra vaccines are effective against the delta variant. I just want to know because I got Moderna and it concerns me and my family health. We are ready for wave 2 but why people dont just vaccinate up to have at least a safety net."}
{"Reddit ID":"o88fni","Reddit Post":"this morning I had my 2nd dose shot. finally, I'm glad I am fully vaccinated now and that I will reach full protection in about two weeks. but idk, it feels like it barely changes anything. I was waiting for this so long, and now I'm just... mildly disappointed. right now situation in my country is more or less okay, but I am still WFH, and my office sent us official info that we can start coming back to the office only since September. so I'm still gonna be stuck at home over the summer. then also I am worried that September return to the office won't happen because everyone is scaring is that we will have another wave in the autumn. so literally what is the point? the only consolation I have is that I am being responsible, and I'm not contributing to the situation potentially getting worse again. I want to feel happier about it or more relieved. tbh I have no energy for this anymore. cool now I can rot in depression inside my apartment while being fully vaccinated."}
{"Reddit ID":"o8acpj","Reddit Post":"So the Vaccine team in Iceland is taking a summer holiday for a month that extends over the time when I was suppose to get my second Astra Zeneca shot. They offered me to get it sooner but I heard it will decrease it's effectiveness by allot. Should I get the shot 7 weeks after my first shot or should I wait until they come back and get it at least 15 weeks after after my first shot. Iceland has stopped all restrictions so i am a bit nervous."}
{"Reddit ID":"o8c2bk","Reddit Post":"I am fully vaccinated with the Moderna shot, and have been getting back to my regular life. I live in a state (MA) with extremely high vaccination rates, but nonetheless Im concerned about the Delta variant. Ive been hearing stories of breakthroughs of the variant in fully vaccinated people, so I am concerned. At the same time, Im extremely tired of this. I feel selfish for saying this, Ive done all I can do to protect myself and others against COVID, and I want to continue to live my life after over a year of taking precautions. Anyone else feel the same?"}
{"Reddit ID":"o8diwt","Reddit Post":"It finally happened. Took an older relative for her first Pfizer dose. Not that many people showed up so all accompanying family members were offered the shot and give papers for a second dose. I wasnt due to get my shot for the next couple of months and have had some scares, many for which Ive gotten support from you lovely awesome people. I now have a whole different perspective on my governments organization. They have a good oiled vaccination machine. They just need more doses. Best part is I was told I could come back for my second dose whenever my relative was scheduled to get Hers. I have a lil arm pain. But its the slightest arm pain when moving it past certain angles. Ive noticed that a lil blood drop shows on my vaccination spot (took a shower half an hour later). Is this normal?"}
{"Reddit ID":"o8dnrz","Reddit Post":"I had figured that once we are vaccinated we would no longer have to do any of that. So far the CDC hasn't gone back on its masking and\/or social distancing requirements for vaccinated individuals, but after the WHO said I do feel very, very worried and discouraged. I had hoped that the vaccine would mean we would have to stop doing that, but the Delta Variant would probably mean that we have to do so forever no matter what. I hope I'm wrong, because I don't want this to be the reality."}
{"Reddit ID":"o8ejot","Reddit Post":"I have been realizing that I've been spiraling out of control lately on account of the Delta Variant reports, particularly the WHO message. As of right now we have not been seeing many case increases here in the US. The occasional rise, but so far it hasn't been huge. That's why I feel I should take time off from looking at the updates of teh Delta Variant. The fact that we are still making progress with vaccination should remind myself that we are still on the path to beating the pandemic and that these restrictions are soon going to be gone. THAT'S the motivation I should have. Yes, we still have to be vigilant and yes, we DO have more to vaccinate, but things are just so much better now than before. And for that, I personally think we should stay hopeful, not fearful. This is probably the best I can give to others who feel similar worries."}
{"Reddit ID":"o8h470","Reddit Post":"So uhm, has anyone in a non-North American country lived through the Delta variant outbreak yet? Im in South Africa and Im horrified at whats happening. Were about to face the worst wave yet. Hospital beds are already over-demanded, and well, Im terrified, seeing as weve had a massively inefficient vaccine rollout which just so happens to have widely employed the one vaccine that provides less protection (being the J&amp;J). For anyone who reminded me two days ago not to be depressed, dont worry, I spoke to my therapist and then this shit happened. I rarely see people anymore, but Im petrified. Ive had a couple small interactions and people arent being careful. Theyve given up. Id go full hermit but my partner is required to go to work in person some days of the week. Im breaking inside. Has anyone come through this? What will happe"}
{"Reddit ID":"o8irlm","Reddit Post":"Im home from campus for the summer and plan to take a semester off, and the longer Ive been staying home the more Ive been concerned about my parents not getting vaccinated. No matter what I try (studies, articles, anecdotes) they wont listen and are too petrified to get it. Now Im gripped with the fear that they will get delta. My mother has many health issues already that makes her risk of suffering long-term\/permanent damage from COVID higher. The thing is if something happens Im the only one around to bear the responsibility. I will have to find a way to help keep my mothers business afloat, tend to my parents and keep myself safe."}
{"Reddit ID":"o8mm93","Reddit Post":"Hey folks, I got my second Moderna vaccine two days ago. The second jab has some pretty intense side effects. So much so that I took Tylenol (acetaminophen \/paracetamol) pretty much twice a day. Today I started feeling vertigo and nausea, I took Gravol. I just read that taking pain killers can dampen the immune response. I hope I haven't been hindering mine. Should I be concerned?"}
{"Reddit ID":"o8xmz9","Reddit Post":"Disclaimer Im NOT anti vax. I take all required vaccines and the HPV one too. However there are 2 cases of deaths because of the Astra Zeneca in my city alone, despite there are only approximately 1000 people getting the vaccines in my city. There are less than 100 deaths in my country, so I feel like the chances of the vaccines effect is higher than deaths from covid. I really want to take the vaccines but extremely concerned about this. Its been giving me anxiety for days. Dont know what to do anymore"}
{"Reddit ID":"o92e6y","Reddit Post":"I've been living life pretty much normally since the CDC said you could stop wearing masks if vaccinated. I was fully vaccinated in March and have been going about my life like normal, seeing friends, going to work, etc. Now that the WHO is recommending masks again I don't know what to do. I have a birthday party scheduled for July, should I cancel? I don't think I will survive another year of isolation. Please don't say that there won't be lockdowns enacted. Frankly it doesn't matter - if I can die just because I went outside I'll be isolated no matter what the government says. I'm afraid that my work will push us more in person and I'll send up not being able to do anything I enjoy but still terrified because I have to go to work in person. What's the point of living like that?"}
{"Reddit ID":"o93rqd","Reddit Post":"Hey, everyone, just in a particularly dark patch, and feeling the need for some dialogue. I've been doing a lot of thinking, lately, and I think I've finally got a handle on why the pandemic has been so chronically stressful for me, and others, over the past year. Specifically those in first world countries, in relation to how it affects us on a psychological level. As people, we tend to experience bad things as happening suddenly, all at once, and then you deal with them. A broken leg, a car wreak, getting fired, getting dumped, etc. Deeply unpleasant, but relatively short-duration things. These are type-1 and type-2 problems; Things which can be avoided, or which can be fixed. But the Coronavirus has loaded us all down with the third type of problem. The kind that just needs to be coped with, and waited out, against which you can do basically nothing except endure. And... we are really, really bad at just holding tight and doing nothing. Especially since the pandemic has stripped us of most of our usual coping mechanisms. Our comfortable distractions, eating out with friends, seeing a movie, big events and holidays to look forward to. That's been the truly soul-crushing part. Lots of us weren't doing too great before the pandemic hit, but then, after 15 months of slow, grinding lockdowns, endless bad news on top of bad news, and nowhere to go to get away from it... Is it really a wonder why everyone is so unhappy all the time? I feel like a machine that's trying harder and harder to run without lubricant, to the point that it's just scraping metal-on-metal, and every day is a bit harder than the last. I'm not sure how much longer I'll be able to keep this up. The possibility of a variant wave in the Fall, forcing us back into yet another lockdown, terrifies me. I can't relax, I can't focus, and it's been seven or eight months since I've had any meaningful hope for the future. This late in the game, I just... can't shake the feeling that things will never get better. 2019 was the best things will ever be in my lifetime, and it's all downhill from here."}
{"Reddit ID":"o979a8","Reddit Post":"Cases are low in New Hampshire but still. I've been doing hybrid learning for the entire 2020\/2021 school year. I'm now on a two month summer break before September where I can go 100% in-person. I missed out on a year and a half of my high school experience. Now I'm so freakin worried that I might have to miss another year because this fucking Delta variant could evade some vaccines. I want to eat in a crowded cafeteria, study for exams, participate in clubs, all I ever wanted to do but couldn't because of this pandemic. Now that things seem to be getting better but Delta might ruin it."}
{"Reddit ID":"o97n26","Reddit Post":"To be clear, I 100% support getting vaccinated. My side effects are mild compared to what Covid long-haulers go through. I don't regret getting that first shot at all. I decided not to get the second shot with my doctor's support, because I've been so unwell that they say my body needs a break. I was hospitalized for a rapid heartbeat and chest pain 2 weeks ago which I was told is pleurisy. The pain has only gotten worse, but the doctor told me that it will eventually go away. I can't drive anymore because I don't have the strength in my arms to navigate the steering wheel. I can't even pick up a water glass with one hand. I sleep 3 or 4 hours a nite because the pain keeps waking me up. I made the tough decision today to withdraw from school this term because I just feel so delirious a lot of the time now that my brain can't do it. These physical and mental effects are just making me feel pretty bummed out and sad. I know that I'm lucky to not have it as bad as many other people during these Covid times. But I feel really alone in this, as everyone around me is getting vaccinated and going out and enjoying life, right as I'm getting so sick and homebound. I have faith that this will get better, I'm just having a hard time accepting that I need to put my life on hold until it does. Support, kind words, anything, much appreciated. And to add again - please get vaccinated! My experience is very rare and everyone I know had minimal side effects, if any. That's part of what's making me feel so alone in this!"}
{"Reddit ID":"o9ccpt","Reddit Post":"there are a bunch of things that i dont feel comfortable doing yet even though i am vaccinated and people act like thats not valid. It so exhausting to say no to a bar or traveling and having to explain yourself all over again. Its like a lot of the people around me think that the pandemic is over. Right now a friend from another country wants to come visit and i know that i dont feel comfortable and i have to tell them that, but its something i shouldnt have to say. We are in a pandemic, there is a new variant. i am grateful i am able to do the normal day to day things again, why do people feel the need to over do it?"}
{"Reddit ID":"o9nwg0","Reddit Post":"I want to clarify that I am in no way shape an anti masker, I believe we do need them during the pandemic and any future outbreaks. However, the masks are a nightmare for me personally. They trigger off my migraines, I could hardly concentrate at school because of it. I also have a sensory disability, which makes wearing masks 10 times harder. Everything is brighter, louder, and everything feels more crowded when I wear them. Its horrible. And it looks like we have to wear them for the next school year, and its my final year. I cant risk it. So I want to know if any you know where I can get masks that are migraine\/sensory friendly? While still doing the job a normal medical mask does. Thanks."}
{"Reddit ID":"o9ou7y","Reddit Post":"I have booked tickets with a friend to go to a concert some time in October at an indoor venue. My friend is planning to get vaccinated before the concert and I have been vaccinated for a few months now. My family has also been fully vaccinated. I'm just a little nervous since this will be indoors and might be crowded and I'm not sure about the mask policy at the venue. My state has not been very restrictive during COVID-19. I've been worrying especially with the Delta variant going around. I'm not sure if this would effect me even though I'm vaxxed."}
{"Reddit ID":"o9u2x4","Reddit Post":"I am feeling regret over taking AstraZeneca in late April over getting Pfizer at a later time (it was the one offered to me first). I feel as though I am being discriminated against for taking AstraZeneca. I know I did the right thing taking the first one offered to me, but it shouldnt matter as to what vaccine was offered or where that vaccine dose was manufactured (apparently certain countries in the EU arent accepting those individuals who have had AZ manufactured by the Serum Institute in India)."}
{"Reddit ID":"o9u86b","Reddit Post":"Today, the WHO said that even fully vaxxed people need to go back to masking and social distancing because of the Delta variant. Do they mean the still mostly unvaxxed world in general, and should we not worry if were in the US or another country with high vaccination rates? Also, heard some people dont trust the WHO anymore?"}
{"Reddit ID":"o9utmq","Reddit Post":"Hey all &amp;#x200B; I know its illogical but I worry that by the time October\/November hits that somehow covid will come roaring back with a vengence with a vaccine escaping variant. Im in Canada where almost everyone is getting their second dose in the next month (including myself) which I am happy about. But I guess as things (slowly) re open Im terrified that its going to be a repeat of last fall. &amp;#x200B; Granted I know we now have the vaccines and I trust the efficacy, but I know that last year the virus also retreated in the summer. Iguess what Im saying is I worry about getting my hopes up for a normal happy life moving forward without this coming up again. I personally cannot mentally survive another round of lockdowns and this going on forever and I fear for my mental health if it does come back."}
{"Reddit ID":"o9zzaw","Reddit Post":"So, L.A. Countys health department is advising everyone, regardless of vaccination status, to mask up indoors. I havent followed our metrics too closely out of concern for my anxiety and mental health, but I thought our vaccination rates were doing well. Im fully protected so I know on a personal level Im good. Im just wondering what this means on a larger scale, if someone could please help clear this up. Note: Im really not trying to be a doomer with this question, but if it does stir anything up, you can ask me to take it down."}
{"Reddit ID":"oa2x04","Reddit Post":"I feel like all I can do is just bash my head against the wall and pray something changes. Mostly metaphorically, a little bit literally. I've tried pouring my heart and soul into figuring things out but no matter how much I debunk it feels like there's always more shit that could come out. I feel like the only 'right' thing to do is ignore it and pretend I'm okay because anything else would be making things worse for the rest of my family. I know that she cares about me but I feel so fucking helpless. I hope full approval comes soon so that might convince her but I don't know how long that will be. I feel depressed and miserable. Covid itself was bearable enough but my own mom being lied to and deceived with this shit makes me wish I didn't have to live through this. If I could've spent two years in a coma and missed all of this I'd probably be happier overall. I don't know what I could say or what to do to get her to understand. I feel like I'm breaking down."}
{"Reddit ID":"oa8vr7","Reddit Post":"I know this isn't the same situation as with the Covid vaccines but it gives me the same vibe when I read that someone doesn't want to take the vaccine. Watch for yourself: [url] (This is meant to cheer people up, I apologize if this isn't the right place to post this.)"}
{"Reddit ID":"oaciif","Reddit Post":"So I started going to the gym recently. Ive been fully vaxxed with the Pfizer vaccine since March but I still try and mask up whenever Im indoors with a large crowd (stores, gyms, work, etc) Ive tried masking up in a gym but I sweat so much that my masks become drench thus causing me problems breathing that I need to pull it down so often just so I can breath properly. Does anybody what my risk of catching it would be? More specifically the Delta variant? My wife is also vaccinated but we have a beautiful 2 year old boy that we dont ever wanna bring the virus home too. I am aware that the younger children barely get any symptoms and do ok but I just dont want him to ever have the virus period."}
{"Reddit ID":"oadxvr","Reddit Post":"I'm on here a lot for support, so thought I'd offer some to anyone else that needs it! I've been seeing articles as of the last few days that show the MRNA vaccines could have very very long protection which is a great thing!! So anyone feeling hopeless today, please keep your chin up!"}
{"Reddit ID":"oaog1p","Reddit Post":"I cant get my mind onboard with buying my daughter fresh produce!! I just want to reach into the fridge, take out a pint of blueberries, squish them flat so theyre safe, and let my 15 month old toddler have some! My mom-brain is still on high-alert, and I cant get it to calm down about groceries being safe to handle. I cant wait to get her vaccinated. Help me find my sanity. :("}
{"Reddit ID":"oapoew","Reddit Post":"Today LA county just recommended vaccinated people wear masks again indoors. It's not a mandate but nonetheless it's kind of discouraging too hear 2 weeks after the mask mandate in California was lifted. My mental health has been getting a lot better now that all restrictions are gone in California. And wearing a mask just doesn't feel natural anymore and I can breathe a lot easier without one. In the part of California I'm in they haven't been telling vaccinated people too start wearing masks again, but generally the sf bay area has been more cautious than LA throughout the pandemic, which means they could reintroduce recommendations or worse mandates in my area"}
{"Reddit ID":"ob46j9","Reddit Post":"Looking for some opinions. My son (15) had covid in May (started showing symptoms May 1). We WILL get him vaccinated, but I've been told to hold off, as he could have severe side effects if too soon. But I've also heard it all: do it right away, wait ninety days, wait six months to a year. With Delta now a problem, I want to do it soon. I signed him up to get his first jab on July 9 because I want him fully vaccinated before a trip in August, but I'm nervous about it. Anyone been vaccinated shortly after covid or have any advice? Thanks!"}
{"Reddit ID":"ob56j0","Reddit Post":"I have received my first dose of AstraZeneca vaccine a month back and it is time for second dose. However I am currently in United States where there is no AZ vaccine available. What are my options? Is it okay to take Pfizer or Moderna as the second dose? I know that Canada and EU are mixing the vaccines with good results(Merkel took second dose of Moderna after first dose of AZ). What is the guidance in United States? Do I need a doctor's prescription for mixed vaccination? Would I considered vaccinated after a different second dose? Any pointers\/guidance would be very helpful."}
{"Reddit ID":"obu9qi","Reddit Post":"Czechia, the mess of a country, that became known as #bestincovid. We managed to handle the really nasty fourth wave my rigorous testing and enforcing FFP2 masks pretty much everywhere... until government has done away with that. Mask mandates lifted in schools. No more mandatory testing at work place. Govt. now pays testing sites less. Yeah, there is an election coming up in October, so the populists decided to implement populist measures. The worst thing? About 15% of my fellowcitizens vote for parties whose leaders believe in nanochips in vaccines, chemtrails and \"doctors are killing people on purpose\". I am among the 30% of fully vaccinated people and I am not ready for ending up in lockdown because of people who will not take the vaccine, because they are worried about Bill Gates' nanochips or feel it is some sort of rebelion. Today a big upset about Croatia not letting unvaccinated and untested people in. Not the fact we are entering fifth wave. Apparently vaccationing on shitty concrete beach is more important (not staying all Croatia sucks, it's just Czechs manage to find the most unappealing places in any country to flock there. Same with Bibione, Italy.) It just seems we will not get out of the mess. Too many people are far gone. Today some idiot attacked one of our epidemiologists, because they did not like hearing what the guy had to say (that we are in for bad times). 30 000 dead in fucking tiny ass 10 milion country. And yet, many think it's nothing."}
{"Reddit ID":"obufss","Reddit Post":"Hi Folks, Hope y'all have been doing well. I'm from Germany, and I'm well, pretty worried about Delta Variant. I (22f) got my first shot of Biontech last week and so did my sister. My mom is fully vaccinated with Moderna. My stepdad received his first shot of Biontech two days ago. But we also have two kids (age 5 and 3) in our family. Obviously they can't get vaccinated. Hearing that Delta is very transmissible, and often even infects vaccinated folk, scares me. I know efficiency of the vaccines was never 100% but I believed at least we'd be safe from Covid when we get vaccinated. I work full-time and go to school. At school, everyone wears a mask, we are 1,5m apart, the windows are open and everyone gets tested daily. At work, my coworker wears a mask and so do I. When I eat or drink I go outside. Otherwise, I don't take off my mask at all (I wear FFP2 or FFP3). My boss doesn't wear a mask but he only occasionally comes into our office. Also, everyone at my work place had Corona three months ago except me. They caught Alpha (B117). I also have to take public transit. Everyone wears masks. Windows are open. How big is my risk of infection? I have been getting regularly tested since March 21 (1 to 4 times a week) and it came back negative all the time, even when we had a high national incidence and infection was more likely. National incidence is now 5 cases per 100.000 people. In my town it is 3 cases per 100.000 people. At the moment, we have 49 active cases (my town is huge; 500.000 people live here). Do I really have to be worried? I even wear my ffp2 mask when I walk my dog. When I am fully vaccinated, what safety measures should I still follow? I don't mind masks at all, but I'd like to wear makeup someday again lol."}
{"Reddit ID":"obvn4z","Reddit Post":"The bad news sometimes feels non-ending, is it just me or has been this bad since April? Haven't been able to recover since then and I'm just tired, depressed and scared. Even this subreddit sometimes feels too negative. How do I get out ... it's almost 3 months of constant red in my mood calender, it was bad but never this bad."}
{"Reddit ID":"oby0ig","Reddit Post":"From New Hampshire, USA. So basically there was this \"construction technology\" course in high school available for ONLY grades 9 and 10. Basically, it's fun and cool stuff like woodshop, building electronics, etc. So I signed up for that class for both Grade 9 and 10. Well, since my school has a semester system I got this course in Semester 2, which amazingly began at the beginning of March 2020. So boom, couldn't do this course. Then in Grade 10 we had this \"hybrid\" model of learning, some days virtual education some days in-person education. Well, due to my school being concerned about the tools having germs on them, the course was cancelled. Now, as of September 2021, I'm in Grade 11. I amazingly had this course at the exact wrong time. I contacted my school to allow me to take this course this year but they didn't make an exception. Oh well :( What did COVID steal from you?"}
{"Reddit ID":"obzgsr","Reddit Post":"From New Hampshire, USA. So basically there was this \"construction technology\" course in high school available for ONLY grades 9 and 10. Basically, it's fun and cool stuff like woodshop, building electronics, etc. So I signed up for that class for both Grade 9 and 10. Well, since my school has a semester system I got this course in Semester 2, which amazingly began at the beginning of March 2020. So boom, couldn't do this course. Then in Grade 10 we had this \"hybrid\" model of learning, some days virtual education some days in-person education. Well, due to my school being concerned about the tools having germs on them, the course was cancelled. Now, as of September 2021, I'm in Grade 11. I amazingly had this course at the exact wrong time. I contacted my school to allow me to take this course this year but they didn't make an exception. Oh well :("}
{"Reddit ID":"oc4pn0","Reddit Post":"Hello everybody. I live in EU (Germany) and we're doing good right now. Many restrictions are lifted, vaccination tempo is quite fast. However, I've read a couple of articles about how the fourth wave may come (mainly because of the Delta variant and UEFA cup), about the spike of cases in the UK, etc. Is it just another pathetic attempt of fearmongering, which media can't catch a break from, or should I really be worried about another lockdown coming in fall? This winter was absolutely terrible and miserable and I'd rather enter the cage full of rabid hungry dogs that go through it again tbh."}
{"Reddit ID":"oc8anu","Reddit Post":"Im in the US and even though I am very lucky to be fully vaxxed and Ive been seeing my friends and doing normal things (which has been great) Im always nervous about another surge happening because of all this news on the delta variant and Im seeing things of people on here saying it could be a repeat of 2020. Im more nervous about the restrictions that come with these surges and that if a big surge happens colleges will switch to online learning which i really dont want to happen since I miss my friends in my college state. I was feeling so much better mentally weeks ago and felt super optimistic because of low numbers and I feel like this delta variant has just put a wrench in that. I know that since Im fully vaccinated I dont need to worry a whole lot about it but I just dont want to see a repeat of 100,000 cases a day and different restrictions. I just want these variants to stop because it seems like everytime Im semi happy a new one makes a surprise and turns out to be more contagious. Anyways thanks for reading this rant"}
{"Reddit ID":"ocbsgl","Reddit Post":"I've been hearing about reports of a covid variant called Delta running amuck. How likely will it put things back to square one? Will I be put in another lockdown and forced to wear a mask again? I'm a fully vaccinated young male with no risk factors. My parents are in their 40's, fully vaxxed, and also have no risk factors."}
{"Reddit ID":"oci6q6","Reddit Post":"So my 4 yr old has a runny nose and slight cough and nothing else. He's in daycare so we went for a test and this was not his first test. I was so afraid that he wouldn't go in the building but the sticker and candy they offered was too hard for him to resist. The stress of having to do this makes me want to never have to get either of my kids tested again but I don't think that's the reality. I came home and cried. I'm not sure how I'm going to handle this kind of situation in the fall when they're both at school. It makes me so sad."}
{"Reddit ID":"ocitt9","Reddit Post":"I'm from Ontario, Canada. [Our Premier]([url] (equivalent to governor) is the type of person who may put everyone back to lockdown in the Fall. If cases are slightly higher. But hospitalizations and deaths are at single digits. He'll still do it. The problem is that the Chief Medical Officer of Ontario is keep looking at case numbers rather than hospitalizations. I'm scared we may have to go through another lockdown because of this misconception."}
{"Reddit ID":"ocnii0","Reddit Post":"Hi! I had my first dose (Pfizer) a little over a month ago and I'd like to get my 2nd shot a bit sooner than what is scheduled. However most are Moderna now. I've heard that these vaccines are the same type so would it be ok for my 2nd shot to be Moderna?"}
{"Reddit ID":"ocnv0g","Reddit Post":"He was picking something up from me and forgot his mask. I was surprised and did not want to hurt his feeling as we rarely see each other. He was about 5 feet away for about a minute before I moved past him to 5 or 6 feet away. We talked about 4 or 5 minutes total outside. I was wearing a surgical mask. We are both fully vaccinated with Moderna for a while now. I'm from new jersey, and my mother says it is ok for vaccinated people not to wear masks, but I'm still anxious about this because of the Delta variant."}
{"Reddit ID":"octae1","Reddit Post":"Since the pandemic began I have been placing items in a designated quarantine area. 24 hours for paper products and groceries that do not need to be refrigerated\/frozen 72 hours for metals, plastics, glass. For items that need refrigeration or are too big to fit in the quarantine area I wipe it down with disinfectant. I was recently mentioning this to a friend who told me that this was overkill since apparently new research has shown it is not needed. Is this true? The friend also sides with the CDC over WHO regarding mask usage for vaccinated people so I'm apprehensive to listen to them. If there is research along these lines then I it saying it is not possible to spread through groceries\/deliveries or that it is simply a lower chance. If it matters, I'm fully vaccinated with Pfizer. But still nervous about delta strain and also still don't want to get any covid even if the shirt term effects are minimal due to the vaccine (if I understand correctly the long term effects of getting covid after the vaccine have not been confirmed)? Thanks in advance for the advice."}
{"Reddit ID":"od0i9v","Reddit Post":"If it's not the UK (my home country where my family are) that has a problem, it's Denmark (where I live). The UK is full of Delta and the borders are heavily restricted. 10 days of mandatory quarantine plus an expensive mandatory \"test package\" which I cannot afford. Very few countries are exempt from this, almost entirely small islands around the world. Meanwhile Denmark's infection numbers have doubled, yay European football events. So the hopes of ever getting on the UK's green list are smaller and smaller. I have since the start of this whole thing been worrying about loved ones. First my elderly grandparents for being high risk, then my best friend who had her baby very premature, then my mum was bedridden for months due to covid, and now my dad has cancer and has to have chemo. It has been almost a full year since I saw a single family member, more than a year for many of them. And not even a glimmer of hope. I am fully vaccinated even, and I am watching people here happy about losing restrictions, but I am so scared of losing someone after being away for so long and it's getting more and more overwhelming. I know nobody can say magic words to fix things, I just really needed to vent about how it's July 2021 and this is still ongoing for the foreseeable future."}
{"Reddit ID":"od4pk6","Reddit Post":"According to the NY Times this has happened. It's a shocking change of pace considering things were going so well with the vaccines. I guess the reason is because of the unvaccinated communites who are experiencing the Delta Variant. Luckily that does not seem to be happening here in NJ. Cases continue to be stable, and we have not seen any of the same kind of explosive growth. But I DO hope that those numbers do go back down again. I'd hate for us to go backwards."}
{"Reddit ID":"od6tgi","Reddit Post":"And now Im wondering what the changes are that I might have gotten COVID. I mean it was already foolish enough to go to a carnival on schrooms and trying to fix something that is probably unfixable anyway. But doing so unvaccinated (dont worry first one is is planned for next week) oh yea and I also managed to get in un tested"}
{"Reddit ID":"od9j5d","Reddit Post":"Does anyone have any advice on best ways to deal with pretty bad anxiety while living alone and working from home? FWIW, I also live thousands of miles from all of my family. My anxiety got pretty bad several months ago during the holidays when Covid was at its peak and was impossible to see people. I was also still furloughed from work and had a lot of time to think (and overthink). Ive dealt with mild anxiety in the past but nothing like this. During that time it got so bad that I drove thousands of miles to be with relatives. I was able to spend time with them in the evenings which was really helpful and eventually I felt back to normal for the most part. Since then Ive also gotten my job back. However, during the last month Ive gone through a breakup of sorts and that has brought my anxiety back. I lived alone for several years before this and it used to be awesome for me but now it just feels painful. Im almost afraid of being alone. My anxiety is always bad in the mornings; I dont get a lot of sleep because of it which makes it difficult to focus at work. Also, my anxiety gives me get bad stomach aches and I lose my appetite so it makes it really hard to eat. I usually have to force myself to eat every day which just isnt fun. My work is partially opened up and Ive been trying to go in at least a few hours a day just to be around other humans. That helps for sure. Ive been trying to take early morning bike rides as soon as I get up and that typically helps but in the few hours before work starts, Im still rather anxious. Ive tried meditating (which kinda makes things worse), journaling, watching mindless TV, reaching out to friends, etc. I talk to a therapist on a weekly basis which has been helpful. I tried antidepressants (SSRIs) for about 6 months or so and they made my anxiety worse at first and I didnt feel like they were super helpful after that. TLDR; Any tips as to how to get out of my head and regain that sense of safety to be alone again after suffering anxiety because of the pandemic?"}
{"Reddit ID":"odd6lm","Reddit Post":"After the second shot, 2 weeks later i have chest pain, shortness of breath, and i feel more tired than usual. I've been exercising daily but today was the worst, i tried walking down the street and completely out of breath. I'm worried that the vaccine may have done something to me, i also noticed my blood pressure was higher than normal, 169\/72. So ive cut out fast food, salt, and only drinking water and eating at home. Has anyone have any of these symptoms? I felt completely fine until getting the second shot."}
{"Reddit ID":"oddaq8","Reddit Post":"First time poster, sorry if any rules are broke. My wife and I are moving to the UK from South Korea this month and are in a tight position regarding vaccination - we could technically get our first jab in Korea but dont have enough time to get both. We have been struggling to decide on what to do for two reasons. 1) is it even possible to get to the UK and say hey I have already got one jab from maker X so please just give me the second one 2) would it be possible to get a vaccine passport like this? I fear that with countries not recognizing vaccination abroad we would be stuck in this limbo of not being believed by either the UK or South Korea Anyone has a similar experience? What did you end up doing? If it were 1 month ago we would have no problems just having two jabs in the UK but given the current situation, flying in without a minimum level of immunity sounds crazy"}
{"Reddit ID":"ode5dl","Reddit Post":"Since I am fully vaccinated as of last month, today I visited my grandmother for the first time in over a year. According to my father, she had been vaccinated. About an hour into the visit (in which I'd been sitting next to her, both unmasked, indoors) I found out she was in fact not vaccinated. I couldn't get a clear answer as to why (no one willing to drive her? she herself not wanting the shots?) but point being: I realize I'm probably fine, but with the variants and circumstances of the exposure I do worry about both myself and her."}
{"Reddit ID":"oegz7y","Reddit Post":"I got my first vaccine shot about 3 weeks ago. It took a while because I live in a family full of skeptics that say that the vaccine is rushed. That we dont know the long term effects. But I got it anyway. And now Im starting to think about it more. Ive always been a hypochondriac. And lately, Ive been aware of my heartbeat. When Im resting, I can feel it in my chest by itself. I remember reading an article about teens having heart problems or palpitations after getting the vaccine. And now Im worried that Im one of those people. But I also dont know if it could be other things. Maybe its because Im inactive. Or how I eat. I dont know. Im getting my 2nd vaccine shot on Friday. But if my heart thing is vaccine related, wont it get worse? Im scared. You cant unvaccinate yourself. If I get my second and it gives me heart problems the rest of my life, Im screwed. I survived covid once. What if I made a mistake? I dont know anymore. Im scared of both things. I hate being a hypochondriac."}
{"Reddit ID":"oek1fj","Reddit Post":"Just wondering if anyone who had covid while fully vaccinated would mind sharing what it was like? This family member had covid in late winter\/spring and was later vaccinated but is now showing symptoms and running a fever. They feel identical to when they had covid. So... I'm a little nervous even though I've been fully vaccinated for a few months."}
{"Reddit ID":"oengs0","Reddit Post":"I need a little bit of help. I'm mentally preparing for my 15-month toddler to go to her first family birthday party! It will be outdoors, and almost every adult is vaccinated! There will be kids under 9 years old there, most of which go to daycares\/schools. I'm asking everyone who wants to interact with my toddler to wear a mask if they are not vaccinated, but I'm still nervous. I know everything will be okay, but it's just so weird after being so protective for her entire life."}
{"Reddit ID":"oenn5v","Reddit Post":"I read this article about much lower efficacy on the Delta variant by Pfizer ([url] and now I'm concerned about the possible doom and gloom around it as well as many things vaccinated people like me possibly still can't do. There seems to be no end, nothing to ease the situation."}
{"Reddit ID":"oeyzh8","Reddit Post":"So basically, I have been isolating since the day of my symptoms and will end this Sunday, however, my mother started to have symptoms on Saturday and can't do anything till Wednesday, do I still need to isolate till Wednesday, or am I free to go on Sunday. Another question, regarding washing whats the best way to deal with that as I can't find anything that could help that issue."}
{"Reddit ID":"of1kuk","Reddit Post":"Hello all, For my thesis, I'm studying how people depended upon social media and news of COVID-19 deaths during the pandemic, and how these factors affected how they felt and acted. *Eligible participants are people living in the United States over age 18 who used social media to communicate or learn about COVID-19.* If you're interested, please take this survey: [[url] This study has received approval through the Iowa State University IRB (#21-238-00). Please DM me with questions. Thank you for participating!"}
{"Reddit ID":"of1njr","Reddit Post":"First off, my apologies if this is not an appropriate place for this post. If it is, then please suggest a better place to post it (in this thread, or in a PM, or via whatever form of communication suits you. Regarding the mask. I say \"covid filtration efficiency\" because I'm not exactly sure what I should be looking for. I assume I should be looking at \"viral filtration efficiency\" scores\/tests but for what particle size? I seem to recall hearing that your typical covid aerosol is about 0.3 micrometers in diameter but I could definitely be wrong about that. I'm guessing I can simply close off a valve with some kind of solid object, but I'm not sure. Certainly, I want to avoid risking spreading the virus to others in the case that I become infected (I suppose one might argue that with properly wearing a very protective mask I am unlikely to be infected in the first place. Don't ask me about the legitimacy of that argument though) The goal here is to get a mask with a high degree of protection against covid. My mother is aged and smokes a lot and my country is in the middle of a covid delta variant spike so I need a high degree of protection. Whether I'm severely paranoid or otherwise, 95% filtration efficiency is not enough to satisfy me. You have my thanks in advance for your assistance, and my apologies for any imposition."}
{"Reddit ID":"of3m8e","Reddit Post":"I am starting to get so fucking tired of behaving this way but im too afraid of a second wave and I still miss the only person ive got so much chemistry whit and honesty I lost way to much money trying to atleast not end this year as a virgin not to mention al the alcohol and schrooms. Oh yea and Ive not even been vaccinated yet but idk all I want is too see lc again but lockdown ruined it all and I just want someone like her you knwo because I just cant get over her ad I cant help but being angry at those experts for ruining it all I honesly wish I died of covid sometimes who want to get old alone anyway?"}
{"Reddit ID":"of5i44","Reddit Post":"One of my close family members is getting married in August. This pandemic has given me pretty bad health anxiety, and I still feel super uncomfortable being indoors with such a large group (100-150 people), especially since I live in an area where vaccination rates are under 50% and very few people wear masks (even unvaccinated). I know for sure there will be people at the wedding who are unvaccinated and unmasked. I also got the J&amp;J vaccine, and its effectiveness against delta seems somewhat unclear. Im debating whether or not I can even attend because just the thought of being inside with that many people unmasked (and some unvaccinated) gives me extreme anxiety. Just looking for some other perspectives and wondering what others would do in my position."}
{"Reddit ID":"of7ots","Reddit Post":"I suffer from OCD and it has never been as bad as its been in the last year. Before I got vaccinated, I was in constant in fear of dying, spreading it to someone high risk, or my family getting sick\/dying. My immediate family knows that I suffer with it, but no one aside from my brother really understands the levity of how crippling it can be. I barely leave the house cuz of it now and have to put ointment on my skin because I've been oversanitizing\/overwashing to the point where my skin bleeds and cracks. My immediate family isn't against COVID safety by any means, but they definitely make me feel crazy for still wanting to disinfect everything and everything else. The family that's coming hasn't been the safest during COVID. They're now all fully vaccinated, but I'm extremely anxious to be around them and that some freak outbreak could happen between us. I'm trying to set boundaries and minimize exposure, but knowing my family, feeling the weight of their judgment will also give me immense anxiety. Part of me doesn't want to really go to this family event, but my mom keeps reassuring me that it's only our family and no one else (even though that's like 30 people). I also have a rocky relationship with religion due to being queer so being in a church setting to begin with is really hard for me. Does anyone have any advice on how to stop spiraling and calming myself down around everyone? Will having these spiraling thoughts about COVID hurting my loved ones and I ever going to end?"}
{"Reddit ID":"of8kda","Reddit Post":"I live in the USA, and my passport is now useless due to COVID. I doubt other countries will let Americans in again for the foreseeable future, since so many of my \"countrymen\" refuse to get vaccinated. I'm inclined to rip up my passport, or maybe even use it as toilet paper. At least in the latter case, it would have a use. For what it's worth, I am fully vaccinated."}
{"Reddit ID":"ofageg","Reddit Post":"So I'm fully vaccinated, and I, unlike many, still wear a mask in businesses. I work in a grocery store and have been working there through this whole thing. I never got COVID, however (that I know of). I'm worried that this fall\/winter, our governors do things like mandate expensive tests (even for the vaccinated) just to cross a state line, shut down all the restaurants, and so on. Thoughts on whether or not you find this likely? (US, by the way)"}
{"Reddit ID":"ofcmv7","Reddit Post":"hi, i wrote about the first dose and i thought some of you might be interested in the \"trip report\" after the second dose of sputnik, so here i am. got my second dose last sunday, all i got this time was a very bad pain in my left arm, it hurt like an injury or something, like a professional boxer hit me in the shoulder several times. it lasted a little less than 24 hours, i guess, i had one pretty tough night because i couldn't sleep and woke up like three times or something because it hurt so bad. to be clear, my pain tolerance has always been close to non-existent, so what was close to unbearable for me might be a minor inconvenience for someone else. also, the combination of allergy meds (i took cetirizine) and ibuprofen works wonders. so, as you can see, i'm still alive lol. speaking of long-term side effects, i feel like i started having moderate headaches more often than last month but there might be a ton of factors, i. e. i started drinking coffee on a regular basis after almost 5 caffeine-free months. i had a period between the doses, nothing changed, my cycle is fine. no 5G tho, a little disappointed."}
{"Reddit ID":"ofghxk","Reddit Post":"Hi, there's the 50th birthday of my parents friend. Well she's my friend as well since I know her since I was little because her son is one of my best friends growing up. There will probably be 50ish guests there (don't know exactly, could be more). It is planned to be a garden party but forecast says rain, so it's probably indoors. It's in my hometown, so I would need to travel there a few hours to attend. I haven't seen many of the people attending there since last year including some of my friends. Mainly because I didn't want to meet because of the virus. I only texted with them. Cases are very low (sometimes zero) there. Some people there are fully vaccinated, some got their 1st shot and some haven't yet. I got my first shot 3 weeks ago(Moderna). I haven't met such a big group since last summer. Only smaller groups and always outdoors. You can probably tell by now that I'm a very careful person when it comes to dealing with the virus. I always followed my principles. Right know I'm going back and fourth whether I should go or not. Is it still okay to apply the precautionary principle here and not attend? I mean I'm 3 weeks out from being fully vaccinated. Everyone else there is in a spirit to party because we couldn't for so long. I'm not having that feeling. Quite the opposite. Like I have the caveman syndrome when it comes to larger groups. How do you evaluate the situation? I guess I just need some opinions on it. Thanks for reading so far!:)"}
{"Reddit ID":"ofgy6a","Reddit Post":"Hey guys, &amp;#x200B; Apologies- pessimistic post incoming- feel free to delete if inappropriate. &amp;#x200B; I'm struggling so much at the moment with having any sort of hope for the future. It just feels like we will never get normality back. COVID has completely ruined me. I went from being a (mostly) happy and functional human to depressed and suicidal since 2020. I take anti depressants now and I started therapy but even on my good days, I still feel like there's this dark cloud over my head and I'm waiting for the next shitstorm. &amp;#x200B; I live in the UK and we've had three long lockdowns. Everything was looking pretty hopeful a few months ago, but since the last lockdown rules started easing, cases and hospitalisations have started rising again, even though we're doing pretty well with vaccinations. Our Government have handled the pandemic pretty poorly throughout and managed to let the Delta variant in with their loose border control measures. It just feels like this never ending cycle of rising cases, lockdown, falling cases, lift lockdown, rising cases again, etc etc and I'm terrified of going into another lockdown in the Autumn. I can't do it again. &amp;#x200B; We keep saying the lockdowns are to protect our (underfunded) NHS from being overwhelmed but if hospitalisations are already getting too high now in the SUMMER, how the hell will they cope with a Winter wave with not only COVID cases but also a new wave of Flu cases which have been low the last year because of the lockdowns??? &amp;#x200B; I feel guilty for complaining as I know other people have it much worse, and having already had the virus, it's not affected me all that badly. But the restrictions have meant I can no longer do my job (musician), I can't meet a partner, I've lost all hope for the future and I just feel like I'm waiting for the next bit of bad news. If the vaccines aren't enough for getting us out of this shit, what will be???? I just don't feel like life is worth living anymore under these restrictions. &amp;#x200B; Sorry for being negative, I just needed to rant."}
{"Reddit ID":"ofgyky","Reddit Post":"Hey guys, Apologies- pessimistic post incoming- feel free to delete if inappropriate. I'm struggling so much at the moment with having any sort of hope for the future. It just feels like we will never get normality back. COVID has completely ruined me. I went from being a (mostly) happy and functional human to depressed and suicidal since 2020. I take anti depressants now and I started therapy but even on my good days, I still feel like there's this dark cloud over my head and I'm waiting for the next shitstorm. I live in the UK and we've had three long lockdowns. Everything was looking pretty hopeful a few months ago, but since the last lockdown rules started easing, cases and hospitalisations have started rising again, even though we're doing pretty well with vaccinations. Our Government have handled the pandemic pretty poorly throughout and managed to let the Delta variant in with their loose border control measures. It just feels like this never ending cycle of rising cases, lockdown, falling cases, lift lockdown, rising cases again, etc etc and I'm terrified of going into another lockdown in the Autumn. I can't do it again. We keep saying the lockdowns are to protect our (underfunded) NHS from being overwhelmed but if hospitalisations are already getting too high now in the SUMMER, how the hell will they cope with a Winter wave with not only COVID cases but also a new wave of Flu cases which have been low the last year because of the lockdowns??? I feel guilty for complaining as I know other people have it much worse, and having already had the virus, it's not affected me all that badly. But the restrictions have meant I can no longer do my job (musician), I can't meet a partner, I've lost all hope for the future and I just feel like I'm waiting for the next bit of bad news. If the vaccines aren't enough for getting us out of this shit, what will be???? I just don't feel like life is worth living anymore under these restrictions. Sorry for being negative, I just needed to rant."}
{"Reddit ID":"ofhg3z","Reddit Post":"My apologies if this post is inappropriate for this subreddit. If it is, please suggest an alternative subreddit. &amp;#x200B; I have a mother with health conditions that make her at risk, so I need a high level of protection. The particular mask available to me for purchase is valved, but I'm thinking I can just cover the valve with something solid so as to protect people from me in case I am\/become infected. Correct me if I'm wrong."}
{"Reddit ID":"ofk297","Reddit Post":"I'm fucking tired of all this. I, along with millions my age, have sacrificed an entire year of my young life to protect my older loved ones from this shit. I've gotten vaccinated, I wore masks, I've done my part. Now this goddamn Delta variant shows up out of India because Modi is an incompetent piece of shit and because our border controls are a joke. If we get sent back a year, I'm going to completely melt down. I am *absolutely not* going to sacrifice another goddamn prime year of my life to protect old folks. I'm sick of my sacrifices being squandered by people who don't appreciate them. I'm already coughing up a chunk of every paycheck to support these people. At this point, if they won't get vaccinated, let them fucking die. At this point, I am no longer confident that this Delta variant won't force a resumption of restrictions. If we have to deal with distancing again, I may very well off myself rather than deal with another year of this shit."}
{"Reddit ID":"ofmea1","Reddit Post":"I'm around 21-ish and I got my 1st dose of the AZ jab back in May, but as the date for my 2nd approaches I am getting a little bit nervous and anxious given all the studies and news coming out about the blood clots and risk of death from the vaccine in young people. If nothing's happened after the 1st dose, should I be safe or will I still need to worry about this for the rest of my life? As much as I'd like to minimize my risk, I don't want to go around \"vaccine shopping\" since it feels morally conflicting to be messing around with the solution to the pandemic; wouldn't changing to another vaccine cause more risks? I'm super anxious and I couldn't sleep last night because I've been terrified of both catching this virus, or risking a blood clot from a vaccine, it feels like I'm caught between a rock and a hard place, although there is still less risk with the vaccine than COVID given the new variants."}
{"Reddit ID":"ofmx9a","Reddit Post":"Hi! I have an appointment booked for my second dose of Pfizer on Monday, with the possibility of moving it up to tomorrow. I struggle with severe food allergies and therefore getting the first dose of the vaccine was incredibly difficult for me. I feared having a severe allergic reaction and had many panic attacks leading up to the vaccine appointment. Luckily, all went well and Im not anticipating my second dose. However, I have a few fears. First, I developed an odd skin reaction approximately one week after vaccination. My forearms became incredibly itchy for about 2-3 days, but I never developed a rash or anything of the sorts. Not sure if it was related to the vaccine, but I cant think of anything else If this was due to the vaccine, does that put me at any risk of having a severe allergic reaction with the second dose? Second, I am a woman in my early twenties. Ive heard reports of myocarditis after the second dose in young people. This is quite scary to me as Im very active. Should I be concerned? Thanks everyone."}
{"Reddit ID":"og60wj","Reddit Post":"Hello everyone, I'm gonna preface this by saying that I'm aware that my fears are driven by my anxiety and that I did finally book an appointment with my psychiatrist to maybe get back on medication. I live in Italy and here we had three lockdowns, the last one ending around May. They left me absolutely burnt out. Sometimes I just feel like I'm in a different universe than I was in two years ago and nothing makes sense anymore. A lot of nice things are happening to me: I am graduating on Monday, I got my vaccine and maybe my boyfriend will finally be able to come visit after 18 months of not seeing each other. But all I can think about is that this will never end and I will be back in lockdown in October. Evertime I'm happy or having fun or trying to make plans for the future I have a little voice in my head saying 'you can't relax because things are never gonna get better and nothing will work out'. I haven't felt true, unconditional joy since maybe August last year. This past year of isolation broke me completely and I feel like I will never be happy again. I hadn't been on antidepressants since 2019 and now I lost all my progress. I feel so guilty because my family and friends are all so excited and proud of me but I feel empty, scared and sad all the time. I just wish this never happened."}
{"Reddit ID":"og9qaf","Reddit Post":"Hi everyone - thank you for the support shown in this forum. Since March 2020, I've been in a COVID bubble with my wife, sister-in-law, and their parents. While the last year and a half have been trying emotionally and professionally for all of us, things are looking up with the vaccine. However, my wife's parents refuse to get vaccinated. They are not in great health and my father-in-law specifically is older and I worry about his health. Therefore, even as things have started to open up, my family has been relatively more conservative, with no masks-free indoor interaction outside of the family, even with people that are vaccinated, for fear of spreading the virus to my inlaws. This is becoming a big problem because I am building a startup and my cofounder is someone I met during the pandemic. He and I need to start building a more regular working cadence and relationship, but this is really difficult since my wife and SIL are not comfortable with me working in person with him, even though he is vaccinated (though he is much less careful than us). For my part, I would like to push the company forward, and agree that our creative work would improve if we were able to work in-person a couple of times per week. I'm just at a loss - my wife is grieving what she perceives as the loss of her parents' sanity and doesn't want to cut them off, but I face real professional challenges (let alone the ongoing personal and mental health challenges) from continuing the status quo. Guiltily, I feel very angry at them - I feel like they are offloading responsibility for their safety on my wife, SIL, and myself, which seems extremely selfish. Support and advice appreciated - thanks y'all"}
{"Reddit ID":"oga1in","Reddit Post":"This lockdown has gone on forever. From November 2020 until May 2021, restaurants were take-out only in Munich and we could only meet one person from another household. They are now finally open both inside and outside, but clubs and bars are still closed, we can only meet up to 10 friends privately, and we have to wear an FFP2 mask inside (stores, public transport) and walking around a Biergarten (which have 1\/3 of tables closed still). Now we are approaching herd immunity levels finally, but there is no talk about when restrictions will finally be removed at all. The news focuses on spreading fear about the Delta variant constantly, and many people are expecting another lockdown in fall\/winter despite vaccinations. Vaccinations are humanity's only hope to fight back against this virus, and if these don't work against some variants (even though all evidence so far says they do work), then there's nothing we can do. The notion of creating another lockdown to wait for a better vaccine is absolutely ridiculous because humans will never beat nature in this race. The best chance we have is to vaccinate as much as possible with what we have and take some risks again by opening up. I don't think I can mentally survive another lockdown, and if it happens I feel like I need to get out of Germany. I feel like it's hard to talk to people anymore. Most of the time when I see someone I know, I try to avoid talking to them because it's easier not to. I feel like I've become so negative that I don't want to share my thoughts with people because I will bring them down, and I already feel like I pushed some people away by doing this. I emailed multiple psychiatrists, but only one answered me and had one short appointment, and told me I should continue looking because he doesn't have time for new patients. I spend most of my time trying to get the motivation to work but failing, and looking at vaccination percentages and restrictions around the world hoping to see them improve and thinking about where else can be better than here."}
{"Reddit ID":"ogeyad","Reddit Post":"I've been doing a little more out of my comfort zone with being vaccinated. Well one of the things on my list is getting this tattoo I've wanted for a while. It is scheduled for Sunday with my cousin ( professional tattoo artist ) it will likely take around 6 hours. Should I be masking for this and or just go for it. I've been debating canceling but I don't want to. So I'm going to do it but just want to be safe. She's sees so many people and is unvaccinated, so making me a bit nervous."}
{"Reddit ID":"ogfns7","Reddit Post":"I was going to get my first shot this sunday. But I keep making up these scenarios in my head of all the way's I could screw it up. And I started realizing that seeing how I only wanted to get it to hopefully be able to meet someone. witch isnt going to happen anyway. so now im starting to think that I might as well not waste my time on it and go cycling, jogging or you know something that get's my mind of things"}
{"Reddit ID":"ogh0bu","Reddit Post":"Please note that I am NOT an anti masker, I can't stand those people. However, when it comes to things around or in my mouth that I can't swallow, I get really nauseous. Seeing the dentist, as you can guess, is super hard. I find myself gagging after a while of having my mask on which is embarrassing and limiting. I was wondering if anyone here has any advice? Is there a way to alleviate this?"}
{"Reddit ID":"oghg0x","Reddit Post":"So this will be my fourth time posting this type of post but I feel so confused right now. Things in Colorado have pretty much all opened up again and to be honest, Im back to living my normal life again and it has been glorious and has done wonders to my mental health. I followed the covid rules pretty hard before I got my vaccines (moderna both shots back in March and April) and ever since the CDC gave updated guidance to vaccinated individuals Im basically back to my pre pandemic life. This delta variant has me concerned and confused. Do the vaccines fucking work against it or not? Do you think we will be back on full lockdown in the fall\/winter? Will this ever end? I hate everything about the covid lockdown lifestyle but Im a rule follower so Im gonna comply if need be but this ongoing cycle is breaking my will to live."}
{"Reddit ID":"oghiq0","Reddit Post":"Im a fully vaccinated college student in the U.S. who needed to relocate to another part of the country in May for a summer internship right as it was starting to become safer to see others again; because of this, I can count on a single hand the number of times Ive seen each of my friends (if Ive seen them at all) since March 2020, and Ive been really looking forward to finally maybe getting to make plans to spend time with friends when I return to my home state in August. With that said, Im now seeing more and more reports (including this CNBC report: [url] saying that the new Delta variant will cause the country as a whole to have to reimplement mask and social distancing requirements, especially in states with lower vaccination rates. Consequently, Im feeling increasingly worried that Ill come back in August only to find its gone back to not being safe to see anyone and classes have gone back to being mostly (if not completely) virtual, especially since my home state is one of those mUh FrEeDoMs states with low vaccination rates (granted, Im sure theyd be hesitant to require masks for the same reason, but a lack of that requirement doesnt change how safe or not safe things are). How likely do you think it will be that things will go back to being unsafe to see others when I go back in August (or later in the fall)? Is it reasonable to expect that things will end up needing to go back to being fully socially distanced?"}
{"Reddit ID":"oghsbx","Reddit Post":"Im a vaccinated college student in the U.S. who relocated to another part of the country in May for a summer internship, and I was hoping things might be better enough when I return home in August to see friends again, but now Im worried this Delta variant will result in things going back to being just as bad as they were in 2020. Do you think its reasonable to expect things will end up getting worse again because of this variant?"}
{"Reddit ID":"ogj05q","Reddit Post":"I'm fully vaccinated, and I really hate how people are downplaying the delta variant especially where I live on the east coast. It's now clear that vaccines alone are not stopping the spread of this thing and vaccinated people are spreading. That means that in a few weeks this wave will be everywhere. I'm worried about kids who are 12 and below who aren't vaccinated. It will be impossible to have any schools open in the fall unless we risk long covid in kids which would be unimaginable. I'm worried about the African American population which is only 33% vaccinated. I'm worried bout breakthrough cases even though they're rare I worry about older people in my family and I know some immune compromised people who are going to be in trouble regardless. I understand the psychology of not wanting restrictions and lockdowns but it's clear that the pandemic isn't over we're entering a whole new stage of it and I hope that people follow the rules and don't risk their neighbors lives in the coming months due to selfishness and ignorance. I just wanted to say that"}
{"Reddit ID":"ogt4eq","Reddit Post":"I'll briefly explain my situation before anything else. I'm a 19 year old autistic Italian boy, but despite being on the spectrum right before the pandemic started I've had a big progress at socializing with people, I hung out with big groups among my friends every Saturday night, we had so much fun, and then the pandemic happened. My group not only shut down for months, but the general spirit of the group kept going downhill, i tried helping them but ended up feeling just as bad as them if not worse. After a painful year of online class (which i could barely even do cus my wifi had given up on me), I thankfully was able to get even both shots of the Moderna vaccine. But even after all that, the group hasn't changed. Whenever someone asks to go out, we get the same answers like \"i can't, i need to study\/work\", \"I'll be there next weeks (it's the 4th time they said that) and the spirit is still doom and gloom. I want to find some other friends, but due to how stuck to their circles people are here I'm afraid I'll never be able to find someone else who likes me. What can i do which can help me? PS: Fyi, I've already tried online, I met many friends but I think physical contact is what I need, not seeing some messages"}
{"Reddit ID":"ogvf00","Reddit Post":"Not asking for a medical opinion because I will ask the doctors, but asking if someone was in a similar situation. I attended this film workshop and to my surprise people didn't wear masks indoors. I did wear my K95 the whole time but no one else. I sat behind this guy and he suddenly faints and they take him to the ER. We learn he had symptoms and took two COVID tests that came negative. I am freaking out now. I need to get my COVID jab in few hours so I don't know if I should if I was exposed. Any similar situations or thoughts are very welcomed. I am beyond angry."}
{"Reddit ID":"oh05p1","Reddit Post":"All our time and energy has been put towards vaccines, and now we are getting variants that can evade the vaccines. Pfizer is making a booster but by the time it's tested and rolled out, either most people will have gotten infected already or there will just be a different variant. So why are there no TREATMENTS? Since the pandemic started scientists have been testing vitamin D and freaking hydroxychloroquine over and over and over again. Let's try other strategies. Let's have a new \"operation warp speed\" and develop new drugs. Let's try antifibrotics to prevent lung fibrosis. Because I'm so tired of people saying \"vaccines prevent against hospitalization!\". I don't want to just avoid being hospitalized, I want to avoid permanent lung damage. People with mild or even asymptomatic covid are often left with permanent lung damage, but no one is talking about it. Do you want COPD and fibrosis lungs? I certainly don't. I'm moving to the UK soon and with tbe Delta variant raging I feel like a sitting duck. I'm so scared and hopeless because if I get Covid there's nothing I can do to save my lungs from fibrosing. We have to learn to \"live with covid\", so where are the treatments to make it tolerable?"}
