{"Reddit ID":"pjxs6","Reddit Post":"We have a beautiful 4 months old girl. My husband would like us to do some activity with our friends 2 times a month. This would mean we have to send our little girl to be babysat at her aunt's house (my husband's sister) We already send her to her grand parents 1 or 2 times a month to go to the movies or things like that.\n\nIs that too much babysitting? I feel uncomfortable to leave her with relatives so often! I sometimes feel like my husband just want to get rid of the kid every week...\n\n\nAm i overprotective? Is it too much babysitting for a 4 month old?\n\n\nedit: I live in Quebec and everybody has a full year of paid maternity leave... babies are not often seen in day care centers here :)\n\n\nedit2: Thank you all for your answers. It feels great to put things in perspective. Tonight she will go to her aunt's while we have friends coming over to play board games. I know that she will do great, because she usually does when she is babysat (tough is the first time for the aunt, so I'm a little bit nervous, but she lives 5 min away anyway...) So yeah, i think we gonna send her over 2 times a month like my husband wants. If it doesn't work well, we will just stop it. I think i was part worried to look like *\"that parent\"* who doesn't care for his child. But you have but things in perspective and i realize it is not as bad as i first thought. Thank you again!"}
{"Reddit ID":"iaeml","Reddit Post":"(x-post from \/r\/aspergers) \n\nMy almost 7 year old son, who has Aspergers, is starting a new day camp next week. We've spoken to the councilors an given them as much background as we can. The question came up of whether or not to be up front with the other kids - for example, on the first day reading them a book about Aspergers ([maybe this one](http:\/\/www.amazon.ca\/gp\/product\/1843102064\/ref=oss_product) ). This could be done in the context of each kid telling something unique about them self. My son is very open Aspergers, and would have no problem doing that. \n\nPeople on the \"against\" side, have concerns that it would be singling him out and may cause more problems and teasing.\n\nPeople on the \"for\" side point out that the kids will pick up fairly quickly that my son is \"different\" and being up-front about what that difference is and how they could help could prevent problems. Also, they point out that if a child had a physical disability you would certainly talk about it, e.g.  \"Billy has a XXX so he would be able to go swimming with us, but he loves to sit on deck and you can still play ball with him that way\".\n\nSo what do you think?"}
{"Reddit ID":"ov6fj","Reddit Post":"It's one thing to pull a Bewitched and switch out Marina like nothing happened, but to give her the role of Dorothy?  Hasn't Kiki earned any sort of seniority?  Why is this happening?  \n\nI'm beside myself and nobody understands.  There's some serious casting couch going on over at Nickelodeon."}
{"Reddit ID":"j43mr","Reddit Post":"My boy used to take a bottle of expressed milk with no problem until he was 4 months. We tried EVERYTHING to get him back on it, but with no success, so we have just worked around it while in daycare 2 days a week. He is turning a year soon, so I have been trying to cut out breast feeds slowly, but he still have no interest in the sippy cup for water or any other liquid. He still wants it all from me.\n\nDoes anyone have any tips on how to get him to take cow's milk or even just water from a sippy cup or straw or anything? I would really like to stop breastfeeding soon. We want another baby and I haven't gotten my period still, so I think I am going to have to stop breastfeeding in order to get my body ready for number 2.\n\nWhat worked for you? A gradual approach to stopping the breast feeds or a cold-turkey approach?\n"}
{"Reddit ID":"mjnrq","Reddit Post":"Need an easy way to track all the feedings\/diapers and all the other exciting events in your little one(s) life?  Developed by a dad of twins, let Baby Activity Journal help you get through the hectic early days of parenting.  \n\nI'd love feedback, and have 5 promo codes for Redditors - the promo codes let you DL and use the app for a month.  If you like it, I hope you buy it.  I have two kids hitting college in 16 years - so I need all the help I can get!\n\nPM me and I'll send you a code.  Again, all constructive feedback is appreciated.\n\nLink to Itunes store: http:\/\/itunes.apple.com\/us\/app\/baby-activity-journal\/id454085049?mt=8&amp;ign-mpt=uo%3D4"}
{"Reddit ID":"n1evb","Reddit Post":"My wife is pregnant with our first child, and she is due in March. A friend of ours that lives close by stumbled upon a local mother's group by luck when she was pregnant. Too bad they are exclusive to that particular neighborhood. \n\nMy wife is staying home from work for 12 weeks after the baby is born, and we'd like to get into some new parent's group of some sort, as we don't know too many couples in the area with children.\n\nI'm having a hard time wading through the shenanigans on the internet. Meetup.com seems like an OK source, but group pages aren't kept up well.  Is there any other site I should look for?"}
{"Reddit ID":"lx13o","Reddit Post":"There is a search feature on this subreddit (all subreddits, actually).  If you have questions about a host of common parenting topics (sleep issues, behavior issues, breastfeeding, child care, education, health care), PLEASE search before you post again.  Sometimes these topics have a current thread going; sometimes you need to look a few days back in the archives.  Some people have written long, eloquent responses and they may not feel like repeating themselves.\n\nFWIW."}
{"Reddit ID":"ldud2","Reddit Post":"So, I'm doing some soul searching about my motorcycle.  I've ridden for six years, and have about 100,000 miles under my belt.  I've always been extremely responsible, I've worn all the gear, all the time, gotten the training, and obey traffic laws.  My wife, bless her, has never pressured me to leave them behind.  In fact she pressures the exact opposite since she doesn't want to hear me gripe about not having a bike.\n\nMy son is thirteen months old.  Every time I leave on the bike I make sure the last thing I say to him, and my wife is that I love them.  A small part of this is too ensure that if I'm on the bike and my number comes up, the last thing I've said to them is the most important thing that needs to be said.\n\nI don't think I can do this anymore.  Today, while riding, I just couldn't stop thinking about how absurd my little ritual is since I'm actually out there doing something that increases the likely hood that my innocent \"I love you\" really will the last thing they hear me say.\n\nSo, I'm curious how other bikers dealt with this.  Did you give it up? Do you regret it?  I can't help but feel like the pang of regret I might feel on a sunny day with no bike would probably be outweighed with a satisfied feeling of duty to my family."}
{"Reddit ID":"mnz6a","Reddit Post":"I went to a Mom &amp; Pop coffee shop with my friend and my infant child and began breastfeeding. Granted, I did not have a cover (forgot it) but was sitting discretely and had a shirt on that hid most everything.\nA barista came over and asked that I use the Family Room (washroom with change table, microwave and lazy boy chair) to do feedings, as it was \"potentially unhygienic\" and \"other patrons may be uncomfortable.\" She also said that is what the room is designed for.\n\nSince this is an independent store, do they have the right to make this request? They didn't tell me I had to leave, just go to a different area. My friend said it would be no different than being in a mall where there is a place to eat (food court) but individual stores can tell you not to bring food in.\n\nWhat are your thoughts? Should I write a letter, or just let it go?"}
{"Reddit ID":"twrly","Reddit Post":"my son who turns one next month eats more than any other baby i have ever seen. He eats like a full grown adult and he gets super cranky if he hasnt been fed in like an hour. IM not sure this is normal he used to eat a bit more than usual but now its gettin insane . He is only a year and he weighs 22 lbs so hes not a very fat baby infact when he stands up u can see his ribs. 80 percent of his time awake is spent eating and even when we feed him then we eat something ourselves he watches us eat like he hasnt been fed in a week. My gfs grandma said that both my gf and gfs dad ate alot when they were infants but im just curious if anyone elses little ones eat like him?"}
{"Reddit ID":"oba2o","Reddit Post":"almost 2 years ago, I put my boyfriend's father in prison for child pornography, he is to get out this september. We took over the house he was renting due to it being in the school district my son goes to and it's reasonably priced rent. \n\nThe lease is still in his name, and the landlord knows about the situation and keeps in contact with him through letters. \n\nToday we got a letter from him stating that he can't parole in PA like he wanted to, due to not having a job there, he won't have one here either, and told us that he has to put our address as his residence in order to make parole this time, meaning we are more than likely getting kicked out of here so he can move back. We don't want to have to uproot our family and move our son out of the district. \n\nThe school is .67 miles away from this house, and I know it's a bitch move but I do not want him back here. \n\nWhat should I do? We can't afford to move let alone afford rent anywhere else, we got really lucky here. "}
{"Reddit ID":"peobl","Reddit Post":"One thing I've been thinking about for a while is whether to home-school my daughter when the time comes around. I'd like for her to go to school and make friends, but there are things that schools don't include in their curriculum that I'd like to teach my daughter (communication skills are sometimes not offered for example).\n\nAny parents who home-school: Is it worth it? Does it interfere with your work and life too much? Is it possible to do both 1\/2 public and 1\/2 home somehow?\n\nEdit: I guess I should clarify- I no way intend to keep my daughter out of social activities, I would most likely have her attend a home-schooling co-op should my decision sway this way. I would also have tutors come over and help her in the areas I have trouble with (math...) so that she doesn't struggle her way through college or group projects. Also, I know how home-schooling can be abused (and why that is one reason it is controversial), my partner and I are both very open minded, free-thinking people who love to explore all realms of ideologies and theories (in other words we aren't going to shove her in Jesus camp and tell her that everyone is evil and wrong except us), also I would have her attend summer camps or maybe join a club so that she would get plenty of social interaction not to mention give us both a brief break from one another (kids need space too!). \n\nI just want her to have a better experience than I did in public schools. I wish I'd learned what I know now back then (I guess we all do) but the classes I was offered were mostly test-prep and my teachers were very, how you say, \"Do what I say, don't ask questions, shut up sit down\" etc...\n\nWe can't afford private school, but there are other school systems I'm looking into, and I have years to decide, I just want to be informed is all. \n\nThanks for everyone's input, I greatly appreciate it!"}
{"Reddit ID":"mufv0","Reddit Post":"I'd really like to offer my experience as to the parents of reddit about alternative ways to teach their children about people with disabilities. That is, ways of addressing the presence of a person with a disability around your kid besides taking them by the shoulder, directing their attention away, and whispering some variation of \"don't stare.\"\n\nI don't pretend to have any answers, but think this could be a useful dialogue for the reddit community\n\nattacking the camera -- http:\/\/imgur.com\/QPoyg\nwtf hands -- http:\/\/imgur.com\/J7DY8"}
{"Reddit ID":"lgkfz","Reddit Post":"I have a 3 year old and a 5 month old. My wife is a stay at home mom, while I work. Our 3 year old knows how to use the potty, but doesn't always want to. We have our good days and our bad. She is also enrolled in a \"mommy's day out\" program. Unfortunately, they keep sending her home because she is supposed to be potty trained and she keeps having accidents.\n\nSo, long story short, she uses the potty when we force her or when we catch the clues that she has to go. Most of the time, she just goes in her pants. When we ask her why she states, \"Cause I'm too busy to.\" This is frustrating to no end.\n\nAny advice?"}
{"Reddit ID":"mutsx","Reddit Post":"I have a 5 year old boy in kindergarten and the assistant teacher, when she talks to him about behavior issues (he's an active boy who doesn't want to sit still) she frames his actions as him \"making poor choices\".  I've never heard this phrase uttered by anyone to a kid unless it was coming from a teacher.  Does anyone know if this is a method of taking to a child that teachers are told to use while they are getting their education degree?  EDIT: Are they told to use this method at all ages, or has it just crept downwards in the field, so to speak? \n\nTo me, it seems to be needlessly wordy and too much of an abstraction for a young child--especially for boys who are not at the same level for language skills as are girls at this age.\n\nWhat do other parents think?  What do any of the teachers here think?"}
{"Reddit ID":"fujvk","Reddit Post":"So my daughter is on the young side, she's about to turn 7 months. I was wondering when is the easiest\/best time to get rid of the pacifier? I feel like because she's young it may be easier to get rid of it by 8 months or something, because I hear it could be hell as they get older. Is it too young though? Does she still have that \"sucking\" desire all the time? \n\nShe is semi attached to it. She needs it to fall asleep, but she'll usually push it out once she falls asleep and usually when she plays it's not in her mouth, but sometimes it is. \n\nWhen and how did you get rid of the pacifier? Is it easier to just do it cold turkey? Or do you start with only giving it to them for naps\/night time\/when they're seriously freaking out?"}
{"Reddit ID":"m3igk","Reddit Post":"So \/r\/parenting, I'm coming to you for advice.  My wife is currently 6.5 months pregnant, and I feel like I've been doing a decent enough job.  Her legs\/feet hurt often, so I give a few massages a week and help around the house, etc.  However, I feel like I could be doing more but need ideas.\n\nWhat things did your SO do to help you 1) Through the last leg of the pregnancy and 2) The first few months of the baby's life?\n\nOh, and it's a girl.  I'm pretty positive she's going to be the coolest ever."}
{"Reddit ID":"lo7ki","Reddit Post":"Tonight my 7 year old daughter awoke at 4:00am (sometimes she wakes up just so I can say everything is ok and put her back to bed) and I'm not sure how long she was standing outside the door but she over heard me and my boyfriend (me 36 him 28) say \"you can be somebody\" and she asked \"what does that mean\" after comforting her in the hallway I ushered her back to bed and said \"it means no matter what anyone says you can be anyone YOU want to be\"....          what do you think?  "}
{"Reddit ID":"kfen1","Reddit Post":"My daughter just started 3rd grade this year and is still having trouble with backwards letters and numbers. She has gotten better with us working on it with her. I'm just worried that she may not out grow this. When should I seek help?\n\nEDIT: Thanks guys for the help so far! I'm going to make an appointment tomorrow with the counselor."}
{"Reddit ID":"ness1","Reddit Post":"Please when your child comes of age when they are curious and experimenting, do not get mad when you find out your kid smokes marijuana. I cannot stress enough, that it is, for the most part, a harmless drug. Todays society has been fed so much anti-marijuana propaganda that most parents compare it to meth. It is in fact (and proven) far less damaging and addicting than alcohol. Feel free to ask about it if you have questions. I don't want any kid to have to go through the traumatic experience of getting yelled at\/neglected by a parent for something so harmless and innocent.\n\n**EDIT** For some personal input, I would never have gotten a gym membership if I didn't start smoking weed. And before it came into my life, my grades were quite poor and I told myself I wasn't going to get a secondary education, now I am so motivated that I am planning out my secondary now. I am so much more active and social, I have had zero drawbacks from marijuana, only positive things have come from it.\n\nThere are so many [emotionally invested people](http:\/\/www.reddit.com\/r\/whywesmoke) in this subreddit, should you be interested"}
{"Reddit ID":"klz2t","Reddit Post":"Today the pediatrician told me that she wants one of my twins to see early intervention services. She's a year old and not crawling (she rolls to get where she wants to go). One eye is possibly lazy and she does this weird thing where she tilts her head down, looks up, and shakes her head.\n\nI have no idea what to expect, but I'm a bit scared for my sweet little girl.\n"}
{"Reddit ID":"rhwj3","Reddit Post":"I've been getting a lot of questions from my kid about Netflix, messaging, etc. I'm usually pretty good at explaining things to her in terms she can understand but when I attempt the Internet, \"does that make any sense at all?\" is answered with a flat \"No.\" \n\nAny ideas?"}
{"Reddit ID":"kksfe","Reddit Post":"I realize that the two aren't mutually exclusive.\n\nI have a lot of good friends and family who are Christian, and a few friends who are gay. I don't really have anything against either group. It's just that I'd find it much easier being supportive of a gay son than a Christian son. I'm straight, but I can understand being in love, and I think I could deal with the first time my son brings home a boyfriend if he turns out to be gay. As an atheist, though, I can't understand believing in God, and I think if he turns out to be Christian, it would be hard for me to be supportive. He'd have more community support as a Christian, but I feel like it would be harder to connect with him myself.\n\nIs this selfish?"}
{"Reddit ID":"qif29","Reddit Post":"Just wanted to put my little story out there, not entirely sure this is the right place but hope it gets a little attention from someone else who has gone through the same experience cuz I don't have any answers. man, I know there aren't any answers, but I dunno.  I'm just feeling the pain just now of being desparate to have a kid and just feeling like it's never gonna happen.  My wife and I started trying for a baby in september 2010, of course assuming it would happen that month, but it did happen in april 2011, but in early june (on my wifes birthday in fact) she started to miscarry, and that was just really tough to handle and really disappointing.  Then it was a few months of dealing with that and waiting a couple of 'clean cycles' to try again, and try we did. cut to last month, we are pregnant again, and within 2 weeks this time we have miscarried again.  I know its all relative and there are folks out there who cant get pregnant at all, and others who have had more miscarriages... everything is relative, but you know that doesn't dimishing how we are both feeling right now. my wife is devastated and it's sort hard for me to see her this way.  I wish there was something we could do, that anyone could do- no one tells you man that trying to have a baby can be sooo hard, so painful.  anyway, thats all.  I'm hurting right now and I know there are other folk out there going through the same thing right now and it feels like it's never going to go right.  I hope it does for you all, and I hope it does for us.  we'll just have to wait another couple months and try try try again.  "}
{"Reddit ID":"o7tt9","Reddit Post":"My darling girl just had a huge melt-down at bath\/bed.\nMuch delaying, lot's of resistance.  She screamed the house down.\nIt has left me with a huge sense of sadness.  I really hate when this happens and I cannot yet understand the triggers.  I think it's a power thing, she want to be in control, but as parent we clearly have to say when it's bedtime, etc.  She did not have a sleep today which I suspect is part of it.   She gets so worked up, and does not seem to be able to control herself.   The whole vibe of the house is now stormy.  eugh.    Any thoughts?\n\nShe has so much spirit and fight, quite articulate, able to explain why she does not want to do whatever it is needs to get done.  Most excuses seem to revolve around fairness.  Why does she have to go to bed, when we get to stay up.\n\nTLDR; Daughter had another tantrum, left me feeling sad.  Don't have a strategy."}
{"Reddit ID":"ob7ja","Reddit Post":"I am a single dad of a wonderful little girl who is almost 2. my old schedule was to go to bed with daughter at 8. then i would wake up between 4 and 5 and then I would work out exercise go for a jog around the house a couple of times. and then eat some food. by then I was awake and ready for her to wake up and play. lately I cannot fall asleep at 8 anymore and if I do i wake up 3 hour later and toss and turn till 3 or 4 and then sleep until 9. while getting yelled at from my daughter to wake up between 8 and 9. anyone else have good ideas to fall asleep. it is winter so we don't go to the park or walks as much as we did from spring to fall. but we do go to the local gym and she plays with other kids in the play area while I work out. but im tired of trying to wake up with a monster running around the house lol. "}
{"Reddit ID":"lfvav","Reddit Post":"So I'll get right to it, our pregnancy (my wife and I) took a hard turn a week ago, she was admitted to the hospital after her water broke @ 30 weeks, she hung in there for a week and the little lady came yesterday. She came at 31 weeks and 4 days. She is so tiny, 3 lbs 13 ounces and 16 3\/4 inches. She came out crying and has not needed any help breathing, she seems to be doing wonderfully. She has no other issues and is just being kept warm and fed through an iv in the umbilical cord and today started with what we could get from mommy being fed through a tube in her nose. My problem though is, I am terrified, I held her for about 30 mins while she was swaddled up and between the tears of happiness I was terrified. I am so scared of startling her and all the tubes and wires, I would like to do the skin to skin contact, but I am so afraid of damaging her, and all of the wires really really scare me. What can I do? Should I be as afraid as I am? I just have no idea what to do, we also have a 6 year old daughter and I have kind of taken over on taking care of her, but I want to make sure I get to bond with my new lady as well. So any preemie dads, do you have any great advice for me, or things I can do for mom to help her?"}
{"Reddit ID":"k44xg","Reddit Post":"I was watching one of the numerous 9\/11 specials on t.v. today when my daughter walked in the room. I didn't really think anything of it until she stopped suddenly and asked: \"Is this real or fake?\" (She is very interested in real tv. vs. make-believe right now). It caught me completely off guard, so after a moment I said, \"Unfortunately, honey, this is real.\" I then proceeded to explain to her about the events and the significance of the day, but I found it very hard to really get into it because she was, naturally, getting very scared. It just dawned on me that before today, terrorists and the attacks on the twin towers did not exist in her world. What are some things you have told your kids to help them deal with it?\n\nBefore you say it, I know she is kinda young to be telling this kind of stuff, but with the anniversary coming up, I feel it is inevitable that she will hear about this and I would like her to be prepared. "}
{"Reddit ID":"ucg41","Reddit Post":"our daughter got a diaper rash last wed or so from huggies wipes (we assume) we have been treating it with diluted morgansofka (bath) \/ balmex and powder occasionally (being sure to not get near her face). It is almost gone but still reddish today.\n\nShe has been pooping a lot more than usual sometimes like diarrhea \/ sometimes mushy.\n\nshould we be worried she is lactose intolerant\/milk intolerant(from father?)\n\nshe is 9 weeks old"}
{"Reddit ID":"g16me","Reddit Post":"I had my first child seven weeks ago and am preparing to return to work full time at the beginning of April. Right now, if I go more than a couple hours without seeing my lo, hearing her or being able to hold her, I completely lose it. How do I wean myself off of getting to be around her before I go back to work?"}
{"Reddit ID":"md7pe","Reddit Post":"My daughter is 11 and she has had [hyperhidrosis](http:\/\/www.ncbi.nlm.nih.gov\/pubmedhealth\/PMH0004518\/) since birth. It  only affects her palms and the soles of her feet. She's always been self-conscious about it, and I've tried lots of different remedies. Her doctor prescribed a roll-on type of gel to stop the sweating in her palms and feet, but it is such a hassle to use, we don't bother. You actually have to apply it before bedtime, then wrap the hands and feet in gauze, then cover with plastic. Wtf?\n\n\nEvery time I hold her hand sh'es embarrassed because her hands are soaking wet. When she does homework she has to get up and wash and dry her hands several times. It's very frustrating to her. She's worried she will never get to have a boyfriend, because every time she'll hold hands with him, her palms will be soaking wet. I feel terrible for her, and I have never known anyone personally who has this problem.\n\n\nAnyways, I understand there is a very minor, hardly invasive surgery available for this, wherein the doctor makes a small incision between two of the rids, and basically snips and cauterizes the nerve that triggers this sweating. Anyone ever do this? I'm a little worried, and I've told her for years that we will consider the surgery only as a last resort, and only after puberty. "}
{"Reddit ID":"qszxh","Reddit Post":"Please help settle a debate.\n\nMy wife speaks several languages, as does her mother. I've read that children raised with multiple languages speak later than monolingual children. I've also read that a way to reduce this delay is to have each person only speak one language to the child. In addition, I understand that using [sign language](http:\/\/www.lifeprint.com) can allow a child to communicate with you before they can speak.\n\nIf my wife speaks Spanish to the child, her maternal grandmother speaks Armenian, and her paternal grandparents speak English, will each person using basic ASL signs help or hinder the child's ability to communicate?"}
{"Reddit ID":"ppe1t","Reddit Post":"I'm not sure if this is the correct subreddit for this, but if it's not, please point me in the right direction.\n\nI'm looking for a cool\/funny dad &amp; baby (or mom &amp; baby, or both) matching tee (or tee &amp; onesie) set. The ones I've found so far are pretty corny, or don't have a wide enough selection on the website...they don't even have to have witty sayings on them, I just want something that matches and is kinda cute.\n\nNot sure if the baby will be a boy or girl yet, so I welcome both varieties for now."}
{"Reddit ID":"sp26f","Reddit Post":"The Eldest of my 2 Daughters told me her very first \"Knock knock\" joke today. Got me real good with it too. Went like this:\nHer: Knock knock\nMe: Who's there?\nHer: Lorelei.\nMe: Lorelei who?\nHer: I pooped.\n\nAnd she had. Such a refined sense of humor from someone that's not quite 4."}
{"Reddit ID":"joxya","Reddit Post":"We are gonna be parents any week now, and have spent the last few months reading hundreds of reviews of every single little thing you might possibly need.  One thing to say about the reviews of travel systems:  Stop complaining that yours is 'too bulky'  It's a stroller.  Unless you've got a toddler, and you're using an umbrella, strollers are bulky.  \/endwhine"}
{"Reddit ID":"n53kl","Reddit Post":"First time parent here and my son is turning two this month. I just want some confirmation that I'm not such a horrible parent. I don't know what to do with this kid! He's hell bent on doing things he's not suppose to do like throwing things behind the T.V. and destroying things he knows he shouldn't touch. He been whining every two minutes for the last three hours. I don't know what he wants!! Is it me? Am I not doing the parenting thing right? I mean spanking is out of the question right, he's not at the stage yet where he would understand time-outs so how do I 'train' him out of this behaviour?\n\nThis probably more of a venting thing then asking for advice, but for those seasoned parents, tell me if I'm doing it wrong or not.\n\np.s. I've got a pretty bad cold and I'm having a little trouble thinking straight, so I may not be as clear as i normally would have, so feel free to ask for details if I'm missing something."}
{"Reddit ID":"rgb2t","Reddit Post":"My daughter is 6 months old. I have a recurring ovarian cyst condition. I only have 1 ovary left, and during the last weeks, I had a pretty big cyst on it. After a night of being sick at the hospital, they told my the cyst burst without doing any more damage. I was lucky this time.\n\nWe always wanted to have kids close together in age, but I am not ready for another one yet... I might be fine and not have another cyst for months... or not...\n\nI'm tired of this stress, I really want 2 kids in my life, however, i feel guilty to think about another child when mine is only 6 months. I feel like I am not taking the time to fully enjoy her first year....\n\nAny parent with child really close in age can tell me their story? How hard is it? Did you feel you missed something about your oldest kid first year?"}
{"Reddit ID":"lsk5w","Reddit Post":"My wife and I are of the opinion that breast is best but it now appears that our once copious supply of milk is dwindling down.  For nine months she pumped extra on top of feedings since she works nights and the extra milk would help feed my son when she's at work.  We had a freezer full of milk but we are down to our last few bags.  She will continue to feed our son but it now appears that we will have to supplement with formula, much to our disappointment.\n\nWith that considered does anyone have any advice\/recommendations on what formulas work well for you?  \n\nBTW, my son is nine months old... if that means anything"}
{"Reddit ID":"nmljh","Reddit Post":"OK, so here is the deal. We bought a toddler bed for our daughter about a month ago. She is nearly 23 months now. We thought it would be a good idea because she is potty training, jumping like a kangaroo while in the crib, etc.. She got used to it after a couple nights. She would play with her toys for a little bit after we put her down (which is a given, room+toys.. UH YEA!) then she would pass out. Recently she has started to just.. not go to sleep until at least 11;30 at night. It is driving us batty! \nShe gets one simple, not very long nap a day to keep her from tearing up the house. It was two naps until she wouldn't sleep at all. Now, it is like she doesn't want to sleep with the one nap! But, if we keep her up she is like a monkey in a tiny cage. Her dad has told me to stop letting her nap, but I need it to 1. keep my sanity, 2. actually get things done.. and the list goes on.\nHave any of you had experience with this? I ask my parents and they say \"oh you were a perfect little angel\" raaawwwrr!!!!! lies lies all lies! I don't believe it!\nSo please, any input is helpful.\nEdit: Thank you guys so much. I love what you have said so far."}
{"Reddit ID":"oiot9","Reddit Post":"Hi All\n\nMy sister and her husband recently moved to NewJersey area (from India). They have been to USA couple of times therefore they are aware of the culture and life style. But now that they have a 2.5yr old kid things are bit different. \n\nThe biggest problem is to find ways to keep my nephew occupied in some fun stuff. The kid is not used to of cold and like playing out doors which is not possible now. He is going to a pre-school for 2days a week. His proper schooling will begin in Fall. The couple does not have a very active social life in NJ area as they are pretty new. My sister needs some ideas as to what people do at home to keep kids occupied. \n\nThanks in advance for suggestions. "}
{"Reddit ID":"lhnf0","Reddit Post":"We are attempting to make up a meal plan for the month, something we've never done before.  Usually I look around and make whatever.  I'm tired of making the same old:\nSpaghetti &amp; meatballs (my favourite meal)\nChicken nuggets &amp; fries\nKraft dinner &amp; hot dogs\nChicken souvlaki &amp; rice\n\nI have 4 kids, 18 months, 3 years and two 10 year olds.  They have their favourites, they have things they absolutely outright refuse to eat (older two won't eat shrimp, 10 y.o. daughter despises beef, and on and on).\n\nDoes anyone have any new ideas I could use for meals?  \nSlow cooker ideas GREATLY welcomed here!!"}
{"Reddit ID":"rjj7w","Reddit Post":"My son will be two next month, and I would to get him a little pet. He loves animals, and has always been very gentle with them. \n\nI would obviously be taking care of it, but I would like it if he could 'help' sometimes, too.\n\nShould I just go for a fish or something like that? I would really like a dog but I'm just not sure if we're ready for that just yet.\n\nThoughts?"}
{"Reddit ID":"k1wdu","Reddit Post":"Our first baby is due in October, and we've already received the Playtex VentAire Advanced bottles as a shower gift, but we are wondering if there are any other bottles on the market that may be better, or just as good. We've heard great things about these ones, as well as the Drop-Ins. Do you all have any particular preferences?\n"}
{"Reddit ID":"fpn1g","Reddit Post":"My wife and I never liked Babywise, but it's all the rage with our friends. I've seen enough negative feedback on the Internet to make my eyebrows raise to my hairline, but I'm now becoming angry that this is so acceptable. If I start preaching against Babywise, would I be too offensive, or am I right to start taking some sort of stand against it for all parents?\n\n[Here's](http:\/\/www.amazon.com\/Becoming-Baby-Wise-Million-Trained\/dp\/1576734587\/ref=sr_1_3?ie=UTF8&amp;qid=1298308622&amp;sr=8-3) a link. Sorry if it's not as familiar to you guys. I think it could be more of a craze in Christian circles.\n\nEDIT: [Here's](http:\/\/www.babycenter.com\/0_baby-sleep-training-cry-it-out-methods_1497112.bc) another link about the \"cry it out\" methodology."}
{"Reddit ID":"ldkc5","Reddit Post":"We converted our son's crib into a toddler bed last night. He has always been a little fussy going to bed, but sometimes he will just zonk out. so last night we lay him down at 8:30, and he drinks his bottle until it is empty then gets up screaming and banging on his door. I then go cuddle him after a bit and put him back in bed once he calms down. He is getting up as I leave the room and more screaming and banging. Eventually we just got him up and let him play for a bit even though he was super tired. We then tried to put him down again and so started the screaming and pounding so I just layed in bed with him until he calmed down, for like an hour. and then I left. There was a little crying and then none. We could hear him walking around though. He finally fell asleep at 11:30 pm. I checked on him and he was in bed so I covered him up. Today he has not napped, it is like a replay of last night. Is there anything I can do to make this transition easier on him and us?"}
{"Reddit ID":"q6c2j","Reddit Post":"I was flying from Phoenix to Raliegh alone with my 1 year old this afternoon, the flight wasn't a problem since my son shares my love of travel, but when we got to baggage claim I got flustered.\n\nAt the carousel I had to pick up a large suitcase and his carseat, which was no easy task while carrying an excited little boy who wants to get down and walk. People watched as if they pitied me while I struggled to stack the carseat on the suitcase while holding a sqwirmy baby.\n\nI blew off the looks and masterfuly maneuvered baby and luggage to the cart check-out (which don't have baby seats in them) to check one out and make the tow to the parking garage easier. The carts cost 3$ so I dig through my backpack for my wallet, as luck would have it I didn't have enough 1s, but I had a 10 when the machine only accepted 1s and 5s. I set out to find someone to trade two 5s for my ten. No one, not even security would help. \n\nI eventually gave up on the cart and tried to navigate my luggage while wrestling my Christmas ham to sit still and hang on to my neck en route to the garage. Halfway across a street the carseat falls off the suitcase. Again, looks of pity but no offer to help! Eventually I made it to my truck and got home but I wondered the whole way how it was that no one lifted a finger to help me.\n\nI'm not the type of person that looks for handouts but if someone was clearly having a hard time I know I would stop and lend a helping hand. What do other parents think? Has anyone experienced this? If you saw a mother (or father) struggling would you help?"}
{"Reddit ID":"edtla","Reddit Post":"this is a hypothetical question on my part since I don't have any kids yet but a recent conversation with my boyfriend about circumcision had be wondering. \nHe was circumcised and perfectly happy about that, he thinks uncut penises look like the worms from dune. fair enough, he's straight so he'd probably not like looking at dick anyways. \n\nI personally do not like circumcision when it's performed on infants. I really think that the boy should have a say in the matter. \n\nhe thinks it's better that they're circumcised as infants so they don't have to worry about it later. \n\nI'm really firm on this that if I have a son that he's not getting circumcised unless it's absolutely necessary. \nI didn't bother asking him since it's pretty early in the relationship to be talking about having kids, but it's pretty obvious he'll want his son to be circumcised like he was. \n\nmy questions are for parents who had differing viewpoints on this as well and how they handled it when they had a son. \n\nhow would you handle something like this? \n\nNOTE: this is not about your personal views on circumcision, just how you and your partner handled having opposing viewpoints on it and what happened in the end. "}
{"Reddit ID":"hapae","Reddit Post":"That's it. I don't know if there's a parenting-social section, but I'd love to meet more like-minded mothers and fathers in the 805 (I'm in Thousand Oaks area). We go to one of the parks in the area EVERY WEEKEND with our 2 year old. So, if you're in the area, let's meet up, for crying out loud."}
{"Reddit ID":"qq7je","Reddit Post":"So last night I went to bed early and told the kids they could stay up if they acted like humans. \n\nWithin a quarter of an hour I've got an eye cracked and I'm poking my husband in the back and asking something I never thought I'd hear myself say... \"Are they breakdance-fighting to classical music?\". It sounded like they were flinging sacks of taters around and everyone was yelling things like \"Get him!\" and \"Pin him!\". And over the top of it all was Mozart at a kabillion decibels. \n\nBut man, I was proud! Mozart! Wow. Of all my LP's to play, they picked Mozart! Feeling quite smug I hollered down: TURN DOWN YOUR GODDAMNED MOZART!!!\n\nEverything downstairs went still and quiet. Then my daughter, in that \"talking to retards\" voice only a teenage girl can do called back up:\n\n\"It's BEETHOVEN, Mom!\""}
{"Reddit ID":"ee559","Reddit Post":"Hello all - my husband and I have been trying to figure out if the amount of attention we get in public with our little girl is normal.  She's 8 months old and as cute as can be.  The thing is - we get a LOT of attention when we go out with her.  Is this normal?  She's our first, and I was in no way prepared for the number of people who would stop us, want to see her, want to take pictures of her, want to ooohh and ahhh over her all the time.  \n\nI'm sure as she gets a little older, this will decrease.  It was flattering at first, but it's beginning to be a bit of a hassle sometimes.  For example, I took her to Chipotle for lunch today.  While I ate (20 minutes) nine different people came up to me to talk about her.  It made it really hard to finish my meal.  At the same time, I noticed that another baby in the restaurant who was around the same age didn't get any of this attention.  \n\nSo, parents of reddit, is this a reasonable amount of attention to expect when taking a baby out in public?  And how to you manage to get done with your activities when people keep stopping you?  And, most importantly, how do you protect the baby from these well-meaning strangers' germs during cold and flu season?"}
{"Reddit ID":"l8j8e","Reddit Post":"This morning, my youngest (she'll be 2 on Christmas) and I went to Target, to pick up a few things, when we passed by the electronics dept. \n\nThere was a man there messing with one of the demo MP3 players hooked up to Bose speakers, when he found some Bob Marley and cranked that bad boy up! My daughter, instead of being scared by the sudden loud noise, hopped up in the back of the shopping cart and started dancing furiously. \n\nWhen the guy saw her dancing, he laughed, danced along with her (from where he was standing) and sang part of \"Buffalo Soldier\" to her. She even clapped when we started to walk away a little bit later.\n\nSpontaneous acts of happiness go a long, long way. "}
{"Reddit ID":"f8exe","Reddit Post":"For reference: http:\/\/online.wsj.com\/article\/SB10001424052748704111504576059713528698754.html\n\nIn the 2 1\/2 weeks it's been since we all learned the term Tiger Mother I've oscillated wildly between thinking the woman is a saint and a demon. Her tough-love approach certainly produced the desired results, children who can out-perform their peers in the few narrow fields she chose for their education. We can debate the merits of her choices for those fields, and her methods endlessly but I'll leave that to other threads.\n\nThe itch that's been under my skin ever since is this: She tells us this is a superior way to raise children.\n\nBut that's just it, she's raising successful **children**, not successful adults. \n\nIn the end every child grows up to become an adult, and I don't see how what she's doing is helping her girls become successful members of society. I know plenty of people who can focus on a task obsessively for hours reaching for perfection: they suffer from Autism spectrum disorders and cannot hold down a paying job because they cannot work with others.  The real world we live in demands we communicate and cooperate with those around us and those very things that Amy Chau derides: sleepovers, school plays, extracurricular activities are what help us to form those vital important social skills.\n \n"}
{"Reddit ID":"q7m5r","Reddit Post":"A friend's baby shower is coming up soon and I'm thinking of getting it as a gift. Just curious whether anyone thinks it's a good idea or if it would be more of a hassle than it's worth.  Even more curious if anyone's heard if it's a scam or not.\n\nI have ZERO experience gift shopping for expectant mothers. x_x  Alternative ideas welcome.\n\nx-posted to \/r\/askreddit and \/r\/Frugal"}
{"Reddit ID":"offdq","Reddit Post":"My two year old is a very advanced speaker. While he got a late start, he speaks in full sentences, uses pronouns, and has no 'r' or 's' or 'l' problems. Lately, he started beginning sentences (specifically excited sentences) by repeating the first word a bunch of times before moving on. For example, if I say something wrong, or he doesn't agree with me, instead of \"no, daddy\", it becomes \"no no no daddy\". It's not just \"no\", either. Sometimes he repeats a word once, sometimes it'll be like 7 times before he can spit out the rest of the sentence. It's only the first word; the rest of the phrase comes out smooth. \n\nIs this just a thing that kids do sometimes? Is it something he hears other kids doing at daycare and is now emulating? Is it a speech issue I should see a professional about?\n"}
{"Reddit ID":"el2hm","Reddit Post":"I don't have a whole lot of money, but I am willing to save for a couple months (before the baby comes, btw I'm pregnant!) to get a nice one. But, not SUPER nice ... lol I need help finding what I'm looking for.\n\nWhat I want, is a nice stroller\/car seat (yes both) that is for a baby, and has a carrier that is just like snap in for both the car seat and stroller. So that it saves time and energy going to the store or other places. Also, a matching set it a big plus :)\n\nThanks"}
{"Reddit ID":"sythu","Reddit Post":"I'm a 27 y\/o female and all my life I've grown up with boys - a brother, a half brother, and two stepbrothers. You'd think this would make me want to have a boy out of familiarity, but to be honest, it's the opposite. \n\nMy hubby and I have been talking about kids and I definitely want them, and soon. I will LOVE whatever child we have, but I can't shake the feeling that I'd be heartbroken if I had a boy instead of a girl. I never got to have a sister or any girl relatives; even my young cousins were ALL boys. It sounds awful but I feel like having a boy would disappoint me, whereas having a girl would be more fun and a new experience for me (due to my history with boy children). And being a girl myself, i feel that it would be somewhat easier to raise a child of the same gender.\n\nAnyone else had this feeling? Does this make me a terrible person? How can I accept the possibility of having a boy instead of dreading it? \n\nEDIT: I'm not looking for reasons why raising a girl would suck; I just want advice on how to get rid of these feelings so I can be the best mother I can be."}
{"Reddit ID":"ftqfe","Reddit Post":"So far, I have bought a pack of 144 diapers for $12 and change, and a pack of 100 for $9.75!  You have to sign up for the \"subscribe and save\" but it is easily canceled from the \"your account\" page once you get confirmation that your order has been shipped.  Coupon codes can be stacked as long as their first two letters are different.  And free shipping if you sign up for Amazon Mom (sorry dad, they say you can sign up too though!)  Happy couponing!"}
{"Reddit ID":"kl1g0","Reddit Post":"It was only a matter of time really.  He is almost 13 which I think is pretty close to the age when I first \"hated\" my own father.  The details are unimportant, but what I assured him was that this probably wouldn't be the first time he felt this way so we might as well learn to work through it now.  I'll have to do a follow up after the showdown this weekend.  There will even be police.  Should be interesting.\n\n\n***DETAILS(edit):\n\nOkay, sorry. I'll try to make it short.\n\nBasically he is pissed at me because of some legal stuff between his mom and myself (we've been apart for 10+ years). He started off by not wanting to come to my house for my parenting time. So, like an freakin' idiot trying to be a cool dad I let it slide. 10 weeks later he stomping his foot and still saying that I can't make him come over. I'm supposed to have him every weekend and haven't seen him for 2 1\/2 months. During that time we were trying to do counseling (he and I) to get it worked out. After 3 sessions he stomped his foot again and refused to go.\n\nSoooo, I finally laid down the law - literally. Told him I was picking him up this Friday and that was that. He stomped his foot and said \"you can't make me\", but it turns out that \"YEAH I CAN\". So i told him that and also how I was going to do it. It involves the police and a neat little thing called a Civil Standby (Civil Assist).\n\nHence the \" I hate you!!!\"\n\nIt's a bit more complicated than that, but does that help clear it up?\n\n\n\n**Second Edit:\n\nThe worst part is that he really is a great kid.  Just in a difficult and emotionally trying spot that came with really lousy almost a teenager timing.\n"}
{"Reddit ID":"h16vh","Reddit Post":"My due date is May 4th ... so I could be giving birth any moment now. I want to get input from redditor moms\/dads on what to bring to the hospital. What were some things you couldn't imagine being without, or things that you wish you would have brought. A list for my boyfriend (the father) and me (the mother) would be great ;)"}
{"Reddit ID":"jl21m","Reddit Post":"I dont agree with my friend being an idiot and not using protection but i took her anyways..\nshe is pregnant again and asked me to take her;\ni dont really want to ( i cant really explain how i feel about this) but she has no one else to take her.\nshe wont tell her parents.\nin my opinion i dont think i should.\nwhat do guys you think?\n\nedit:\ni told her to use condoms and she said \"i dont like how they feel\" and she wont tell her mom becuase she is embarassed because the father is black\n\ni dont agree with any of that"}
{"Reddit ID":"g6oh0","Reddit Post":"My daughter will be 6 in May, and she's a really great kid.  I'm a single mom, and have always given her little \"chores\" around the house to help me, like dusting the windowsills or making her bed.  \n\nApparently she loves to help a little too much.  This morning, she got up at 6am, and proceeded to clean the entire house.  Wiped down the bathtub, unloaded the dishwasher (I'm still wondering how she managed this), wiped all the furniture, literally cleaned everything she could think of.\n\nWhile I'm extremely proud that she's so responsible and dedicated, I'm also a little worried.  I explained these aren't her chores, and while I appreciate it very much, she shouldn't feel she needs to do any of this.  She keeps saying she likes to help, and wants to do nice things.\n\nWhat to do now, parents?"}
{"Reddit ID":"p0i4u","Reddit Post":"Hi There, \n\nMy gf is french speaking, and I am english speaking.. we both are able to communicate in both languages... but obviously we have our preferred languages, and are better in one more than the other.. \n\nWe anticipate that our little monster (read, \"Bundle of love and joy) is going to be bilingual one day, however, I am curious if there is anyone out there who has raised a child in a similar environment (mixed language household) that has encountered any struggles, or any welcome surprises along the way. \n\n"}
{"Reddit ID":"l5qwb","Reddit Post":"I mean casual evening babysitting. I just asked my neighbor's 16 yr old daughter to babysit my 2 boys (ages 4 and almost 2) for a casual night out. What is the going rate per hour\/night for everyone else? Is $10\/hr for 2 kids reasonable? We are in Canada(Alberta) if that makes a difference..."}
{"Reddit ID":"o0cng","Reddit Post":"So far, there have been no lumps or bruises or outward signs of injury, but we have hardwood floors and I'm concerned about her when she falls. She hits hard, and we never seem to be able to catch her in time. It's not like it's happening 10 times a day, but every couple of days she will just kind of lose her grip or balance, and she falls over and thumps her head pretty good. This is my first kid, and I'm just concerned that she's going to end up with some kind of internal damage. Am I doing it wrong, or is this completely normal?"}
{"Reddit ID":"mrjs2","Reddit Post":"Just what the title says.  My wife is 4.5 months at the moment.  She is doing wonderfully so far (which is a weight off my shoulders).  \n\nFor other fathers out there - do you have any advice?  \"To do\"s or \"Not to do\"s you'd like to share?\n\nI am reaching out here because I was raised by my mother alone (she passed away before I even met my wife, so I can't even reach out to her for advice).  My father is in my life, but wasn't around for my early childhood, and he and I really didn't establish much of a bond until I was in my 20s.  Thus I have no sense of perspective on what a \"Dad\" should be for little kids.\n\nAny advice?"}
{"Reddit ID":"nfw0i","Reddit Post":"I need advice. I'm working 65+ hours a week and I'm a single parent. I want to go back to school but I just don't know how on earth I would make ends meet. How did othe7r people go about this? I have to pay my rent which is $420 a month, car payment $212, Car insurance $120, Cell phone $70 and internet $40, not to mention food, diapers and clothes for my daughter. Did you work part time? Did you still get to spend a decent amount of time with your kids? Help please!!!"}
{"Reddit ID":"ed0il","Reddit Post":"When they ask about work? When they see you so drained and ask, how long does work last? And you can either lie, or tell them the truth: it's a hideous grind, and school will be years of being forced to sit still so that if you're lucky you can someday get a job and sit still there, the rest of your life?\nIt's a ghastly world to drop them into, and we didn't fix it in time..."}
{"Reddit ID":"pz9zq","Reddit Post":"I know most times the mother wants to hurt the baby or hates the baby but what about when she is HYPER over protective, wants to give up all the pets in the house, and wants to live in a protective bubble with just the baby?  Anyone?  She runs through every worst case scenario of the dogs \/ cats interacting with the baby, is dreading daycare (she has 2 weeks left of mat leave). I know some over protectiveness is normal, but this gets to the point of tears...  a lot.\n\nForgot to add one of the more important points.  She is on Zoloft so she can still breastfeed, but is usually on Cymbalta for depression.  It had worked well all through pregnancy, but I am starting to wonder if she needs to get back on her cymbalta.  Getting her to stop breastfeeding to go back on cymbalta would be quite a challenge but U think I need to get her to go to the docs about this."}
{"Reddit ID":"izdiw","Reddit Post":"Well, baby numero uno is not even 11 months and now the magic stick says my wife is pregnant.  Doctor hasn't confirmed yet, but she says she's known for weeks.   The master plan had baby #2 coming three years after baby #1, and now we're both freaking out a little (maybe a lot)  Anybody else have a similar surprise?  How was is it way better (or way worse) than you expected?"}
{"Reddit ID":"rchd0","Reddit Post":"My mom has cautioned me to be careful when pulling a binky or a bottle from my infants mouth because \"if you yank it out too fast you'll break her sucker\" when she says this she touches a part of her head, suggesting that it will cave in a part of her skull, \"and she will lose the ability to suck and you'll have to take her to the doctor to fix it\" she is adamant about this.\nHas anybody heard this before?\n\nMy husband says we're practically sending our daughter to a witch doctor when she has her. I don't even know how to begin a google search for \"a broken sucker\""}
{"Reddit ID":"ref2a","Reddit Post":"Would you tell your child in an age appropriate way that you were molested?\n\nMy reasoning for wanting to do this is to protect them from this happening to them, and if they were in the situation they would know what was happening and would have the tools to remove themselves from an awful situation.\n\nMy mom always said no one is allowed to touch my privates when I was little but my sexual interference involved my friends older brother rubbing his penis all over my body, because he never touched my privates I didnt think it was wrong (although I knew deep down that this shouldnt happen) I didnt know how to get out of the situation so I just sat there in shame while it happened to me. I never told my mom and this happened 20 years ago...My daughter is a few months away from the age I was when that happened and I would die if someone stole her innocence like that. \n\nWhat do you think about telling your children about sexual molestation\/interference?\n  and how it can be anything from a subtle butt grab, breast cupping, rubbing, looking at porn, dirty talk... all the way up to full on rape. And if they scream and run they can get out of most of these situations. "}
{"Reddit ID":"lx5ou","Reddit Post":"Our (newly) 3 year old has developed the habit of play-fighting.  All of his toys, regardless of their intended use are now \"fighting\", basically he just bashes them together for the entire duration of his playtime.  Train tracks fight Buzz Lightyear, Thomas the tank engine and a Lego duke it out, it's a little exhausting.  We aren't even sure where he picked this up.  Does it ever end?  We aren't too concerned, mostly curious and wondering if this behavior is a phase or if the rest of reddit's parents listen to crashing plastic all day for years at a time."}
{"Reddit ID":"pp4ky","Reddit Post":"So, my day care sent home a readymade bottle for my 5mo old (They were about to feed him, but it was the end of the day, so i just took it with me). We usually give him 6oz in a bottle, and this bottle was full almost to the brim. This is a [Playtex DropIn](http:\/\/playtexbaby.com\/Bottles\/Dropins\/Premium-Nurser) bottle, FYI. \n\nSo I call up the day care and ask them what the deal is, this is much more than 6oz of formula. They tell me that they premix the formula, measure it in a separate measuring cup, and then pour 6oz of formula solution in the bottle. This confounds me, so I do a little experiment of my own. I grab my own measuring cup, fill it with 6oz of water, and pour it into the bottle. Lo and behold, it fills to something like 7.5 oz according to the markings on the side of the bottle. \n\nAm I completely missing something here, or is Playtex being very irresponsible about their dropin measurements? Has anyone run into this before? I know an +\/- an oz or two isn't really detrimental to my kid as long as he's happy and pooping normally, but I still find this very bizarre.\n\n**Update: I got some Playtex liners, and lo and behold, 6oz of water is now an accurate measurement both in a measuring cup and in a liner. That's kinda irresponsible on the off-brand liners' part.**"}
{"Reddit ID":"laqpo","Reddit Post":"My wife is a stay at home mom, but our 3 year old is at a private Montessori preschool 4 days a week, 8 hours a day. Is this too much at that age? I can't really find any sort of \"standard\" amount for school at this age. I think a lot of families with 2 working parents send their kids for 8 hours a day, 5 days a week because they are both at work, but I'm wondering if it's good for us to be sending her so long. Thanks for any advice.\n\nEDIT: She started attending preschool at 2.5 years old for first 2 days a week, also more or less full days. She really enjoyed it then, and I felt she needed the social skills as she's an only child. It's helped a lot- she has friends there now. But she seems to enjoy it less now- she often doesn't want to go to school and wants to stay home with her toys."}
{"Reddit ID":"in0cj","Reddit Post":"Bedtime has become a nightmare.\n\nJust as I type this, my son is upstairs in his room screaming and screaming and screaming at the top of his lungs.  His bedtime is about 8:00pm and it is now 9:25pm.  It's like this every single night now.  There never used to be any kind of problem getting him to sleep.\n\nI'm pretty sure he is teething right now but the baby Oragel seems to do NOTHING!\n\nHe refuses a bottle, he refuses a pacifer, he refuses me talking softly to him... nothing.  He just screams unless I pick him up (which I don't think I should do).\n\nHe's done this at least the past week and I'm getting real tired of dreading this time of night every single day.  My wife is at work so I'm on my own here. \n\nCan somebody please help a father in need!?  What do I do!?!?\n\n***EDIT &gt; UPDATE!\n***\n**Well from what I'm seeing here I've been completely wrong about the \"let them cry\" method.  It obviously wasn't working anyways.  I went ahead and just picked him up last night from his crib and the crying immediately stopped.  While he was in my arms, I looked down at him and the little turd started laughing at me.  Laughing at my misery in putting him to bed!  I gave up in the bedroom and we went downstairs and watched some TV together.  Then he fell asleep within 30 minutes like a champ.**\n\n**Thanks for all the responses.  I need to utilize this subreddit more often!\n**\n[Here is he is all happy and calm!](http:\/\/i.imgur.com\/0IrECh.jpg)"}
{"Reddit ID":"l9mzi","Reddit Post":"All kids go through it when they're toddlers, and so did she, but she got through it and became a happy, easygoing kid. This past year has been upsetting to her, though.\n\nUp until about a year ago she spent her days with her grandparents. Then they left the country for a while, and she started daycare, which she enjoyed... she had no issues being away from us all day. Her grandparents came back in February, and at the same time, her little brother was born. She went back to staying with the grandparents during the day for the whole spring; then in the summer, grandparents had to leave again. During the summer she started to throw tantrums, especially around eating, but we took it in stride, dealt with it, and things got better. She doesn't do that anymore, though like a lot of kids she just doesn't like to eat much. But she gets enough nutrition.\n\nHer grandparents (who live with us) have been back again since September, and ever since, she panics whenever grandma leaves the room, unless it's just part of her routine. Routine separations are no issue; she's all smiles when mom and I leave for work in the mornings, she goes to bed without fussing. But if someone has to step out unexpectedly, she breaks down.\n\nLast night grandma had to run an errand. In the midst of crying, my daughter sprinted across the room and tripped, of course prompting sympathy from grandma. But something seemed off - there was nothing to trip on where she fell - so in my most gentle and sympathetic voice, after she calmed down, I asked her about it. She volunteered that she fell over on purpose.\n\nEvery time, within minutes of someone leaving, she's fine again, and showing no outward signs of stress. She's not otherwise a \"clingy\" kid - she'll happily play by herself, we can put her in bed alone and she stays there."}
{"Reddit ID":"pzoja","Reddit Post":"Last night our 7 month old rolled off our platform bed, which is perhaps 1 foot off the ground. Not just off our bed, but from bed to the wooden platform (6 inches), then from the platform to the floor (5-6 inches).\n\n* I had laid him in the center of the bed and turned around to grab his shirt. My back was turned for, perhaps, two seconds. Yet he managed to roll off the bed.\n\n* He landed on his belly.\n\n* He started howling immediately.\n\n* I immediately picked him up and soothed him. After ten or fifteen seconds, he calmed right down. Breastfed just fine. Was laughing and smiling before bed.\n\n* We did a pupil dilation check with a flashlight several times yesterday and today and he seemed normal. Rotated his limbs and checked for any swelling or sensitivity. All was fine. Sleep was normal.\n\nHow long do I need to be terrified? How can I tell if this has retarded my kid? Can a concussion take awhile to take effect? And are there any additional checks I should run within the next 72 hours that may not be found on pediatric websites?\n\nEdit: Thank you for all the great info. Feel better now. We'll just monitor him for \"weird\" behavior and also never set him down ever again (joking. Sort of.)\n"}
{"Reddit ID":"sd0tz","Reddit Post":"A friend of mine asked me to illustrate a children's book for his niece. Initially he gave me a few fun facts about her like her name, her favorite color(s), and that she loved the water and was a budding artist. I created a story in verse, and am in the process of illustrating the pages in her likeness. I just wanted to get opinions out there on whether or not this would be something other parents would be interesting in purchasing.  I'll be happy to provide a sample of the written story in the comments if there is any interest.\n\nThanks!"}
{"Reddit ID":"tkxio","Reddit Post":"3 days ago while brushing her haid i found what seemed to be something like a open scratch, perhaps thought she scratched her head open as her nails was a bit long, today there are two more pimple like things on her head, the first one, i peeled off the scab without her failing or saying it is sore and it looked normal under the scab, like it was just dry skin. does anyone have a clue as to what it could be, im taking her to the doctor tomorrow, but since my medical aid savings is non existant at the moment, self medication could be an option, but i will NOT neglect my daughter and take her to the local clinic to check out, also her left hand, around her finger tips are swollen, almost like she burnt her hand, but she hasn't been out of my sight for the past 2 years. All help\/suggestions\/recomendations is HIGHLY appreciated.\n\nedit: picture:http:\/\/imgur.com\/By5cO , sorry for the shitty quality"}
{"Reddit ID":"sogbm","Reddit Post":"Not one of us approves of bullying, regardless of the circumstance. I am sure most of us attempt to tell our children how to deal with bullies, whether it is to stand up to them, walk away, or tell an adult.\n\nFriday my daughter's teacher told me Mia had been bullying two other children. She is 4.\n\nWhat do you do when your child is the bully? "}
{"Reddit ID":"pkwd8","Reddit Post":"My son made a poor decision with his iPod touch while trying to turn it into an iPhone about a year back, (Using a VOIP app, he called a friend late night about four times, this scared them because they didn't know the number, and they called the police.) and now many of his friends are getting this device and he obviously wishes to have it back after it was confiscated. Is there any reason I should give it back to him? Is there a way that he could maybe earn it back? We do let him have a netbook, and he has been mostly responsible with it, however he was caught watching Doctor Who at 11:30 on netflix with it recently. How can I truly trust that he can be responsible with this device, if he has proven himself to have been irresponsible in the past?  I feel guilty having taken it away, but more or less a parent knowing that I had too. "}
{"Reddit ID":"kzkx5","Reddit Post":"There are two bits of advice that always made sense to me when taken independently.  Put them together, though, and they seem to conflict.\n\n   * Be consistent\n   * Don't sweat the little stuff\n\nWhen I ask my son to do something, I expect him to do it without whining or trying to negotiate his way out of it.  I don't ask him to do stuff all the time, but when I do I want it to count.  He often tries to get out of things... I don't let him, but then it becomes a battle of the wills. This goes against the whole \"not sweating the little stuff\" mentality.  But dag nabbit... when I ask you to put on your shoes so we can go, I need you to put them on!!!\n\nHow do you guys deal with this without it turning into a battle every time?  I tried to do things like phrasing my requests this way, \"After you've finished racing the car around the track, we will go brush teeth and get ready for bed.\" It worked a few times, but now he's saying, \"Not one car... ten cars!!!\"\n\nIs this just always a battle and I just need to keep doing what I've been doing (remaining consistent)?  Or what? How do you guys deal?\n\n**edit:** Son is almost three and a half."}
{"Reddit ID":"qj9ps","Reddit Post":"So, we have bedtime down. I followed the Sleep Easy Solution loosely (modified CIO with quiet vocal soothing after 5 minutes, then 10, etc.) and now our 7 month old can go down awake at the end of the bedtime routine without crying. I am thrilled.\nThe issue now is naps. I still rock her to sleep and, as much as I hate to admit it, still swaddle her for naps. She sleeps longer swaddled and I am being selfish, I guess. But I don't know how to put her down awake. With bedtime, I feel like she knows it's time for night-night so she is fine. But I feel like if I do that in the middle of the day for naps, she'll think I just abandoned her. She doesn't have strict nap times yet, they still depend on the time and duration of the previous naps as well as her sleep cues. How do you all do it?"}
{"Reddit ID":"hiiy1","Reddit Post":"We're expecting our first little one in 2 months, and thinking now might be a good time to invest in something a little better at video than our point &amp; shoot (and phones).  Any positive\/negative experiences to share?\nedit:  I should add I can get reviews from Amazon, cnet, etc, but thinking more about larger questions like \"quick and convenient\" vs \"HD everything super zoom\". "}
{"Reddit ID":"p5i06","Reddit Post":"So my senior Kid 4,5 of age has been diagnosed with \"Average Severity Autistism\", we are still waiting for a (more extended) second opinion diagnosis, but I totally agree with first opinion as there is a severe language and learning disability. We used to try home-teaching with no results. He was accepted into a special abilitation center, so we are handling it more or less. We will make further decisions once we have a more extended diagnosis.    \nI am having major concerns for my middle kid - 3 years old. He is also severally language challenged, only likes to mimic some animals and other sounds sporadically and a few main words on a rare occasion. I believe I saw a disappointing sign  this evening. He is able to handle undressing as well as putting on some of the clothing. I gave him pajama pants to putt on by himself. While some direction was required how to hold them, he put both legs into one hole and did not try to fix that problem by himself.  \nI am wondering if this type of nearsightedness is a sign of Autism or it is the same with regular kids? When I see others kids they seem  much more flexible.  \nWould you like to share some anecdotes from your own personal experience and the outcomes when they grown up?"}
{"Reddit ID":"n9nzo","Reddit Post":"My 4 year old refuses to stay in bed in the morning.  He gets up between 5 and 6, will get into cupboards, turn on the tv, wake up his sisters, pretty much whatever he wants.  We are at a loss on ways to keep him in his room.  Does Reddit have any suggestions?"}
{"Reddit ID":"nxhpj","Reddit Post":"I have became aware of some really troubling news as what some boards on reddit are advising to our underage children.\n\nSpecifically lying to us and starting internal conflicts in the family.\n\nThis greatly concerns me my family and kids, and I hoped that you too could be informed about the situation, in order to prevent any unnecessary drama in our youths life's. \n\nThe subject was the recruiting of underage children by r\/athesim;\n\nhttp:\/\/www.reddit.com\/r\/atheism\/comments\/nwtsr\/dear_ratheists\/"}
{"Reddit ID":"mxoqf","Reddit Post":"My daughter is 3 and LOVES the [Tinkerbell movie](http:\/\/www.amazon.com\/gp\/product\/B000XUOIQY\/ref=pd_lpo_k2_dp_sr_1?pf_rd_p=486539851&amp;pf_rd_s=lpo-top-stripe-1&amp;pf_rd_t=201&amp;pf_rd_i=B004OI42AS&amp;pf_rd_m=ATVPDKIKX0DER&amp;pf_rd_r=00X9WE3C34JJ2DH8TDPA).  It's all she wants to watch anymore.  We do other stuff throughout the day obviously, but when it's quiet time or I take a shower or it's yucky outside, it is ALWAYS this movie.  I've tried the classics that I loved as a little girl (The little Mermaid, Beauty and the Beast, Winnie The Pooh, etc.) all to no avail.  :("}
{"Reddit ID":"lzmue","Reddit Post":"I've seen a few medical questions here, and these make me a bit curious, because even though I have very poor medical insurance, I can get any of my medical questions answered for free, 24 hours per day.\n\nI simply look up the number for the consulting nurse at my insurance provider, call, and ask my question.  The person answering it is a nurse, and if the nurse has a problem answering it, they put me on hold, talk to a doctor, and get back to me with a doctor's advice.  It's a toll-free call and I'm not billed.\n\nMy provider is Group Health in Washington State (I thought they were national but apparently it's only Washington and Idaho).\n\nDo other insurance providers not offer a consulting nurse?  Because if they offer this service, they are a perfect way to get qualified medical advice regarding issues affecting children.\n"}
{"Reddit ID":"pbjzc","Reddit Post":"If you haven't seen it, it is based upon a true story and features an inner city black kid from Memphis who ends up living with a rich white family, attending private school and getting a football scholarship (and more, but I won't give too much away).  The movie is based in ~2005\n\nIn one scene, the white mother is at the country club having lunch with 3 other ladies.  The 3 other ladies are basically questioning her decision to have a \"large, black man\" living in her home.\n\nMy daughter says, \"is this in 1963 or something\"?  We started explaining that is was about 7 years ago and how some people still hold old fashioned attitudes in some areas.  Her response, and I quote: \"What the hell's wrong with black people?  These people are crazy!\"\n\nIf \"hell\" counts, I think its the first time she's cussed in my presence."}
{"Reddit ID":"k2i32","Reddit Post":"I need to know if other parents have advice on this issue.  My smart, pretty, creative six-year-old picks her nose.  She often does so when she is nervous.  This week it happened on her second day of school - I know she was nervous because we moved to a new state over the summer and is eager to make friends at her new school.  I feel so bad for her; she picked her nose so much that she ended up with a giant nosebleed!  Which, of course, is embarrassing.  And makes her feel nervous.  So she picks her nose.. \n\n"}
{"Reddit ID":"rbci6","Reddit Post":"My 10 month old son is SEVERELY allergic to wheat, eggs, and peanuts(and all tree nuts). I can't find a recipe for a birthday cake out there is that is free of all of these. So I've come to you ... Does anyone have a recipe for my sons birthday cake? Thankyou"}
{"Reddit ID":"qir67","Reddit Post":"Hello, All~\n\nI've been invited to China for a month this summer (all of July) to teach English to middle school students and establish rapport with our \"sister city\" in XinJin.  My 8-year old son and 6-year old daughter may accompany me - they would be with a nanny 4-5 hours a day while I teach, and then we would have evenings\/weekends to explore the city\/country\/etc.  \n\nThis is a once-in-a-lifetime opportunity for me, and possibly my children, but I'm having anxiety...I need help convincing myself to do it.  Please help.  \n\nThings I'm worried about:\n\nFood - my children are picky eaters.  We could start experimenting with foods for the next few months.  \n\nTransportation - should we bring scooters?  Buy bicycles?  We currently live outside of Denver, \"entertainment\" - we live in a house, with a dog and a yard.  In China, we will live in a hotel.\n\nMeltdowns - my almost-6-year old had a major meltdown last night. \nI realized that she was hungry and tired, but as a single parent, I'm worried that the stress of being in a foreign country will put my right over the edge.  Obviously, I'll plan on bringing comfort items, as well as a laptop or tablet to communicate with friends and family back home.  \n\nSo, Reddit Parents - am I crazy for considering this trip to China with my kiddos?  Or, might this be an incredible experience "}
{"Reddit ID":"j4kp8","Reddit Post":"Hi parents! Just wondering how you organize the kid toys. We have a 17 month old and the toys are getting bigger and more elaborate and harder to throw in a  box in the corner of the living room. There's an Ikea nearby but it just feels so overwhelming to come up with something utilitarian but not hideous. How do you deal with all the kid clutter? We're not drowning yet, but the water's rising fast. "}
{"Reddit ID":"t7wrr","Reddit Post":"My girlfriend's daughter will be 2 soon and she LOVES books. I can't always be around when she is going to bed. So my plan is to buy two of the same \"bedtime stories\" book; then, I can read to her over the phone while they follow along.\n\nIdeally it would have multiple stories and pictures.\n\n**Edit: Thank you for the ideas!**"}
{"Reddit ID":"tldug","Reddit Post":"He is too afraid of the dark so he won't even go by himself upstairs into his room, even though recently at 9pm when he sleeps it's not even fully dark outside yet. Maybe he's more afraid of going upstairs alone at night time (not necessarily afraid of the dark), or maybe he's more afraid of just being alone upstairs. I have to sit on the bed with him while he sleeps (putting him to sleep), and then I can safely walk away safely after he has fallen asleep completely. If I walk away 2 minutes into putting him to sleep, while he hasn't fallen asleep yet, he'll tell me 'please stay', almost begging me to stay. If I tell him to go up and sleep by himself, he refuses. If he stays up late downstairs, then he might just fall asleep on the sofa. This is becoming a headache and it wastes about 20-30 mins of my time every night while putting him to sleep.\n\nIt's been like this for years, I just figured one day he'll say 'ok I'm ready to do this on my own'. I want him to go up and fall asleep by himself.\n\nSo to sum up, he is scared of the night time and sleeping alone. Reddit parenting, how do I solve this issue nicely and cleanly?"}
{"Reddit ID":"fqd2t","Reddit Post":"Does anyone know where I could look for public indoor playspaces for my soon-to-be-toddlers? \n\nWe have twins who are on the verge of crawling but we live in a tiny 1 bedroom apartment so there's very little room for them. It's too cold and muddy to take them outside so we are looking for indoor places we could take them. The local mall has a little indoor playground but it's very crowded with older kids and doesn't have much \"soft space\" for babies. A friend told me about a community playroom she once took her kids too but I don't know how to go about finding one near me."}
{"Reddit ID":"pscdv","Reddit Post":"Six months after our second child, she decided to enter a boudoir photo contest.  It took a lot of guts but I think the [results](https:\/\/www.facebook.com\/photo.php?fbid=361522470538796&amp;set=a.361522117205498.90549.112331498791229&amp;type=1&amp;theater) speak for themselves.\n\nShe told me long ago the only chance I have to get pics like this is if a professional takes them. I figured it would never happen because they're very expensive and with two young kids on a single income, there was no way.  \n\nThen, a local boudoir photographer ran a contest where the winner gets a full set of photos and prints.  She's promised to do a full boudoir shoot for me if she wins this contest, and I could really use your support.\n\nThe winner is decided by Facebook \"Likes\", and I'd really appreciate the support of some fellow new parents.  I think it took a lot of guts to do this 6 months after having a baby, and it would mean a lot to her to win (she says she doesn't feel \"sexy\" anymore). \n\nedit: Thanks very much for all your support and nice comments!\n\nIf you wouldn't mind, could you help me show her she IS still sexy by \"Liking\" [this photo?](https:\/\/www.facebook.com\/photo.php?fbid=361522470538796&amp;set=a.361522117205498.90549.112331498791229&amp;type=1&amp;theater)\n\nEdit: Forgot to mention the pics are not nude, she's wearing panties and a shirt.  While tastefully done, they may be NSFW depending on your office culture."}
{"Reddit ID":"kbb6v","Reddit Post":"One of my kids is in the first grade.  They started school at the beginning of August.  The teacher sits at her desk basically all day while the kids do worksheets that are overly simplistic even for their young age.  Friday, she sent home progress reports.  The scores just didn't really fit my son's strengths and weaknesses.  A friend that also has a child in the class and I compared notes and the scores for both children were exactly the same-all 19 of them.  So, I'm guessing she just filled this evaluation the same for each student.  What do you think I should do about it?  I don't want to alienate her considering she is my kid's teacher, but this doesn't seem right.  I'm new at this school thing (as a parent) and would love your opinions.  Thanks."}
{"Reddit ID":"ippv0","Reddit Post":"Let me start off by first saying, im not the one to ask people for stuff. It hurts my pride so bad, but this little angel is the world to me and i need to be prepared as much as i can. I am due Nov 15. I do work, but im in the process of moving out of my sisters so EVERY cent i am making is going towards finding a new place while paying her for the time i am still here. I am not asking for money at all, but i am asking for any items for a baby girl that are in good condition.\n\nMy friend suggested this website on babycenter, so I was just giving it a try! lol\n\nI live in BIRIMINGHAM AL. i do have a walmart registry!\n\nThank you all for just reading this, God bless you all!\n"}
